[
    {
        "Date": "Invalid Date",
        "Details": "Roman consuls begin their year in office."
    },
    {
        "Date": "Invalid Date",
        "Details": "The Julian calendar takes effect as the civil calendar of the Roman Empire, establishing January 1 as the new date of the new year."
    },
    {
        "Date": "Invalid Date",
        "Details": "The Roman Senate posthumously deifies Julius Caesar."
    },
    {
        "Date": "Invalid Date",
        "Details": "The Roman legions in Germania Superior refuse to swear loyalty to Galba. They rebel and proclaim Vitellius as emperor."
    },
    {
        "Date": "193-1-1",
        "Details": "The Senate chooses Pertinax against his will to succeed Commodus as Roman emperor."
    },
    {
        "Date": "404-1-1",
        "Details": "Telemachus, a Christian monk, is killed for attempting to stop a gladiators' fight in the public arena held in Rome."
    },
    {
        "Date": "417-1-1",
        "Details": "Emperor Honorius forces Galla Placidia into marriage to Constantius, his famous general (magister militum)."
    },
    {
        "Date": "1001-1-1",
        "Details": "Grand Prince Stephen I of Hungary is named the first King of Hungary by Pope Sylvester II."
    },
    {
        "Date": "1068-1-1",
        "Details": "Romanos IV Diogenes marries Eudokia Makrembolitissa and is crowned Byzantine Emperor."
    },
    {
        "Date": "1259-1-1",
        "Details": "Michael VIII Palaiologos is proclaimed co-emperor of the Empire of Nicaea with his ward John IV Laskaris."
    },
    {
        "Date": "1438-1-1",
        "Details": "Albert II of Habsburg is crowned King of Hungary."
    },
    {
        "Date": "1502-1-1",
        "Details": "The present-day location of Rio de Janeiro, Brazil is first explored by the Portuguese."
    },
    {
        "Date": "1515-1-1",
        "Details": "King Francis I of France succeeds to the French throne."
    },
    {
        "Date": "1527-1-1",
        "Details": "Croatian nobles elect Ferdinand I of Austria as King of Croatia in the Parliament on Cetin."
    },
    {
        "Date": "1600-1-1",
        "Details": "Scotland begins its numbered year on January 1 instead of March 25."
    },
    {
        "Date": "1651-1-1",
        "Details": "Charles II is crowned King of Scotland."
    },
    {
        "Date": "1700-1-1",
        "Details": "Russia begins using the Anno Domini era instead of the Anno Mundi era of the Byzantine Empire."
    },
    {
        "Date": "1707-1-1",
        "Details": "John V is crowned King of Portugal."
    },
    {
        "Date": "1739-1-1",
        "Details": "Bouvet Island is discovered by French explorer Jean-Baptiste Charles Bouvet de Lozier."
    },
    {
        "Date": "1772-1-1",
        "Details": "The first traveler's cheques, which can be used in 90 European cities, go on sale in London, England."
    },
    {
        "Date": "1773-1-1",
        "Details": "The hymn that became known as \"Amazing Grace\", then titled \"1 Chronicles 17:16-17\" is first used to accompany a sermon led by John Newton in the town of Olney, Buckinghamshire, England."
    },
    {
        "Date": "1776-1-1",
        "Details": "American Revolutionary War: Norfolk, Virginia is burned by combined Royal Navy and Continental Army action."
    },
    {
        "Date": "1781-1-1",
        "Details": "American Revolutionary War: One thousand five hundred soldiers of the 6th Pennsylvania Regiment under General Anthony Wayne's command rebel against the Continental Army's winter camp in Morristown, New Jersey in the Pennsylvania Line Mutiny of 1781."
    },
    {
        "Date": "1788-1-1",
        "Details": "First edition of The Times of London, previously The Daily Universal Register, is published."
    },
    {
        "Date": "1801-1-1",
        "Details": "The legislative union of Kingdom of Great Britain and Kingdom of Ireland is completed to form the United Kingdom of Great Britain and Ireland."
    },
    {
        "Date": "1801-1-1",
        "Details": "Ceres, the largest and first known object in the Asteroid belt, is discovered by Giuseppe Piazzi."
    },
    {
        "Date": "1803-1-1",
        "Details": "Emperor Gia Long orders all bronze wares of the Tây Sơn dynasty to be collected and melted into nine cannons for the Royal Citadel in Huế, Vietnam."
    },
    {
        "Date": "1804-1-1",
        "Details": "French rule ends in Haiti. Haiti becomes the first black republic and second independent country in North America after the United States"
    },
    {
        "Date": "1806-1-1",
        "Details": "The French Republican Calendar is abolished."
    },
    {
        "Date": "1808-1-1",
        "Details": "The United States bans the importation of slaves."
    },
    {
        "Date": "1810-1-1",
        "Details": "Major-General Lachlan Macquarie officially becomes Governor of New South Wales"
    },
    {
        "Date": "1812-1-1",
        "Details": "The Bishop of Durham, Shute Barrington, orders troops from Durham Castle to break up a miners' strike in Chester-le-Street, Co. Durham"
    },
    {
        "Date": "1822-1-1",
        "Details": "The Greek Constitution of 1822 is adopted by the First National Assembly at Epidaurus."
    },
    {
        "Date": "1833-1-1",
        "Details": "The United Kingdom claims sovereignty over the Falkland Islands."
    },
    {
        "Date": "1847-1-1",
        "Details": "The world's first \"Mercy\" Hospital is founded in Pittsburgh by the Sisters of Mercy; the name will go on to grace over 30 major hospitals throughout the world."
    },
    {
        "Date": "1860-1-1",
        "Details": "First Polish stamp is issued."
    },
    {
        "Date": "1861-1-1",
        "Details": "Porfirio Díaz conquers Mexico City, Mexico."
    },
    {
        "Date": "1863-1-1",
        "Details": "American Civil War: The Emancipation Proclamation takes effect in Confederate territory."
    },
    {
        "Date": "1877-1-1",
        "Details": "Queen Victoria of the United Kingdom is proclaimed Empress of India."
    },
    {
        "Date": "1881-1-1",
        "Details": "Ferdinand de Lesseps begins French construction of the Panama Canal."
    },
    {
        "Date": "1885-1-1",
        "Details": "Twenty-five nations adopt Sandford Fleming's proposal for standard time (and also, time zones)"
    },
    {
        "Date": "1890-1-1",
        "Details": "Eritrea is consolidated into a colony by the Italian government."
    },
    {
        "Date": "1892-1-1",
        "Details": "Ellis Island opens to begin processing immigrants into the United States."
    },
    {
        "Date": "1898-1-1",
        "Details": "New York, New York annexes land from surrounding counties, creating the City of Greater New York. The four initial boroughs, Manhattan, Brooklyn, Queens, and The Bronx, are joined on January 25 by Staten Island to create the modern city of five boroughs."
    },
    {
        "Date": "1899-1-1",
        "Details": "Spanish rule ends in Cuba."
    },
    {
        "Date": "1901-1-1",
        "Details": "Nigeria becomes a British protectorate."
    },
    {
        "Date": "1901-1-1",
        "Details": "The British colonies of New South Wales, Queensland, Victoria, South Australia, Tasmania, and Western Australia federate as the Commonwealth of Australia; Edmund Barton is appointed the first Prime Minister."
    },
    {
        "Date": "1902-1-1",
        "Details": "The first American college football bowl game, the Rose Bowl between Michigan and Stanford, is held in Pasadena, California."
    },
    {
        "Date": "1908-1-1",
        "Details": "For the first time, a ball is dropped in New York City's Times Square to signify the start of the New Year at midnight."
    },
    {
        "Date": "1910-1-1",
        "Details": "Captain David Beatty is promoted to Rear admiral, and becomes the youngest admiral in the Royal Navy (except for Royal family members), since Horatio Nelson."
    },
    {
        "Date": "1912-1-1",
        "Details": "The Republic of China is established."
    },
    {
        "Date": "1914-1-1",
        "Details": "The SPT Airboat Line becomes the world's first scheduled airline to use a winged aircraft."
    },
    {
        "Date": "1920-1-1",
        "Details": "The Belorussian Communist Organisation is founded as a separate party."
    },
    {
        "Date": "1923-1-1",
        "Details": "Britain's Railways are grouped into the Big Four: LNER, GWR, SR, and LMS."
    },
    {
        "Date": "1927-1-1",
        "Details": "The Cristero War begins in Mexico."
    },
    {
        "Date": "1928-1-1",
        "Details": "Boris Bazhanov defects through Iran. He is the only assistant of Joseph Stalin's secretariat to have defected from the Eastern Bloc."
    },
    {
        "Date": "1929-1-1",
        "Details": "The former municipalities of Point Grey, British Columbia and South Vancouver, British Columbia are amalgamated into Vancouver."
    },
    {
        "Date": "1932-1-1",
        "Details": "The United States Post Office Department issues a set of 12 stamps commemorating the 200th anniversary of George Washington's birth."
    },
    {
        "Date": "1934-1-1",
        "Details": "Alcatraz Island becomes a United States federal prison."
    },
    {
        "Date": "1934-1-1",
        "Details": "Nazi Germany passes the \"Law for the Prevention of Genetically Diseased Offspring\"."
    },
    {
        "Date": "1937-1-1",
        "Details": "Safety glass in vehicle windscreens becomes mandatory in the United Kingdom."
    },
    {
        "Date": "1942-1-1",
        "Details": "The Declaration by United Nations is signed by twenty-six nations."
    },
    {
        "Date": "1945-1-1",
        "Details": "World War II: In retaliation for the Malmedy massacre, U.S. troops kill 60 German POWs at Chenogne."
    },
    {
        "Date": "1945-1-1",
        "Details": "World War II: The German Luftwaffe launches Operation Bodenplatte, a massive, but failed attempt to knock out Allied air power in northern Europe in a single blow."
    },
    {
        "Date": "1947-1-1",
        "Details": "The American and British occupation zones in Germany, after World War II, merge to form the Bizone, which later (with the French zone) became part of West Germany."
    },
    {
        "Date": "1947-1-1",
        "Details": "The Canadian Citizenship Act 1946 comes into effect, converting British subjects into Canadian citizens. Prime Minister William Lyon Mackenzie King becomes the first Canadian citizen."
    },
    {
        "Date": "1948-1-1",
        "Details": "The British railway network is nationalized to form British Railways."
    },
    {
        "Date": "1949-1-1",
        "Details": "United Nations cease-fire takes effect in Kashmir from one minute before midnight. War between India and Pakistan stops accordingly."
    },
    {
        "Date": "1950-1-1",
        "Details": "Standard practice uses this day as the origin of the age scale Before Present"
    },
    {
        "Date": "1956-1-1",
        "Details": "Sudan achieves independence from Egypt and the United Kingdom."
    },
    {
        "Date": "1957-1-1",
        "Details": "George Town, Penang becomes a city by a royal charter granted by Elizabeth II."
    },
    {
        "Date": "1958-1-1",
        "Details": "European Economic Community established on this day."
    },
    {
        "Date": "1959-1-1",
        "Details": "Fulgencio Batista, dictator of Cuba, is overthrown by Fidel Castro's forces during the Cuban Revolution."
    },
    {
        "Date": "1960-1-1",
        "Details": "Cameroon achieves independence from France and the United Kingdom."
    },
    {
        "Date": "1962-1-1",
        "Details": "Western Samoa achieves independence from New Zealand; its name is changed to the Independent State of Western Samoa."
    },
    {
        "Date": "1964-1-1",
        "Details": "The Federation of Rhodesia and Nyasaland is divided into the independent republics of Zambia and Malawi, and the British-controlled Rhodesia."
    },
    {
        "Date": "1965-1-1",
        "Details": "The People's Democratic Party of Afghanistan is founded in Kabul, Afghanistan."
    },
    {
        "Date": "1971-1-1",
        "Details": "Cigarette advertisements are banned on American television."
    },
    {
        "Date": "1973-1-1",
        "Details": "Denmark, the United Kingdom, and Ireland are admitted into the European Economic Community."
    },
    {
        "Date": "1978-1-1",
        "Details": "Air India Flight 855 Boeing 747 crashes into the sea, due to instrument failure and pilot disorientation, off the coast of Bombay, India, killing 213."
    },
    {
        "Date": "1979-1-1",
        "Details": "Formal diplomatic relations are established between China and the United States."
    },
    {
        "Date": "1981-1-1",
        "Details": "Greece is admitted into the European Community."
    },
    {
        "Date": "1982-1-1",
        "Details": "Peruvian Javier Pérez de Cuéllar becomes the first Latin American to hold the title of Secretary-General of the United Nations."
    },
    {
        "Date": "1983-1-1",
        "Details": "The ARPANET officially changes to using the Internet Protocol, creating the Internet."
    },
    {
        "Date": "1984-1-1",
        "Details": "The original American Telephone & Telegraph Company is divested of its 22 Bell System companies as a result of the settlement of the 1974 United States Department of Justice antitrust suit against AT&T."
    },
    {
        "Date": "1984-1-1",
        "Details": "Brunei becomes independent of the United Kingdom."
    },
    {
        "Date": "1985-1-1",
        "Details": "The first British mobile phone call is made by Michael Harrison to his father Sir Ernest Harrison, chairman of Vodafone."
    },
    {
        "Date": "1986-1-1",
        "Details": "Aruba becomes independent of Curaçao, though it remains in free association with the Netherlands."
    },
    {
        "Date": "1988-1-1",
        "Details": "The Evangelical Lutheran Church in America comes into existence, creating the largest Lutheran denomination in the United States."
    },
    {
        "Date": "1989-1-1",
        "Details": "The Montreal Protocol comes into force, stopping the use of chemicals contributing to ozone depletion."
    },
    {
        "Date": "1990-1-1",
        "Details": "David Dinkins is sworn in as New York City's first black mayor."
    },
    {
        "Date": "1993-1-1",
        "Details": "Dissolution of Czechoslovakia: Czechoslovakia is divided into the Czech Republic and Slovakia."
    },
    {
        "Date": "1994-1-1",
        "Details": "The Zapatista Army of National Liberation initiates twelve days of armed conflict in the Mexican state of Chiapas."
    },
    {
        "Date": "1994-1-1",
        "Details": "The North American Free Trade Agreement (NAFTA) comes into effect."
    },
    {
        "Date": "1995-1-1",
        "Details": "The World Trade Organization goes into effect."
    },
    {
        "Date": "1995-1-1",
        "Details": "The Draupner wave in the North Sea in Norway is detected, confirming the existence of freak waves."
    },
    {
        "Date": "1996-1-1",
        "Details": "Curaçao gains limited self-government, though it remains within free association with the Netherlands."
    },
    {
        "Date": "1998-1-1",
        "Details": "Russia begins to circulate new rubles to stem inflation and promote confidence."
    },
    {
        "Date": "1999-1-1",
        "Details": "Euro currency is introduced in 11 member nations of the European Union (with the exceptions of the United Kingdom, Denmark, Greece and Sweden; Greece later adopts the euro)."
    },
    {
        "Date": "2002-1-1",
        "Details": "Euro currency becomes legal tender in twelve of the European Union's member states."
    },
    {
        "Date": "2004-1-1",
        "Details": "In a vote of confidence, General Pervez Musharraf wins 658 out of 1,170 votes in the Electoral College of Pakistan, and according to Article 41(8) of the Constitution of Pakistan, is \"deemed to be elected\" to the office of President until October 2007."
    },
    {
        "Date": "2007-1-1",
        "Details": "Adam Air Flight 574 disappears over Sulawesi Strait, Indonesia with 102 people on board."
    },
    {
        "Date": "2009-1-1",
        "Details": "Sixty-six people die in a nightclub fire in Bangkok, Thailand."
    },
    {
        "Date": "2010-1-1",
        "Details": "A suicide car bomber detonates at a volleyball tournament in Lakki Marwat, Pakistan, killing 105 and injuring 100 more."
    },
    {
        "Date": "2011-1-1",
        "Details": "A bomb explodes as Coptic Christians in Alexandria, Egypt, leave a new year service, killing 23 people."
    },
    {
        "Date": "2013-1-1",
        "Details": "At least 60 people are killed and 200 injured in a stampede after celebrations at Félix Houphouët-Boigny Stadium in Abidjan, Ivory Coast."
    },
    {
        "Date": "2016-1-1",
        "Details": "The Address Downtown Dubai burns over midnight as the New Year is rung in. The blaze started on the night of New Year's Eve 2015, by currently unknown causes. There was one fatality."
    },
    {
        "Date": "2017-1-1",
        "Details": "An attack on a nightclub in Istanbul, Turkey, during New Year's celebrations, kills at least 39 people and injures more than 60 others."
    },
    {
        "Date": "2017-1-1",
        "Details": "Portuguese politician and diplomat António Guterres was officially elected Secretary-General of the United Nations."
    }
],
[
    {
        "Date": "366-1-2",
        "Details": "The Alemanni cross the frozen Rhine in large numbers, invading the Roman Empire."
    },
    {
        "Date": "533-1-2",
        "Details": "Mercurius becomes Pope John II, the first pope to adopt a new name upon elevation to the papacy."
    },
    {
        "Date": "1492-1-2",
        "Details": "Reconquista: the Emirate of Granada, the last Moorish stronghold in Spain, surrenders."
    },
    {
        "Date": "1777-1-2",
        "Details": "American Revolutionary War: American forces under the command of George Washington repulsed a British attack at the Battle of the Assunpink Creek near Trenton, New Jersey."
    },
    {
        "Date": "1788-1-2",
        "Details": "Georgia becomes the fourth state to ratify the United States Constitution."
    },
    {
        "Date": "1791-1-2",
        "Details": "Big Bottom massacre in the Ohio Country, marking the beginning of the Northwest Indian War."
    },
    {
        "Date": "1818-1-2",
        "Details": "The British Institution of Civil Engineers is founded."
    },
    {
        "Date": "1833-1-2",
        "Details": "Reassertion of British sovereignty over the Falkland Islands."
    },
    {
        "Date": "1860-1-2",
        "Details": "The discovery of the planet Vulcan is announced at a meeting of the French Academy of Sciences in Paris, France."
    },
    {
        "Date": "1863-1-2",
        "Details": "American Civil War: The Battle of Stones River (a.k.a. Battle of Murfreesboro) resumes in central Tennessee after a day's respite, resulting in a significant Union victory."
    },
    {
        "Date": "1865-1-2",
        "Details": "Uruguayan War: The Siege of Paysandú ends as Brazilian and Coloradans capture Paysandú, Uruguay."
    },
    {
        "Date": "1900-1-2",
        "Details": "American statesman and diplomat John Hay announces the Open Door Policy to promote trade with China."
    },
    {
        "Date": "1905-1-2",
        "Details": "Russo-Japanese War: The Russian garrison surrenders at Port Arthur, China."
    },
    {
        "Date": "1920-1-2",
        "Details": "The second Palmer Raid takes place with another 6,000 suspected communists and anarchists arrested and held without trial. These raids take place in several U.S. cities."
    },
    {
        "Date": "1941-1-2",
        "Details": "World War II: German bombing severely damages the Llandaff Cathedral in Cardiff, Wales, United Kingdom."
    },
    {
        "Date": "1942-1-2",
        "Details": "The Federal Bureau of Investigation (FBI) convicts 33 members of a German spy ring headed by Fritz Joubert Duquesne in the largest espionage case in United States history—the Duquesne Spy Ring."
    },
    {
        "Date": "1942-1-2",
        "Details": "World War II: Manila, Philippines is captured by Japanese forces."
    },
    {
        "Date": "1945-1-2",
        "Details": "World War II: Nuremberg, Germany is severely bombed by Allied forces."
    },
    {
        "Date": "1949-1-2",
        "Details": "Luis Muñoz Marín becomes the first democratically elected Governor of Puerto Rico."
    },
    {
        "Date": "1955-1-2",
        "Details": "Panamanian president José Antonio Remón Cantera is assassinated."
    },
    {
        "Date": "1959-1-2",
        "Details": "Luna 1, the first spacecraft to reach the vicinity of the Moon and to orbit the Sun, is launched by the Soviet Union."
    },
    {
        "Date": "1963-1-2",
        "Details": "Vietnam War: The Viet Cong wins its first major victory."
    },
    {
        "Date": "1967-1-2",
        "Details": "Ronald Reagan sworn in as Governor of California"
    },
    {
        "Date": "1971-1-2",
        "Details": "The second Ibrox disaster kills 66 fans at a Rangers-Celtic association football (soccer) match."
    },
    {
        "Date": "1974-1-2",
        "Details": "United States President Richard Nixon signs a bill lowering the maximum U.S. speed limit to 55 MPH in order to conserve gasoline during an OPEC embargo."
    },
    {
        "Date": "1975-1-2",
        "Details": "A bomb blast at Samastipur, Bihar, India, fatally wounds Lalit Narayan Mishra, Minister of Railways"
    },
    {
        "Date": "1976-1-2",
        "Details": "The Gale of January 1976 begins, which results in coastal flooding around the southern North Sea coasts, resulting in at least 82 deaths and US$1.3 billion in damage."
    },
    {
        "Date": "1981-1-2",
        "Details": "One of the largest investigations by a British police force ends when serial killer Peter Sutcliffe, the \"Yorkshire Ripper\", is arrested in Sheffield, South Yorkshire."
    },
    {
        "Date": "1992-1-2",
        "Details": "Leaders of armed opposition declare the President Zviad Gamsakhurdia deposed during a military coup in Georgia."
    },
    {
        "Date": "1993-1-2",
        "Details": "Sri Lankan Civil War: The Sri Lanka Navy kill 35-100 civilians on the Jaffna Lagoon."
    },
    {
        "Date": "1999-1-2",
        "Details": "A brutal snowstorm smashes into the Midwestern United States, causing 14 inches (359 mm) of snow in Milwaukee, Wisconsin, and 19 inches (487 mm) in Chicago, where temperatures plunge to -13 °F (-25 °C); 68 deaths are reported."
    },
    {
        "Date": "2004-1-2",
        "Details": "Stardust successfully flies past Comet Wild 2, collecting samples that are returned to Earth."
    },
    {
        "Date": "2006-1-2",
        "Details": "An explosion in a coal mine in Sago, West Virginia traps and kills 12 miners, leaving only one survivor."
    }
],
[
    {
        "Date": "1521-1-3",
        "Details": "Pope Leo X excommunicates Martin Luther in the papal bull Decet Romanum Pontificem."
    },
    {
        "Date": "1653-1-3",
        "Details": "By the Coonan Cross Oath, the Eastern Church in India cuts itself off from colonial Portuguese tutelage."
    },
    {
        "Date": "1749-1-3",
        "Details": "Benning Wentworth issues the first of the New Hampshire Grants, leading to the establishment of Vermont."
    },
    {
        "Date": "1749-1-3",
        "Details": "The first issue of Berlingske, Denmark's oldest continually operating newspaper, is published."
    },
    {
        "Date": "1777-1-3",
        "Details": "American General George Washington defeats British General Lord Cornwallis at the Battle of Princeton."
    },
    {
        "Date": "1815-1-3",
        "Details": "Austria, the United Kingdom, and France form a secret defensive alliance against Prussia and Russia."
    },
    {
        "Date": "1823-1-3",
        "Details": "Stephen F. Austin receives a grant of land in Texas from the government of Mexico."
    },
    {
        "Date": "1848-1-3",
        "Details": "Joseph Jenkins Roberts is sworn in as the first president of Liberia."
    },
    {
        "Date": "1861-1-3",
        "Details": "American Civil War: Delaware votes not to secede from the United States."
    },
    {
        "Date": "1868-1-3",
        "Details": "Meiji Restoration in Japan: The Tokugawa shogunate is abolished; agents of Satsuma and Chōshū seize power."
    },
    {
        "Date": "1870-1-3",
        "Details": "Construction of the Brooklyn Bridge begins."
    },
    {
        "Date": "1871-1-3",
        "Details": "Battle of Bapaume, a battle in the Franco-Prussian war occurs."
    },
    {
        "Date": "1885-1-3",
        "Details": "Sino-French War: Beginning of the Battle of Núi Bop"
    },
    {
        "Date": "1888-1-3",
        "Details": "The James Lick telescope at the Lick Observatory, measuring 91 cm in diameter, is used for the first time. It was the largest refracting telescope in the world at the time."
    },
    {
        "Date": "1911-1-3",
        "Details": "A magnitude 7.7 earthquake destroys the city of Almaty in Russian Turkestan."
    },
    {
        "Date": "1911-1-3",
        "Details": "A gun battle in the East End of London left two dead and sparked a political row over the involvement of then-Home Secretary Winston Churchill."
    },
    {
        "Date": "1913-1-3",
        "Details": "An Atlantic coast storm sets the lowest confirmed barometric pressure reading for a non-tropical system in the continental United States."
    },
    {
        "Date": "1919-1-3",
        "Details": "At the Paris Peace Conference, Emir Faisal I of Iraq signs an agreement with Zionist leader Chaim Weizmann on the development of a Jewish homeland in Palestine."
    },
    {
        "Date": "1925-1-3",
        "Details": "Benito Mussolini announces he is taking dictatorial powers over Italy."
    },
    {
        "Date": "1932-1-3",
        "Details": "Martial law is declared in Honduras to stop a revolt by banana workers fired by the United Fruit Company."
    },
    {
        "Date": "1933-1-3",
        "Details": "Minnie D. Craig becomes the first woman elected as Speaker of the North Dakota House of Representatives, the first woman to hold a Speaker position anywhere in the United States."
    },
    {
        "Date": "1938-1-3",
        "Details": "The March of Dimes is established by President Franklin D. Roosevelt."
    },
    {
        "Date": "1944-1-3",
        "Details": "World War II: Top Ace Major Greg \"Pappy\" Boyington is shot down in his Vought F4U Corsair by Captain Masajiro Kawato flying a Mitsubishi A6M Zero."
    },
    {
        "Date": "1945-1-3",
        "Details": "World War II: Admiral Chester W. Nimitz is placed in command of all U.S. Naval forces in preparation for planned assaults against Iwo Jima and Okinawa in Japan."
    },
    {
        "Date": "1946-1-3",
        "Details": "Popular Canadian American jockey George Woolf dies in a freak accident during a race; the annual George Woolf Memorial Jockey Award is created to honor him."
    },
    {
        "Date": "1947-1-3",
        "Details": "Proceedings of the U.S. Congress are televised for the first time."
    },
    {
        "Date": "1949-1-3",
        "Details": "The Bangko Sentral ng Pilipinas, the central bank of the Philippines, is established."
    },
    {
        "Date": "1953-1-3",
        "Details": "Frances P. Bolton and her son, Oliver from Ohio, become the first mother and son to serve simultaneously in the U.S. Congress."
    },
    {
        "Date": "1956-1-3",
        "Details": "A fire damages the top part of the Eiffel Tower."
    },
    {
        "Date": "1957-1-3",
        "Details": "The Hamilton Watch Company introduces the first electric watch."
    },
    {
        "Date": "1958-1-3",
        "Details": "The West Indies Federation is formed."
    },
    {
        "Date": "1959-1-3",
        "Details": "Alaska is admitted as the 49th U.S. state."
    },
    {
        "Date": "1961-1-3",
        "Details": "The United States severs diplomatic relations with Cuba over the latter's nationalization of American assets."
    },
    {
        "Date": "1961-1-3",
        "Details": "The SL-1 nuclear reactor is destroyed by a steam explosion in the only reactor incident in the United States to cause immediate fatalities."
    },
    {
        "Date": "1961-1-3",
        "Details": "A protest by agricultural workers in Baixa de Cassanje, Portuguese Angola, turns into a revolt, opening the Angolan War of Independence, the first of the Portuguese Colonial Wars."
    },
    {
        "Date": "1962-1-3",
        "Details": "Pope John XXIII excommunicates Fidel Castro."
    },
    {
        "Date": "1976-1-3",
        "Details": "International Covenant on Economic, Social and Cultural Rights entered into force."
    },
    {
        "Date": "1977-1-3",
        "Details": "Apple Computer is incorporated."
    },
    {
        "Date": "1990-1-3",
        "Details": "Manuel Noriega, former leader of Panama, surrenders to American forces."
    },
    {
        "Date": "1993-1-3",
        "Details": "In Moscow, Russia, George Bush and Boris Yeltsin sign the second Strategic Arms Reduction Treaty (START)."
    },
    {
        "Date": "1994-1-3",
        "Details": "More than seven million people from the former apartheid Homelands receive South African citizenship."
    },
    {
        "Date": "1999-1-3",
        "Details": "The Mars Polar Lander is launched."
    },
    {
        "Date": "2000-1-3",
        "Details": "Final daily Peanuts comic strip."
    },
    {
        "Date": "2002-1-3",
        "Details": "Israeli forces seize the Palestinian freighter Karine A in the Red Sea, finding 50 tons of weapons."
    },
    {
        "Date": "2004-1-3",
        "Details": "Flash Airlines Flight 604 crashes into the Red Sea, resulting in 148 deaths, making it one of the deadliest aviation accidents in Egyptian history."
    },
    {
        "Date": "2009-1-3",
        "Details": "The first block of the blockchain of the decentralized payment system Bitcoin, called the Genesis block, was established by the creator of the system, Satoshi Nakamoto."
    },
    {
        "Date": "2015-1-3",
        "Details": "Boko Haram militants raze the entire town of Baga in north-east Nigeria, starting the 2015 Baga massacre and killing as many as 2,000 people."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Julius Caesar fights Titus Labienus in the Battle of Ruspina."
    },
    {
        "Date": "871-1-4",
        "Details": "Battle of Reading: Æthelred of Wessex fights, and is defeated by, a Danish invasion army."
    },
    {
        "Date": "1490-1-4",
        "Details": "Anne of Brittany announces that all those who would ally with the King of France will be considered guilty of the crime of lèse-majesté."
    },
    {
        "Date": "1642-1-4",
        "Details": "King Charles I of England attempts to arrest Five Members of Parliament, commencing England's slide into civil war."
    },
    {
        "Date": "1649-1-4",
        "Details": "English Civil War: The Rump Parliament votes to put Charles I on trial."
    },
    {
        "Date": "1717-1-4",
        "Details": "The Netherlands, Great Britain, and France sign the Triple Alliance."
    },
    {
        "Date": "1762-1-4",
        "Details": "Great Britain enters the Seven Years' War against Spain and Naples."
    },
    {
        "Date": "1798-1-4",
        "Details": "Constantine Hangerli arrives in Bucharest, Wallachia, as its new Prince, invested by the Ottoman Empire."
    },
    {
        "Date": "1847-1-4",
        "Details": "Samuel Colt sells his first revolver pistol to the United States government."
    },
    {
        "Date": "1853-1-4",
        "Details": "After having been kidnapped and sold into slavery in the American South, Solomon Northup regains his freedom; his memoir Twelve Years a Slave later becomes a national bestseller."
    },
    {
        "Date": "1854-1-4",
        "Details": "The McDonald Islands are discovered by Captain William McDonald aboard the Samarang."
    },
    {
        "Date": "1863-1-4",
        "Details": "The New Apostolic Church is established in Hamburg, Germany."
    },
    {
        "Date": "1865-1-4",
        "Details": "The New York Stock Exchange opens its first permanent headquarters near Wall Street in New York City."
    },
    {
        "Date": "1878-1-4",
        "Details": "Russo-Turkish War (1877-78): Sofia is liberated from Ottoman rule and becomes capital of Liberated Bulgaria in 1879."
    },
    {
        "Date": "1884-1-4",
        "Details": "The Fabian Society is founded in London, England, United Kingdom."
    },
    {
        "Date": "1896-1-4",
        "Details": "Utah is admitted as the 45th U.S. state."
    },
    {
        "Date": "1903-1-4",
        "Details": "Topsy, an elephant, is electrocuted by the owners of Luna Park, Coney Island. The Edison film company shoots the film Electrocuting an Elephant of Topsy's death."
    },
    {
        "Date": "1912-1-4",
        "Details": "The Scout Association is incorporated throughout the British Empire by royal charter."
    },
    {
        "Date": "1918-1-4",
        "Details": "The Finnish Declaration of Independence is recognized by Russia, Sweden, Germany and France."
    },
    {
        "Date": "1944-1-4",
        "Details": "World War II: Operation Carpetbagger, involving the dropping of arms and supplies to resistance fighters in Europe, begins."
    },
    {
        "Date": "1948-1-4",
        "Details": "Burma gains its independence from the United Kingdom."
    },
    {
        "Date": "1951-1-4",
        "Details": "Korean War: Chinese and North Korean forces capture Seoul."
    },
    {
        "Date": "1955-1-4",
        "Details": "The Greek National Radical Union is formed by Konstantinos Karamanlis."
    },
    {
        "Date": "1958-1-4",
        "Details": "Sputnik 1 falls to Earth from orbit."
    },
    {
        "Date": "1959-1-4",
        "Details": "Luna 1 becomes the first spacecraft to reach the vicinity of the Moon."
    },
    {
        "Date": "1959-1-4",
        "Details": "Gypsy opened and closed on Broadway after 120 performances and four previews"
    },
    {
        "Date": "1966-1-4",
        "Details": "A military coup takes place in Upper Volta (later Burkina Faso), dissolving the National Parliament and leading to a new national constitution."
    },
    {
        "Date": "1972-1-4",
        "Details": "Rose Heilbron becomes the first female judge to sit at the Old Bailey in London, England."
    },
    {
        "Date": "1974-1-4",
        "Details": "United States President Richard Nixon refuses to hand over materials subpoenaed by the Senate Watergate Committee."
    },
    {
        "Date": "1976-1-4",
        "Details": "The Troubles: The Ulster Volunteer Force shoots dead six Irish Catholic civilians in County Armagh, Northern Ireland. The next day, gunmen shoot dead ten Protestant civilians nearby in retaliation."
    },
    {
        "Date": "1987-1-4",
        "Details": "The Maryland train collision: An Amtrak train en route to Boston from Washington, D.C., collides with Conrail engines in Chase, Maryland, killing 16 people."
    },
    {
        "Date": "1989-1-4",
        "Details": "Second Gulf of Sidra incident: A pair of Libyan MiG-23 \"Floggers\" are shot down by a pair of US Navy F-14 Tomcats during an air-to-air confrontation."
    },
    {
        "Date": "1990-1-4",
        "Details": "In Pakistan's deadliest train accident an overloaded passenger train collides with an empty freight train, resulting in 307 deaths and 700 injuries."
    },
    {
        "Date": "1998-1-4",
        "Details": "Wilaya of Relizane massacres in Algeria: Over 170 are killed in three remote villages."
    },
    {
        "Date": "1998-1-4",
        "Details": "A massive ice storm hits eastern Canada and the northeastern United States, continuing through January 10 and causing widespread destruction."
    },
    {
        "Date": "1999-1-4",
        "Details": "Former professional wrestler Jesse Ventura is sworn in as governor of Minnesota."
    },
    {
        "Date": "2004-1-4",
        "Details": "Spirit, a NASA Mars rover, lands successfully on Mars at 04:35 UTC."
    },
    {
        "Date": "2004-1-4",
        "Details": "Mikheil Saakashvili is elected President of Georgia following the November 2003 Rose Revolution."
    },
    {
        "Date": "2006-1-4",
        "Details": "Prime Minister Ariel Sharon of Israel suffers a second, apparently more serious stroke. His authority is transferred to acting Prime Minister Ehud Olmert."
    },
    {
        "Date": "2007-1-4",
        "Details": "The 110th United States Congress convenes, electing Nancy Pelosi as the first female Speaker of the House in U.S. history."
    },
    {
        "Date": "Invalid Date",
        "Details": null
    },
    {
        "Date": "2013-1-4",
        "Details": "A gunman kills eight people in a house-to-house rampage in Kawit, Cavite, Philippines."
    }
],
[
    {
        "Date": "1066-1-5",
        "Details": "Edward the Confessor dies childless, sparking a succession crisis that will eventually lead to the Norman conquest of England."
    },
    {
        "Date": "1477-1-5",
        "Details": "Battle of Nancy: Charles the Bold is killed and Burgundy becomes part of France."
    },
    {
        "Date": "1500-1-5",
        "Details": "Duke Ludovico Sforza conquers Milan."
    },
    {
        "Date": "1527-1-5",
        "Details": "Felix Manz, a leader of the Anabaptist congregation in Zürich, Switzerland, is executed by drowning."
    },
    {
        "Date": "1554-1-5",
        "Details": "A great fire occurs in Eindhoven, Netherlands."
    },
    {
        "Date": "1675-1-5",
        "Details": "Battle of Colmar: The French army beats Brandenburg."
    },
    {
        "Date": "1757-1-5",
        "Details": "Louis XV of France survives an assassination attempt by Robert-François Damiens, the last person to be executed in France by drawing and quartering, the traditional and gruesome form of capital punishment used for regicides."
    },
    {
        "Date": "1781-1-5",
        "Details": "American Revolutionary War: Richmond, Virginia, is burned by British naval forces led by Benedict Arnold."
    },
    {
        "Date": "1846-1-5",
        "Details": "The United States House of Representatives votes to stop sharing the Oregon Territory with the United Kingdom."
    },
    {
        "Date": "1875-1-5",
        "Details": "The Palais Garnier, one of the most famous opera houses in the world, is inaugurated in Paris."
    },
    {
        "Date": "1882-1-5",
        "Details": "Charles J. Guiteau is found guilty of assassinating US President James A. Garfield, and is sentenced to death by hanging."
    },
    {
        "Date": "1895-1-5",
        "Details": "Dreyfus affair: French army officer Alfred Dreyfus is stripped of his rank and sentenced to life imprisonment on Devil's Island."
    },
    {
        "Date": "1911-1-5",
        "Details": "Kappa Alpha Psi, the world's third oldest and largest black fraternity, is founded at Indiana University."
    },
    {
        "Date": "1912-1-5",
        "Details": "The Prague Party Conference takes place."
    },
    {
        "Date": "1913-1-5",
        "Details": "First Balkan War: During the Battle of Lemnos, Greek admiral Pavlos Kountouriotis forces the Turkish fleet to retreat to its base within the Dardanelles, from which it did not venture for the rest of the war."
    },
    {
        "Date": "1914-1-5",
        "Details": "The Ford Motor Company announces an eight-hour workday, but entitlement to the higher was subject to various restrictions.[1]"
    },
    {
        "Date": "1919-1-5",
        "Details": "The German Workers' Party, which would become the Nazi Party, is founded."
    },
    {
        "Date": "1925-1-5",
        "Details": "Nellie Tayloe Ross of Wyoming becomes the first female governor in the United States."
    },
    {
        "Date": "1933-1-5",
        "Details": "Construction of the Golden Gate Bridge begins in San Francisco Bay."
    },
    {
        "Date": "1944-1-5",
        "Details": "The Daily Mail becomes the first transoceanic newspaper."
    },
    {
        "Date": "1945-1-5",
        "Details": "The Soviet Union recognizes the new pro-Soviet government of Poland."
    },
    {
        "Date": "1949-1-5",
        "Details": "United States President Harry S. Truman unveils his Fair Deal program."
    },
    {
        "Date": "1950-1-5",
        "Details": "In the Sverdlovsk air disaster, all 19 of those on board were killed, including almost the entire national ice hockey team (VVS Moscow) of the Soviet Air Force - 11 players, as well as a team doctor and a masseur."
    },
    {
        "Date": "1953-1-5",
        "Details": "The play Waiting for Godot by Samuel Beckett is first performed."
    },
    {
        "Date": "1957-1-5",
        "Details": "In a speech given to the United States Congress, United States President Dwight D. Eisenhower announces the establishment of what will later be called the Eisenhower Doctrine."
    },
    {
        "Date": "1968-1-5",
        "Details": "Alexander Dubček comes to power; \"Prague Spring\" begins in Czechoslovakia."
    },
    {
        "Date": "1970-1-5",
        "Details": "The 7.1 Mw Tonghai earthquake shakes Tonghai County, Yunnan province, China, with a maximum Mercalli intensity of X (Extreme). Between 10,000-15,621 were killed and 26,783 were injured."
    },
    {
        "Date": "1972-1-5",
        "Details": "United States President Richard Nixon orders the development of a Space Shuttle program."
    },
    {
        "Date": "1974-1-5",
        "Details": "Warmest reliably measured temperature below the Antarctic Circle of +59 °F (+15 °C) recorded at Vanda Station"
    },
    {
        "Date": "1975-1-5",
        "Details": "The Tasman Bridge in Tasmania, Australia, is struck by the bulk ore carrier Lake Illawarra, killing twelve people."
    },
    {
        "Date": "1976-1-5",
        "Details": "The Khmer Rouge proclaim the Constitution of Democratic Kampuchea."
    },
    {
        "Date": "1976-1-5",
        "Details": "The Troubles: Gunmen shoot dead ten Protestant civilians after stopping their minibus at Kingsmill in County Armagh, Northern Ireland, UK."
    },
    {
        "Date": "1991-1-5",
        "Details": "Georgian forces enter Tskhinvali, the capital of South Ossetia, Georgia, opening the 1991-92 South Ossetia War."
    },
    {
        "Date": "1991-1-5",
        "Details": "The United States Embassy to Somalia in Mogadishu is evacuated by helicopter airlift days after violence enveloped Mogadishu during the Somali Civil War"
    },
    {
        "Date": "1993-1-5",
        "Details": "The oil tanker MV Braer runs aground on the coast of the Shetland Islands, spilling 84,700 tons of crude oil."
    },
    {
        "Date": "2000-1-5",
        "Details": "Sri Lankan Civil War: Sri Lankan Tamil politician Kumar Ponnambalam is shot dead in Colombo."
    },
    {
        "Date": "2005-1-5",
        "Details": "Eris, the most massive and second-largest known dwarf planet in the Solar System, is discovered by the team of Michael E. Brown, Chad Trujillo, and David L. Rabinowitz using images originally taken on October 21, 2003, at the Palomar Observatory."
    },
    {
        "Date": "2014-1-5",
        "Details": "A launch of the communication satellite GSAT-14 aboard the GSLV MK.II D5 marks the first successful flight of an Indian cryogenic engine."
    }
],
[
    {
        "Date": "1017-1-6",
        "Details": "Cnut the Great is crowned King of England."
    },
    {
        "Date": "1066-1-6",
        "Details": "Harold Godwinson (or Harold II) is crowned King of England."
    },
    {
        "Date": "1205-1-6",
        "Details": "Philip of Swabia becomes King of the Romans."
    },
    {
        "Date": "1322-1-6",
        "Details": "Stephen Uroš III is crowned King of Serbia."
    },
    {
        "Date": "1355-1-6",
        "Details": "Charles I of Bohemia is crowned with the Iron Crown of Lombardy as King of Italy in Milan."
    },
    {
        "Date": "1449-1-6",
        "Details": "Constantine XI is crowned Byzantine Emperor at Mystras."
    },
    {
        "Date": "1492-1-6",
        "Details": "The Catholic Monarchs Ferdinand and Isabella enter Granada, completing the Reconquista."
    },
    {
        "Date": "1540-1-6",
        "Details": "King Henry VIII of England marries Anne of Cleves."
    },
    {
        "Date": "1579-1-6",
        "Details": "The Union of Arras is signed."
    },
    {
        "Date": "1661-1-6",
        "Details": "English Restoration: The Fifth Monarchists unsuccessfully attempt to seize control of London, England."
    },
    {
        "Date": "1690-1-6",
        "Details": "Joseph, son of Emperor Leopold I, becomes King of the Romans."
    },
    {
        "Date": "1721-1-6",
        "Details": "The Committee of Inquiry on the South Sea Bubble publishes its findings."
    },
    {
        "Date": "1781-1-6",
        "Details": "In the Battle of Jersey, the British defeat the last attempt by France to invade Jersey."
    },
    {
        "Date": "1809-1-6",
        "Details": "Combined British, Portuguese and colonial Brazilian forces begin the Invasion of Cayenne during the Napoleonic Wars."
    },
    {
        "Date": "1838-1-6",
        "Details": "Alfred Vail demonstrates a telegraph system using dots and dashes (this is the forerunner of Morse code)."
    },
    {
        "Date": "1839-1-6",
        "Details": "The most damaging storm in 300 years sweeps across Ireland, damaging or destroying more than 20% of the houses in Dublin."
    },
    {
        "Date": "1870-1-6",
        "Details": "The inauguration of the Musikverein in Vienna, Austria."
    },
    {
        "Date": "1893-1-6",
        "Details": "The Washington National Cathedral is chartered by Congress. The charter is signed by President Benjamin Harrison."
    },
    {
        "Date": "1900-1-6",
        "Details": "Second Boer War: Having already besieged the fortress at Ladysmith, Boer forces attack it, but are driven back by British defenders."
    },
    {
        "Date": "1907-1-6",
        "Details": "Maria Montessori opens her first school and daycare center for working class children in Rome, Italy."
    },
    {
        "Date": "1912-1-6",
        "Details": "New Mexico is admitted to the Union as the 47th U.S. state."
    },
    {
        "Date": "1912-1-6",
        "Details": "German geophysicist Alfred Wegener first presents his theory of continental drift."
    },
    {
        "Date": "1929-1-6",
        "Details": "King Alexander of the Serbs, Croats and Slovenes suspends his country's constitution (the January 6th Dictatorship)."
    },
    {
        "Date": "1929-1-6",
        "Details": "Mother Teresa arrives in Calcutta, India, to begin her work among India's poorest and sick people."
    },
    {
        "Date": "1930-1-6",
        "Details": "The first diesel-engined automobile trip is completed, from Indianapolis, Indiana, to New York, New York."
    },
    {
        "Date": "1931-1-6",
        "Details": "Thomas Edison signs his last patent application."
    },
    {
        "Date": "1941-1-6",
        "Details": "United States President Franklin D. Roosevelt delivers his Four Freedoms speech in the State of the Union address."
    },
    {
        "Date": "1946-1-6",
        "Details": "The first general election ever in Vietnam is held."
    },
    {
        "Date": "1947-1-6",
        "Details": "Pan American Airlines becomes the first commercial airline to offer a round-the-world ticket."
    },
    {
        "Date": "1950-1-6",
        "Details": "The United Kingdom recognizes the People's Republic of China. The Republic of China severs diplomatic relations with the UK in response."
    },
    {
        "Date": "1951-1-6",
        "Details": "Korean War: An estimated 200-1,300 South Korean communist sympathizers are slaughtered in what becomes the Ganghwa massacre."
    },
    {
        "Date": "1960-1-6",
        "Details": "National Airlines Flight 2511 is destroyed in mid-air by a bomb, while en route from New York City to Miami."
    },
    {
        "Date": "1960-1-6",
        "Details": "The Associations Law comes into force in Iraq, allowing registration of political parties."
    },
    {
        "Date": "1967-1-6",
        "Details": "Vietnam War: United States Marine Corps and ARVN troops launch \"Operation Deckhouse Five\" in the Mekong River delta."
    },
    {
        "Date": "1974-1-6",
        "Details": "In response to the 1973 oil crisis, daylight saving time commences nearly four months early in the United States."
    },
    {
        "Date": "1978-1-6",
        "Details": "The Crown of St. Stephen (also known as the Holy Crown of Hungary) is returned to Hungary from the United States, where it was held after World War II."
    },
    {
        "Date": "1989-1-6",
        "Details": "Satwant Singh and Kehar Singh are sentenced to death for conspiracy in the assassination of Prime Minister Indira Gandhi; the two men are executed the same day."
    },
    {
        "Date": "1992-1-6",
        "Details": "President of Georgia Zviad Gamsakhurdia flees the country as a result of the military coup."
    },
    {
        "Date": "1993-1-6",
        "Details": "Indian Border Security Force units kill 55 Kashmiri civilians in Sopore, Jammu and Kashmir, in revenge after militants ambushed a BSF patrol."
    },
    {
        "Date": "1995-1-6",
        "Details": "A chemical fire in an apartment complex in Manila, Philippines, leads to the discovery of plans for Project Bojinka, a mass-terrorist attack."
    },
    {
        "Date": "2001-1-6",
        "Details": "Congress certifies George W. Bush winner of 2000 elections."
    },
    {
        "Date": "2005-1-6",
        "Details": "American Civil Rights Movement: Edgar Ray Killen is arrested as a suspect in the 1964 murders of Chaney, Goodman, and Schwerner."
    },
    {
        "Date": "2005-1-6",
        "Details": "A train collision in Graniteville, South Carolina, releases about 60 tons of chlorine gas."
    },
    {
        "Date": "2012-1-6",
        "Details": "Twenty-six people are killed and 63 wounded when a suicide bomber blows himself up at a police station in Damascus."
    },
    {
        "Date": "2017-1-6",
        "Details": "5 people are killed and 6 others injured in a mass shooting at Fort Lauderdale-Hollywood International Airport in Broward County, Florida."
    }
],
[
    {
        "Date": "1131-1-7",
        "Details": "Canute Lavard was murdered at Haraldsted, Denmark by his cousin, Magnus I of Sweden."
    },
    {
        "Date": "1325-1-7",
        "Details": "Alfonso IV becomes King of Portugal."
    },
    {
        "Date": "1558-1-7",
        "Details": "France takes Calais, the last continental possession of England."
    },
    {
        "Date": "1566-1-7",
        "Details": "Pope Pius V is elected."
    },
    {
        "Date": "1608-1-7",
        "Details": "Fire destroys Jamestown, Virginia."
    },
    {
        "Date": "1610-1-7",
        "Details": "Galileo Galilei makes his first observation of the four Galilean moons: Ganymede, Callisto, Io and Europa, although he is not able to distinguish the last two until the following day."
    },
    {
        "Date": "1782-1-7",
        "Details": "The first American commercial bank, the Bank of North America, opens."
    },
    {
        "Date": "1785-1-7",
        "Details": "Frenchman Jean-Pierre Blanchard and American John Jeffries travel from Dover, England, to Calais, France, in a gas balloon."
    },
    {
        "Date": "1835-1-7",
        "Details": "HMS Beagle drops anchor off the Chonos Archipelago."
    },
    {
        "Date": "1894-1-7",
        "Details": "William Kennedy Dickson receives a patent for motion picture film."
    },
    {
        "Date": "1904-1-7",
        "Details": "The distress signal \"CQD\" is established only to be replaced two years later by \"SOS\"."
    },
    {
        "Date": "1919-1-7",
        "Details": "Montenegrin guerrilla fighters rebel against the planned annexation of Montenegro by Serbia, but fail."
    },
    {
        "Date": "1920-1-7",
        "Details": "The New York State Assembly refuses to seat five duly elected Socialist assemblymen."
    },
    {
        "Date": "1922-1-7",
        "Details": "Dáil Éireann ratifies the Anglo-Irish Treaty by a 64-57 vote."
    },
    {
        "Date": "1927-1-7",
        "Details": "The first transatlantic telephone service is established from New York City to London."
    },
    {
        "Date": "1931-1-7",
        "Details": "Guy Menzies flies the first solo non-stop trans-Tasman flight (from Australia to New Zealand) in 11 hours and 45 minutes, crash-landing on New Zealand's west coast."
    },
    {
        "Date": "1935-1-7",
        "Details": "Benito Mussolini and French Foreign minister Pierre Laval sign the Franco-Italian Agreement."
    },
    {
        "Date": "1940-1-7",
        "Details": "Winter War: The Finnish 9th Division stop and completely destroy the numerically superior Soviet forces on the Raate-Suomussalmi road."
    },
    {
        "Date": "1942-1-7",
        "Details": "World War II: The siege of the Bataan Peninsula begins."
    },
    {
        "Date": "1945-1-7",
        "Details": "World War II: British General Bernard Montgomery holds a press conference in which he claims credit for victory in the Battle of the Bulge."
    },
    {
        "Date": "1948-1-7",
        "Details": "Kentucky Air National Guard pilot Thomas Mantell crashes while in pursuit of a supposed UFO."
    },
    {
        "Date": "1954-1-7",
        "Details": "Georgetown-IBM experiment: The first public demonstration of a machine translation system, is held in New York at the head office of IBM."
    },
    {
        "Date": "1955-1-7",
        "Details": "Contralto Marian Anderson becomes the first person of color to perform at the Metropolitan Opera in Giuseppe Verdi's Un ballo in maschera."
    },
    {
        "Date": "1959-1-7",
        "Details": "The United States recognizes the new Cuban government of Fidel Castro."
    },
    {
        "Date": "1968-1-7",
        "Details": "Surveyor Program: Surveyor 7, the last spacecraft in the Surveyor series, lifts off from launch complex 36A, Cape Canaveral."
    },
    {
        "Date": "1973-1-7",
        "Details": "Mark Essex fatally shoots ten people and wounds 13 others at Howard Johnson's Hotel in New Orleans, Louisiana, before being shot to death by police officers."
    },
    {
        "Date": "1979-1-7",
        "Details": "Third Indochina War: Cambodian-Vietnamese War: Phnom Penh falls to the advancing Vietnamese troops, driving out Pol Pot and the Khmer Rouge."
    },
    {
        "Date": "1980-1-7",
        "Details": "U.S. President Jimmy Carter authorizes legislation giving $1.5 billion in loans to bail out the Chrysler Corporation."
    },
    {
        "Date": "1984-1-7",
        "Details": "Brunei becomes the sixth member of the Association of Southeast Asian Nations (ASEAN)."
    },
    {
        "Date": "1985-1-7",
        "Details": "Japan Aerospace Exploration Agency launches Sakigake, Japan's first interplanetary spacecraft and the first deep space probe to be launched by any country other than the United States or the Soviet Union."
    },
    {
        "Date": "1991-1-7",
        "Details": "Roger Lafontant, former leader of the Tonton Macoute in Haiti under François Duvalier, attempts a coup d'état, which ends in his arrest."
    },
    {
        "Date": "1992-1-7",
        "Details": "The Jeep Grand Cherokee is introduced at the Detroit Auto Show."
    },
    {
        "Date": "1993-1-7",
        "Details": "The Fourth Republic of Ghana is inaugurated with Jerry Rawlings as President."
    },
    {
        "Date": "1993-1-7",
        "Details": "Bosnian War: The Bosnian Army executes a surprise attack at the village of Kravica in Srebrenica."
    },
    {
        "Date": "1999-1-7",
        "Details": "The Senate trial in the impeachment of U.S. President Bill Clinton begins."
    },
    {
        "Date": "2012-1-7",
        "Details": "A hot air balloon crashes near Carterton, New Zealand, killing all 11 people on board."
    },
    {
        "Date": "2015-1-7",
        "Details": "Two gunmen commit mass murder at the offices of Charlie Hebdo in Paris, shooting twelve people execution style, and wounding eleven others."
    },
    {
        "Date": "2015-1-7",
        "Details": "A car bomb explodes outside a police college in the Yemeni capital Sana'a with at least 38 people reported dead and more than 63 injured."
    }
],
[
    {
        "Date": "307-1-8",
        "Details": "Jin Huidi, Chinese Emperor of the Jin dynasty, is poisoned and succeeded by Jin Huaidi."
    },
    {
        "Date": "387-1-8",
        "Details": "Siyaj K'ak' conquers Waka"
    },
    {
        "Date": "871-1-8",
        "Details": "Alfred the Great leads a West Saxon army to repel an invasion by Danelaw Vikings."
    },
    {
        "Date": "1297-1-8",
        "Details": "François Grimaldi, disguised as a monk, leads his men to capture the fortress protecting the Rock of Monaco, establishing his family as the rulers of Monaco."
    },
    {
        "Date": "1454-1-8",
        "Details": "The papal bull Romanus Pontifex awards the Kingdom of Portugal exclusive trade and colonization rights to all of Africa south of Cape Bojador."
    },
    {
        "Date": "1499-1-8",
        "Details": "Louis XII of France marries Anne of Brittany."
    },
    {
        "Date": "1547-1-8",
        "Details": "The first Lithuanian-language book, Simple Words of Catechism, is published in Königsberg."
    },
    {
        "Date": "1735-1-8",
        "Details": "Premiere performance of George Frideric Handel's Ariodante at the Royal Opera House, Covent Garden."
    },
    {
        "Date": "1746-1-8",
        "Details": "Second Jacobite rising: Bonnie Prince Charlie occupies Stirling."
    },
    {
        "Date": "1790-1-8",
        "Details": "George Washington delivers the first State of the Union address in New York City."
    },
    {
        "Date": "1806-1-8",
        "Details": "Cape Colony becomes a British colony."
    },
    {
        "Date": "1811-1-8",
        "Details": "An unsuccessful slave revolt is led by Charles Deslondes in St. Charles and St. James, Louisiana."
    },
    {
        "Date": "1815-1-8",
        "Details": "War of 1812: Battle of New Orleans: Andrew Jackson leads American forces in victory over the British."
    },
    {
        "Date": "1828-1-8",
        "Details": "The Democratic Party of the United States is organized."
    },
    {
        "Date": "1835-1-8",
        "Details": "The United States national debt is zero for the only time."
    },
    {
        "Date": "1863-1-8",
        "Details": "American Civil War: Second Battle of Springfield"
    },
    {
        "Date": "1867-1-8",
        "Details": "African American men are granted the right to vote in Washington, D.C."
    },
    {
        "Date": "1877-1-8",
        "Details": "Crazy Horse and his warriors fight their last battle against the United States Cavalry at Wolf Mountain, Montana Territory."
    },
    {
        "Date": "1889-1-8",
        "Details": "Herman Hollerith is issued US patent #395,791 for the 'Art of Applying Statistics' — his punched card calculator."
    },
    {
        "Date": "1904-1-8",
        "Details": "The Blackstone Library is dedicated, marking the beginning of the Chicago Public Library system."
    },
    {
        "Date": "1912-1-8",
        "Details": "The African National Congress is founded."
    },
    {
        "Date": "1918-1-8",
        "Details": "U.S. President Woodrow Wilson announces his \"Fourteen Points\" for the aftermath of World War I."
    },
    {
        "Date": "1920-1-8",
        "Details": "The steel strike of 1919 ends in a complete failure for the Amalgamated Association of Iron, Steel and Tin Workers labor union."
    },
    {
        "Date": "1926-1-8",
        "Details": "Crown Prince Nguyễn Phúc Vĩnh Thuỵ ascends the throne, the last monarch of Vietnam."
    },
    {
        "Date": "1936-1-8",
        "Details": "Kashf-e hijab decree is enforced by Reza Shah ordering the police to physically remove the Hijab from any woman in public."
    },
    {
        "Date": "1940-1-8",
        "Details": "World War II: Britain introduces food rationing."
    },
    {
        "Date": "1945-1-8",
        "Details": "World War II: Philippine Commonwealth troops under the Philippine Commonwealth Army units enter the province of Ilocos Sur in Northern Luzon and attack Japanese Imperial forces."
    },
    {
        "Date": "1956-1-8",
        "Details": "Operation Auca: Five U.S. missionaries are killed by the Huaorani of Ecuador shortly after making contact with them."
    },
    {
        "Date": "1961-1-8",
        "Details": "In France a referendum supports Charles de Gaulle's policies in Algeria."
    },
    {
        "Date": "1963-1-8",
        "Details": "Leonardo da Vinci's Mona Lisa is exhibited in the United States for the first time, at the National Gallery of Art in Washington, D.C."
    },
    {
        "Date": "1964-1-8",
        "Details": "President Lyndon B. Johnson declares a \"War on Poverty\" in the United States."
    },
    {
        "Date": "1971-1-8",
        "Details": "Bowing to international pressure, President of Pakistan Zulfikar Ali Bhutto releases Bengali leader Sheikh Mujibur Rahman from prison, who had been arrested after declaring the independence of Bangladesh."
    },
    {
        "Date": "1973-1-8",
        "Details": "Soviet space mission Luna 21 is launched."
    },
    {
        "Date": "1973-1-8",
        "Details": "Watergate scandal: The trial of seven men accused of illegal entry into Democratic Party headquarters at Watergate begins."
    },
    {
        "Date": "1975-1-8",
        "Details": "Ella T. Grasso becomes Governor of Connecticut, the first woman to serve as a Governor in the United States other than by succeeding her husband."
    },
    {
        "Date": "1977-1-8",
        "Details": "Three bombs explode in Moscow, Russia, Soviet Union, within 37 minutes, killing seven. The bombings are attributed to an Armenian separatist group."
    },
    {
        "Date": "1979-1-8",
        "Details": "Password Plus debuts on NBC."
    },
    {
        "Date": "1981-1-8",
        "Details": "A local farmer reports a UFO sighting in Trans-en-Provence, France, claimed to be \"perhaps the most completely and carefully documented sighting of all time\"."
    },
    {
        "Date": "1982-1-8",
        "Details": "Breakup of the Bell System: AT&T agrees to divest itself of twenty-two subdivisions."
    },
    {
        "Date": "1989-1-8",
        "Details": "Kegworth air disaster: British Midland Flight 92, a Boeing 737-400, crashes into the M1 motorway, killing 47 of the 126 people on board."
    },
    {
        "Date": "1992-1-8",
        "Details": "US President George H. W. Bush vomits on Japanese Prime Minister Kiichi Miyazawa"
    },
    {
        "Date": "1994-1-8",
        "Details": "Russian cosmonaut Valeri Polyakov on Soyuz TM-18 leaves for Mir. He would stay on the space station until March 22, 1995, for a record 437 days in space."
    },
    {
        "Date": "1996-1-8",
        "Details": "An Antonov An-32 cargo aircraft crashes into a crowded market in Kinshasa, Zaire, killing up to 223 on the ground; two of six crew members are also killed."
    },
    {
        "Date": "2002-1-8",
        "Details": "President George W. Bush signs into law the No Child Left Behind Act."
    },
    {
        "Date": "2003-1-8",
        "Details": "Turkish Airlines Flight 634 crashes near Diyarbakır Airport, Turkey, killing the entire crew and 70 of the 75 passengers."
    },
    {
        "Date": "2003-1-8",
        "Details": "Air Midwest Flight 5481 crashes at Charlotte-Douglas Airport, Charlotte, North Carolina, killing all 21 people on board."
    },
    {
        "Date": "2004-1-8",
        "Details": "The RMS Queen Mary 2, the largest ocean liner ever built, is christened by her namesake's granddaughter, Queen Elizabeth II."
    },
    {
        "Date": "2005-1-8",
        "Details": "The nuclear sub USS San Francisco collides at full speed with an undersea mountain south of Guam. One man is killed, but the sub surfaces and is repaired."
    },
    {
        "Date": "2009-1-8",
        "Details": "A 6.1-magnitude earthquake in northern Costa Rica kills 15 people and injures 32."
    },
    {
        "Date": "2010-1-8",
        "Details": "Gunmen from an offshoot the Front for the Liberation of the Enclave of Cabinda attack a bus carrying the Togo national football team on its way to the 2010 Africa Cup of Nations, killing three."
    },
    {
        "Date": "2011-1-8",
        "Details": "The attempted assassination of Arizona Representative Gabrielle Giffords and subsequent shooting in Casas Adobes, Arizona, in which five people were shot dead."
    }
],
[
    {
        "Date": "475-1-9",
        "Details": "Byzantine Emperor Zeno is forced to flee his capital at Constantinople, and his general, Basiliscus gains control of the empire."
    },
    {
        "Date": "681-1-9",
        "Details": "Twelfth Council of Toledo: King Erwig of the Visigoths initiates a council in which he implements diverse measures against the Jews in Spain."
    },
    {
        "Date": "1127-1-9",
        "Details": "Jin-Song Wars: Invading Jurchen soldiers from the Jin dynasty besiege and sack Bianjing (Kaifeng), the capital of the Song dynasty of China, and abduct Emperor Qinzong of Song and others, ending the Northern Song dynasty."
    },
    {
        "Date": "1150-1-9",
        "Details": "Wanyan Liang and other court officials murder Emperor Xizong of Jin. Wanyan Liang succeeds him as emperor."
    },
    {
        "Date": "1349-1-9",
        "Details": "The Jewish population of Basel, believed by the residents to be the cause of the ongoing Black Death, is rounded up and incinerated."
    },
    {
        "Date": "1431-1-9",
        "Details": "Judges' investigations for the trial of Joan of Arc begin in Rouen, France, the seat of the English occupation government."
    },
    {
        "Date": "1760-1-9",
        "Details": "Ahmad Shah Durrani defeats the Marathas in the Battle of Barari Ghat."
    },
    {
        "Date": "1788-1-9",
        "Details": "Connecticut becomes the fifth state to ratify the Constitution."
    },
    {
        "Date": "1792-1-9",
        "Details": "Treaty of Jassy between Russian and Ottoman Empire is signed."
    },
    {
        "Date": "1793-1-9",
        "Details": "Jean-Pierre Blanchard becomes the first person to fly in a balloon in the United States."
    },
    {
        "Date": "1799-1-9",
        "Details": "British Prime Minister William Pitt the Younger introduces an income tax of two shillings to the pound to raise funds for Great Britain's war effort in the Napoleonic Wars."
    },
    {
        "Date": "1806-1-9",
        "Details": "Admiral Horatio Lord Nelson receives a state funeral and is interred in St Paul's Cathedral."
    },
    {
        "Date": "1816-1-9",
        "Details": "Sir Humphry Davy tests his safety lamp for miners at Hebburn Colliery."
    },
    {
        "Date": "1822-1-9",
        "Details": "The Portuguese prince Pedro I of Brazil decides to stay in Brazil against the orders of the Portuguese King João VI, beginning the Brazilian independence process."
    },
    {
        "Date": "1839-1-9",
        "Details": "The French Academy of Sciences announces the Daguerreotype photography process."
    },
    {
        "Date": "1857-1-9",
        "Details": "The 7.9 Mw Fort Tejon earthquake shakes Central and Southern California with a maximum Mercalli intensity of IX (Violent)."
    },
    {
        "Date": "1858-1-9",
        "Details": "Anson Jones, the last President of the Republic of Texas, commits suicide."
    },
    {
        "Date": "1861-1-9",
        "Details": "American Civil War: \"Star of the West\" incident occurs near Charleston, South Carolina."
    },
    {
        "Date": "1861-1-9",
        "Details": "Mississippi becomes the second state to secede from the Union before the outbreak of the American Civil War."
    },
    {
        "Date": "1878-1-9",
        "Details": "Umberto I becomes King of Italy."
    },
    {
        "Date": "1894-1-9",
        "Details": "New England Telephone and Telegraph installs the first battery-operated telephone switchboard in Lexington, Massachusetts."
    },
    {
        "Date": "1903-1-9",
        "Details": "Hallam Tennyson, 2nd Baron Tennyson, son of the poet Alfred Tennyson, becomes the second Governor-General of Australia."
    },
    {
        "Date": "1909-1-9",
        "Details": "Ernest Shackleton, leading the Nimrod Expedition to the South Pole, plants the British flag 97 nautical miles (180 km; 112 mi) from the South Pole, the farthest anyone had ever reached at that time."
    },
    {
        "Date": "1914-1-9",
        "Details": "Phi Beta Sigma Fraternity Inc., the first historically black intercollegiate Greek-letter fraternity to be officially recognized at Howard University, is founded."
    },
    {
        "Date": "1916-1-9",
        "Details": "World War I: The Battle of Gallipoli concludes with an Ottoman Empire victory when the last Allied forces are evacuated from the peninsula."
    },
    {
        "Date": "1917-1-9",
        "Details": "World War I: The Battle of Rafa is fought near the Egyptian border with Palestine."
    },
    {
        "Date": "1918-1-9",
        "Details": "Battle of Bear Valley: The last battle of the American Indian Wars."
    },
    {
        "Date": "1921-1-9",
        "Details": "Greco-Turkish War: The First Battle of İnönü, the first battle of the war, begins near Eskişehir in Anatolia."
    },
    {
        "Date": "1923-1-9",
        "Details": "Juan de la Cierva makes the first autogyro flight."
    },
    {
        "Date": "1923-1-9",
        "Details": "Lithuanian residents of the Memel Territory rebel against the League of Nations' decision to leave the area as a mandated region under French control."
    },
    {
        "Date": "1927-1-9",
        "Details": "A fire at the Laurier Palace movie theatre in Montreal, Quebec, Canada, kills 78 children."
    },
    {
        "Date": "1941-1-9",
        "Details": "World War II: First flight of the Avro Lancaster."
    },
    {
        "Date": "1945-1-9",
        "Details": "World War II: The Sixth United States Army begins the invasion of Lingayen Gulf."
    },
    {
        "Date": "1957-1-9",
        "Details": "British Prime Minister Sir Anthony Eden resigns from office following his failure to retake the Suez Canal from Egyptian sovereignty."
    },
    {
        "Date": "1960-1-9",
        "Details": "President of Egypt Gamal Abdel Nasser opens construction on the Aswan Dam by detonating ten tons of dynamite to demolish twenty tons of granite on the east bank of the Nile."
    },
    {
        "Date": "1964-1-9",
        "Details": "Martyrs' Day: Several Panamanian youths try to raise the Panamanian flag in the U.S.-controlled Panama Canal Zone, leading to fighting between U.S. military and Panamanian civilians."
    },
    {
        "Date": "1965-1-9",
        "Details": "The Mirzapur Cadet College formally opens for academic activities in East Pakistan (now Bangladesh)."
    },
    {
        "Date": "1991-1-9",
        "Details": "Representatives from the United States and Iraq meet at the Geneva Peace Conference to try to find a peaceful resolution to the Iraqi invasion of Kuwait."
    },
    {
        "Date": "1992-1-9",
        "Details": "The Assembly of the Serb People in Bosnia and Herzegovina proclaims the creation of Republika Srpska, a new state within Yugoslavia."
    },
    {
        "Date": "1996-1-9",
        "Details": "First Chechen War: Chechen separatists launch a raid against the helicopter airfield and later a civilian hospital in the city of Kizlyar in the neighboring Dagestan, which turns into a massive hostage crisis involving thousands of civilians."
    },
    {
        "Date": "2004-1-9",
        "Details": "An inflatable boat carrying illegal Albanian emigrants stalls near the Karaburun Peninsula en route to Brindisi, Italy; exposure to the elements kills 28."
    },
    {
        "Date": "2005-1-9",
        "Details": "Mahmoud Abbas wins the election to succeed Yasser Arafat as President of the Palestinian National Authority, replacing interim president Rawhi Fattouh."
    },
    {
        "Date": "2005-1-9",
        "Details": "The Sudan People's Liberation Movement and the Government of Sudan sign the Comprehensive Peace Agreement to end the Second Sudanese Civil War."
    },
    {
        "Date": "2007-1-9",
        "Details": "Apple CEO Steve Jobs introduces the original iPhone at a Macworld keynote in San Francisco."
    },
    {
        "Date": "2011-1-9",
        "Details": "Iran Air Flight 277 crashes near Orumiyeh in the northeast of the country, killing 77 people."
    },
    {
        "Date": "2014-1-9",
        "Details": "An explosion at a Mitsubishi Materials chemical plant in Yokkaichi, Japan, kills at least five people and injures 17 others."
    },
    {
        "Date": "2015-1-9",
        "Details": "The perpetrators of the Charlie Hebdo shooting in Paris two days earlier are both killed after a hostage situation; a a second hostage situation, related to the Charlie Hebdo shooting, occurs at a Jewish market in Vincennes."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Julius Caesar crosses the Rubicon, signalling the start of civil war."
    },
    {
        "Date": "Invalid Date",
        "Details": "The Western Han dynasty ends when Wang Mang claims that the divine Mandate of Heaven called for the end of the dynasty and the beginning of his own, the Xin dynasty."
    },
    {
        "Date": "Invalid Date",
        "Details": "Lucius Calpurnius Piso Licinianus is appointed by Galba as deputy Roman Emperor."
    },
    {
        "Date": "236-1-10",
        "Details": "Pope Fabian succeeds Anterus to become the twentieth pope of Rome."
    },
    {
        "Date": "1072-1-10",
        "Details": "Robert Guiscard conquers Palermo."
    },
    {
        "Date": "1475-1-10",
        "Details": "Stephen III of Moldavia defeats the Ottoman Empire at the Battle of Vaslui."
    },
    {
        "Date": "1645-1-10",
        "Details": "Archbishop William Laud is beheaded at the Tower of London."
    },
    {
        "Date": "1776-1-10",
        "Details": "Thomas Paine publishes his pamphlet Common Sense."
    },
    {
        "Date": "1791-1-10",
        "Details": "The Siege of Dunlap's Station begins near Cincinnati during the Northwest Indian War."
    },
    {
        "Date": "1806-1-10",
        "Details": "Dutch settlers in Cape Town surrender to the British."
    },
    {
        "Date": "1812-1-10",
        "Details": "The first steamboat on the Ohio River or the Mississippi River arrives in New Orleans, 82 days after departing from Pittsburgh."
    },
    {
        "Date": "1861-1-10",
        "Details": "American Civil War: Florida secedes from the Union."
    },
    {
        "Date": "1863-1-10",
        "Details": "The Metropolitan Railway, the world's oldest underground railway, opens between Paddington and Farringdon, marking the beginning of the London Underground."
    },
    {
        "Date": "1870-1-10",
        "Details": "John D. Rockefeller incorporates Standard Oil."
    },
    {
        "Date": "1901-1-10",
        "Details": "The first great Texas oil gusher is discovered at Spindletop in Beaumont, Texas."
    },
    {
        "Date": "1916-1-10",
        "Details": "World War I: In the Erzurum Offensive, Russia defeats the Ottoman Empire."
    },
    {
        "Date": "1920-1-10",
        "Details": "The Treaty of Versailles takes effect, officially ending World War I."
    },
    {
        "Date": "1927-1-10",
        "Details": "Fritz Lang's futuristic film Metropolis is released in Germany."
    },
    {
        "Date": "1941-1-10",
        "Details": "World War II: The Greek army captures Kleisoura."
    },
    {
        "Date": "1946-1-10",
        "Details": "The first General Assembly of the United Nations opens in London. Fifty-one nations are represented."
    },
    {
        "Date": "1946-1-10",
        "Details": "The United States Army Signal Corps successfully conducts Project Diana, bouncing radio waves off the Moon and receiving the reflected signals."
    },
    {
        "Date": "1954-1-10",
        "Details": "BOAC Flight 781, a de Havilland DH.106 Comet 1, explodes and falls into the Tyrrhenian Sea killing 35 people."
    },
    {
        "Date": "1962-1-10",
        "Details": "Apollo program: NASA announces plans to build the C-5 rocket launch vehicle, which became known as the Saturn V Moon rocket, which launched every Apollo Moon mission."
    },
    {
        "Date": "1966-1-10",
        "Details": "Tashkent Declaration, a peace agreement between India and Pakistan signed that resolved the Indo-Pakistani War of 1965."
    },
    {
        "Date": "1972-1-10",
        "Details": "Sheikh Mujibur Rahman returns to the newly independent Bangladesh as president after spending over nine months in prison in Pakistan."
    },
    {
        "Date": "1981-1-10",
        "Details": "Salvadoran Civil War: The FMLN launches its first major offensive, gaining control of most of Morazán and Chalatenango departments"
    },
    {
        "Date": "1984-1-10",
        "Details": "Holy See-United States relations: The United States and Holy See (Vatican City) re-establish full diplomatic relations after almost 117 years, overturning the United States Congress's 1867 ban on public funding for such a diplomatic envoy."
    },
    {
        "Date": "1985-1-10",
        "Details": "Sandinista Daniel Ortega becomes president of Nicaragua and vows to continue the transformation to socialism and alliance with the Soviet Union and Cuba; American policy continues to support the Contras in their revolt against the Nicaraguan government."
    },
    {
        "Date": "1990-1-10",
        "Details": "Time Warner is formed by the merger of Time Inc. and Warner Communications."
    },
    {
        "Date": "2007-1-10",
        "Details": "A general strike begins in Guinea in an attempt to get President Lansana Conté to resign."
    },
    {
        "Date": "2012-1-10",
        "Details": "A bombing in Khyber Agency, Pakistan, kills at least 30 people and 78 others injured."
    },
    {
        "Date": "2013-1-10",
        "Details": "More than 100 people are killed and 270 injured in several bomb blasts in Pakistan."
    },
    {
        "Date": "2015-1-10",
        "Details": "A mass poisoning at a funeral in Mozambique involves beer that was deliberately contaminated with crocodile bile leaving at least 56 dead and nearly 200 hospitalized."
    },
    {
        "Date": "2015-1-10",
        "Details": "A traffic accident between an oil tanker truck and passenger coach en route to Shikarpur from Karachi on the Pakistan National Highway Link Road near Gulshan-e-Hadeed, Karachi, killing at least 62 people."
    }
],
[
    {
        "Date": "532-1-11",
        "Details": "Nika riots in Constantinople: A quarrel between supporters of different chariot teams—the Blues and the Greens—in the Hippodrome escalates into violence."
    },
    {
        "Date": "947-1-11",
        "Details": "Emperor Tai Zong of the Khitan-led Liao Dynasty invades the Later Jin, resulting in the destruction of the Later Jin."
    },
    {
        "Date": "1055-1-11",
        "Details": "Theodora is crowned empress of the Byzantine Empire."
    },
    {
        "Date": "1158-1-11",
        "Details": "Vladislaus II, Duke of Bohemia becomes king of Bohemia."
    },
    {
        "Date": "1569-1-11",
        "Details": "First recorded lottery in England."
    },
    {
        "Date": "1571-1-11",
        "Details": "Austrian nobility is granted freedom of religion."
    },
    {
        "Date": "1693-1-11",
        "Details": "A powerful earthquake destroys parts of Sicily and Malta."
    },
    {
        "Date": "1759-1-11",
        "Details": "In Philadelphia, Pennsylvania, the first American life insurance company is incorporated."
    },
    {
        "Date": "1779-1-11",
        "Details": "Ching-Thang Khomba is crowned King of Manipur."
    },
    {
        "Date": "1787-1-11",
        "Details": "William Herschel discovers Titania and Oberon, two moons of Uranus."
    },
    {
        "Date": "1805-1-11",
        "Details": "The Michigan Territory is created."
    },
    {
        "Date": "1861-1-11",
        "Details": "Alabama secedes from the United States."
    },
    {
        "Date": "1863-1-11",
        "Details": "American Civil War: Battle of Arkansas Post: General John McClernand and Admiral David Dixon Porter capture the Arkansas River for the Union."
    },
    {
        "Date": "1863-1-11",
        "Details": "American Civil War: CSS Alabama encounters and sinks the USS Hatteras off Galveston Lighthouse in Texas."
    },
    {
        "Date": "1879-1-11",
        "Details": "The Anglo-Zulu War begins."
    },
    {
        "Date": "1908-1-11",
        "Details": "Grand Canyon National Monument is created."
    },
    {
        "Date": "1912-1-11",
        "Details": "Immigrant textile works in Lawrence, Massachusetts, go on strike when wages are reduced in response to a mandated shortening of the work week."
    },
    {
        "Date": "1917-1-11",
        "Details": "The Kingsland munitions factory explosion occurs as a result of sabotage."
    },
    {
        "Date": "1922-1-11",
        "Details": "First use of insulin to treat diabetes in a human patient."
    },
    {
        "Date": "1923-1-11",
        "Details": "Occupation of the Ruhr: Troops from France and Belgium occupy the Ruhr area to force Germany to make its World War I reparation payments."
    },
    {
        "Date": "1927-1-11",
        "Details": "Louis B. Mayer, head of film studio Metro-Goldwyn-Mayer (MGM), announces the creation of the Academy of Motion Picture Arts and Sciences, at a banquet in Los Angeles, California."
    },
    {
        "Date": "1935-1-11",
        "Details": "Amelia Earhart becomes the first person to fly solo from Hawaii to California."
    },
    {
        "Date": "1942-1-11",
        "Details": "World War II: The Japanese capture Kuala Lumpur."
    },
    {
        "Date": "1942-1-11",
        "Details": "World War II: The Japanese attack Tarakan in Borneo, Netherlands Indies (Battle of Tarakan)"
    },
    {
        "Date": "1943-1-11",
        "Details": "The Republic of China agrees to the Sino-British New Equal Treaty and the Sino-American New Equal Treaty."
    },
    {
        "Date": "1943-1-11",
        "Details": "Italian-American anarchist Carlo Tresca is assassinated in New York City."
    },
    {
        "Date": "1946-1-11",
        "Details": "Enver Hoxha, Secretary General of the Communist Party of Albania, declares the People's Republic of Albania with himself as head of state."
    },
    {
        "Date": "1949-1-11",
        "Details": "The first \"networked\" television broadcasts took place as KDKA-TV in Pittsburgh, Pennsylvania goes on the air connecting the east coast and mid-west programming."
    },
    {
        "Date": "1957-1-11",
        "Details": "The African Convention is founded in Dakar, Senegal."
    },
    {
        "Date": "1961-1-11",
        "Details": "Throgs Neck Bridge over the East River, linking New York City's boroughs of The Bronx and Queens, opens to road traffic."
    },
    {
        "Date": "1962-1-11",
        "Details": "Cold War: While tied to its pier in Polyarny, the Soviet submarine B-37 is destroyed when fire breaks out in its torpedo compartment."
    },
    {
        "Date": "1962-1-11",
        "Details": "An avalanche on Huascarán in Peru causes around 4,000 deaths."
    },
    {
        "Date": "1964-1-11",
        "Details": "Surgeon General of the United States Dr. Luther Terry, M.D., publishes the landmark report Smoking and Health: Report of the Advisory Committee to the Surgeon General of the United States saying that smoking may be hazardous to health, sparking national and worldwide anti-smoking efforts."
    },
    {
        "Date": "1972-1-11",
        "Details": "East Pakistan renames itself Bangladesh."
    },
    {
        "Date": "1973-1-11",
        "Details": "Major League Baseball owners vote in approval of the American League adopting the designated hitter position."
    },
    {
        "Date": "1986-1-11",
        "Details": "The Gateway Bridge, Brisbane, Queensland, Australia is officially opened."
    },
    {
        "Date": "1994-1-11",
        "Details": "The Irish Government announces the end of a 15-year broadcasting ban on the IRA and its political arm Sinn Féin."
    },
    {
        "Date": "1996-1-11",
        "Details": "Space Shuttle program: STS-72 launches from the Kennedy Space Center marking the start of the 74th Space Shuttle mission and the 10th flight of Endeavour."
    },
    {
        "Date": "1998-1-11",
        "Details": "Over 100 people are killed in the Sidi-Hamed massacre in Algeria."
    },
    {
        "Date": "2003-1-11",
        "Details": "Illinois Governor George Ryan commutes the death sentences of 167 prisoners on Illinois's death row based on the Jon Burge scandal."
    },
    {
        "Date": "2013-1-11",
        "Details": "One French soldier and 17 militants are killed in a failed attempt to free a French hostage in Bulo Marer, Somalia."
    }
],
[
    {
        "Date": "1528-1-12",
        "Details": "Gustav I of Sweden is crowned king."
    },
    {
        "Date": "1554-1-12",
        "Details": "Bayinnaung, who would go on to assemble the largest empire in the history of Southeast Asia, is crowned King of Burma."
    },
    {
        "Date": "1616-1-12",
        "Details": "The city of Belém, Brazil is founded on the Amazon River delta, by Portuguese captain Francisco Caldeira Castelo Branco."
    },
    {
        "Date": "1808-1-12",
        "Details": "John Rennie's scheme to defend St Mary's Church, Reculver, founded in 669, from coastal erosion is abandoned in favour of demolition, despite the church being an exemplar of Anglo-Saxon architecture and sculpture."
    },
    {
        "Date": "1848-1-12",
        "Details": "The Palermo rising takes place in Sicily against the Bourbon Kingdom of the Two Sicilies."
    },
    {
        "Date": "1866-1-12",
        "Details": "The Royal Aeronautical Society is formed in London."
    },
    {
        "Date": "1872-1-12",
        "Details": "Yohannes IV is crowned Emperor of Ethiopia in Axum, the first imperial coronation in that city in over 200 years."
    },
    {
        "Date": "1895-1-12",
        "Details": "The National Trust is founded in the United Kingdom."
    },
    {
        "Date": "1908-1-12",
        "Details": "A long-distance radio message is sent from the Eiffel Tower for the first time."
    },
    {
        "Date": "1911-1-12",
        "Details": "The University of the Philippines College of Law is formally established; three future Philippine presidents are among the first enrollees."
    },
    {
        "Date": "1915-1-12",
        "Details": "The United States House of Representatives rejects a proposal to require states to give women the right to vote."
    },
    {
        "Date": "1916-1-12",
        "Details": "Both Oswald Boelcke and Max Immelmann, for achieving eight aerial victories each over Allied aircraft, receive the German Empire's highest military award, the Pour le Mérite as the first German aviators to earn it."
    },
    {
        "Date": "1921-1-12",
        "Details": "Acting to restore confidence in baseball after the Black Sox Scandal, Judge Kenesaw Mountain Landis is elected as Major League Baseball's first commissioner."
    },
    {
        "Date": "1932-1-12",
        "Details": "Hattie Caraway becomes the first woman elected to the United States Senate."
    },
    {
        "Date": "1942-1-12",
        "Details": "World War II: United States President Franklin D. Roosevelt creates the National War Labor Board."
    },
    {
        "Date": "1945-1-12",
        "Details": "World War II: The Red Army begins the Vistula-Oder Offensive."
    },
    {
        "Date": "1962-1-12",
        "Details": "Vietnam War: Operation Chopper, the first American combat mission in the war, takes place."
    },
    {
        "Date": "1964-1-12",
        "Details": "Rebels in Zanzibar begin a revolt known as the Zanzibar Revolution and proclaim a republic."
    },
    {
        "Date": "1966-1-12",
        "Details": "Lyndon B. Johnson states that the United States should stay in South Vietnam until Communist aggression there is ended."
    },
    {
        "Date": "1967-1-12",
        "Details": "Dr. James Bedford becomes the first person to be cryonically preserved with intent of future resuscitation."
    },
    {
        "Date": "1969-1-12",
        "Details": "The New York Jets of the American Football League defeat the Baltimore Colts of the National Football League to win Super Bowl III in what is considered to be one of the greatest upsets in sports history."
    },
    {
        "Date": "1970-1-12",
        "Details": "Biafra capitulates, ending the Nigerian Civil War."
    },
    {
        "Date": "1971-1-12",
        "Details": "The Harrisburg Seven: Rev. Philip Berrigan and five other activists are indicted on charges of conspiring to kidnap Henry Kissinger and of plotting to blow up the heating tunnels of federal buildings in Washington, D.C."
    },
    {
        "Date": "1976-1-12",
        "Details": "The United Nations Security Council votes 11-1 to allow the Palestine Liberation Organization to participate in a Security Council debate (without voting rights)."
    },
    {
        "Date": "1986-1-12",
        "Details": "Space Shuttle program: Congressman Bill Nelson lifts off from Kennedy Space Center aboard Columbia on mission STS-61-C as a Payload Specialist."
    },
    {
        "Date": "1991-1-12",
        "Details": "Persian Gulf War: An act of the U.S. Congress authorizes the use of American military force to drive Iraq out of Kuwait."
    },
    {
        "Date": "1998-1-12",
        "Details": "Nineteen European nations agree to forbid human cloning."
    },
    {
        "Date": "2001-1-12",
        "Details": "Downtown Disney opens to the public as part of the Disneyland Resort in Anaheim, California."
    },
    {
        "Date": "2004-1-12",
        "Details": "The world's largest ocean liner, RMS Queen Mary 2, makes its maiden voyage."
    },
    {
        "Date": "2005-1-12",
        "Details": "Deep Impact launches from Cape Canaveral on a Delta II rocket."
    },
    {
        "Date": "2006-1-12",
        "Details": "A stampede during the Stoning of the Devil ritual on the last day at the Hajj in Mina, Saudi Arabia, kills at least 362 Muslim pilgrims."
    },
    {
        "Date": "2010-1-12",
        "Details": "An earthquake in Haiti occurs, killing over 100,000 people and destroying much of the capital Port-au-Prince."
    },
    {
        "Date": "2012-1-12",
        "Details": "Violent protests occur in Bucharest, Romania, as two-day-old demonstrations continue against President Traian Băsescu's economic austerity measures. Clashes are reported in numerous Romanian cities between protesters and law enforcement officers."
    },
    {
        "Date": "2015-1-12",
        "Details": "Government raids kill 143 Boko Haram fighters in Kolofata, Cameroon."
    },
    {
        "Date": "2016-1-12",
        "Details": "Ten people are killed and 15 wounded in a bombing near the Blue Mosque in Istanbul."
    }
],
[
    {
        "Date": "532-1-13",
        "Details": "Nika riots in Constantinople."
    },
    {
        "Date": "1435-1-13",
        "Details": "Sicut Dudum, forbidding the enslavement of the Guanche natives in Canary Islands by the Spanish, is promulgated by Pope Eugene IV."
    },
    {
        "Date": "1547-1-13",
        "Details": "Henry Howard, Earl of Surrey is sentenced to death."
    },
    {
        "Date": "1607-1-13",
        "Details": "The Bank of Genoa fails after announcement of national bankruptcy in Spain."
    },
    {
        "Date": "1793-1-13",
        "Details": "Nicolas Jean Hugon de Bassville, representative of Revolutionary France, lynched by a mob in Rome"
    },
    {
        "Date": "1797-1-13",
        "Details": "French Revolutionary Wars: A naval battle between a French ship of the line and two British frigates off the coast of Brittany ends with the French vessel running aground, resulting in over 900 deaths."
    },
    {
        "Date": "1815-1-13",
        "Details": "War of 1812: British troops capture Fort Peter in St. Marys, Georgia, the only battle of the war to take place in the state."
    },
    {
        "Date": "1822-1-13",
        "Details": "The design of the Greek flag is adopted by the First National Assembly at Epidaurus."
    },
    {
        "Date": "1830-1-13",
        "Details": "The Great Fire of New Orleans begins."
    },
    {
        "Date": "1833-1-13",
        "Details": "United States President Andrew Jackson writes to Vice President Martin Van Buren expressing his opposition to South Carolina's defiance of federal authority in the Nullification Crisis."
    },
    {
        "Date": "1840-1-13",
        "Details": "The steamship Lexington burns and sinks four miles off the coast of Long Island with the loss of 139 lives."
    },
    {
        "Date": "1842-1-13",
        "Details": "Dr. William Brydon, an assistant surgeon in the British East India Company Army during the First Anglo-Afghan War, becomes famous for being the sole survivor of an army of 4,500 men and 12,000 camp followers when he reaches the safety of a garrison in Jalalabad, Afghanistan."
    },
    {
        "Date": "1847-1-13",
        "Details": "The Treaty of Cahuenga ends the Mexican-American War in California."
    },
    {
        "Date": "1849-1-13",
        "Details": "Establishment of the Colony of Vancouver Island."
    },
    {
        "Date": "1888-1-13",
        "Details": "The National Geographic Society is founded in Washington, D.C."
    },
    {
        "Date": "1893-1-13",
        "Details": "The Independent Labour Party of the United Kingdom holds its first meeting."
    },
    {
        "Date": "1893-1-13",
        "Details": "U.S. Marines land in Honolulu, Hawaii from the USS Boston to prevent the queen from abrogating the Bayonet Constitution."
    },
    {
        "Date": "1895-1-13",
        "Details": "First Italo-Ethiopian War: the war's opening battle, the Battle of Coatit, occurs; it is an Italian victory."
    },
    {
        "Date": "1898-1-13",
        "Details": "Émile Zola's J'accuse…! exposes the Dreyfus affair."
    },
    {
        "Date": "1908-1-13",
        "Details": "The Rhoads Opera House fire in Boyertown, Pennsylvania kills 171 people."
    },
    {
        "Date": "1910-1-13",
        "Details": "The first public radio broadcast takes place; a live performance of the operas Cavalleria rusticana and Pagliacci are sent out over the airwaves from the Metropolitan Opera House in New York."
    },
    {
        "Date": "1915-1-13",
        "Details": "The 6.7 Mw Avezzano earthquake shakes the Province of L'Aquila in Italy with a maximum Mercalli intensity of XI (Extreme), killing between 29,978-32,610."
    },
    {
        "Date": "1935-1-13",
        "Details": "A plebiscite in Saarland shows that 90.3% of those voting wish to join Nazi Germany."
    },
    {
        "Date": "1939-1-13",
        "Details": "The Black Friday bush fires burn 20,000 square kilometers of land in Australia, claiming the lives of 71 people."
    },
    {
        "Date": "1942-1-13",
        "Details": "Henry Ford patents a plastic automobile, which is 30% lighter than a regular car."
    },
    {
        "Date": "1942-1-13",
        "Details": "World War II: First use of an aircraft ejection seat by a German test pilot in a Heinkel He 280 jet fighter."
    },
    {
        "Date": "1951-1-13",
        "Details": "First Indochina War: The Battle of Vĩnh Yên begins."
    },
    {
        "Date": "1953-1-13",
        "Details": "An article appears in Pravda accusing some of the most prestigious and prominent doctors, mostly Jews, in the Soviet Union of taking part in a vast plot to poison members of the top Soviet political and military leadership."
    },
    {
        "Date": "1958-1-13",
        "Details": "The Moroccan Army of Liberation ambushes a Spanish patrol in the Battle of Edchera."
    },
    {
        "Date": "1963-1-13",
        "Details": "Coup d'état in Togo results in the assassination of president Sylvanus Olympio"
    },
    {
        "Date": "1964-1-13",
        "Details": "Anti-Muslim riots break out in Calcutta, resulting in 100 deaths."
    },
    {
        "Date": "1966-1-13",
        "Details": "Robert C. Weaver becomes the first African American Cabinet member when he is appointed United States Secretary of Housing and Urban Development."
    },
    {
        "Date": "1968-1-13",
        "Details": "Johnny Cash performs live at Folsom State Prison"
    },
    {
        "Date": "1972-1-13",
        "Details": "Prime Minister Kofi Abrefa Busia and President Edward Akufo-Addo of Ghana are ousted in a bloodless military coup by Colonel Ignatius Kutu Acheampong."
    },
    {
        "Date": "1974-1-13",
        "Details": "Seraphim is elected Archbishop of Athens and All Greece."
    },
    {
        "Date": "1978-1-13",
        "Details": "United States Food and Drug Administration requires all blood donations to be labeled \"paid\" or \"volunteer\" donors."
    },
    {
        "Date": "1982-1-13",
        "Details": "Shortly after takeoff, Air Florida Flight 90, a Boeing 737 jet, crashes into Washington, D.C.'s 14th Street Bridge and falls into the Potomac River, killing 78 including four motorists."
    },
    {
        "Date": "1985-1-13",
        "Details": "A passenger train plunges into a ravine in Ethiopia, killing 428 in the worst railroad disaster in Africa."
    },
    {
        "Date": "1986-1-13",
        "Details": "A month-long violent struggle begins in Aden, South Yemen between supporters of Ali Nasir Muhammad and Abdul Fattah Ismail, resulting in thousands of casualties."
    },
    {
        "Date": "1988-1-13",
        "Details": "Lee Teng-hui becomes the first native Taiwanese President of the Republic of China."
    },
    {
        "Date": "1990-1-13",
        "Details": "A seven-day pogrom breaks out against the Armenian civilian population of Baku, Azerbaijan, during which Armenians were beaten, tortured, murdered, and expelled from the city."
    },
    {
        "Date": "1990-1-13",
        "Details": "Douglas Wilder becomes the first elected African American governor as he takes office in Richmond, Virginia."
    },
    {
        "Date": "1991-1-13",
        "Details": "Soviet Union troops attack Lithuanian independence supporters in Vilnius, killing 14 people and wounding around 1000 others."
    },
    {
        "Date": "1993-1-13",
        "Details": "Space Shuttle program: Endeavour heads for space for the third time as STS-54 launches from the Kennedy Space Center."
    },
    {
        "Date": "1998-1-13",
        "Details": "Alfredo Ormando sets himself on fire in St. Peter's Square, protesting against homophobia."
    },
    {
        "Date": "2001-1-13",
        "Details": "An earthquake hits El Salvador, killing more than 800."
    },
    {
        "Date": "2012-1-13",
        "Details": "The passenger cruise ship Costa Concordia sinks off the coast of Italy due to the captain's negligence and irresponsibility. There are 32 confirmed deaths."
    }
],
[
    {
        "Date": "1301-1-14",
        "Details": "Andrew III of Hungary dies, ending the Árpád dynasty in Hungary."
    },
    {
        "Date": "1343-1-14",
        "Details": "Arnošt of Pardubice becomes the last bishop of Prague and, subsequently, the first Archbishop of Prague."
    },
    {
        "Date": "1539-1-14",
        "Details": "Spain annexes Cuba."
    },
    {
        "Date": "1639-1-14",
        "Details": "The \"Fundamental Orders\", the first written constitution that created a government, is adopted in Connecticut."
    },
    {
        "Date": "1761-1-14",
        "Details": "The Third Battle of Panipat is fought in India between the Afghans under Ahmad Shah Durrani and the Marathas."
    },
    {
        "Date": "1784-1-14",
        "Details": "American Revolutionary War: Ratification Day, United States - Congress ratifies the Treaty of Paris with Great Britain."
    },
    {
        "Date": "1814-1-14",
        "Details": "Treaty of Kiel: Frederick VI of Denmark cedes Norway to Sweden in return for Pomerania."
    },
    {
        "Date": "1822-1-14",
        "Details": "Greek War of Independence: Acrocorinth is captured by Theodoros Kolokotronis and Demetrios Ypsilantis."
    },
    {
        "Date": "1858-1-14",
        "Details": "Napoleon III of France escapes an assassination attempt."
    },
    {
        "Date": "1907-1-14",
        "Details": "An earthquake in Kingston, Jamaica kills more than 1,000 people."
    },
    {
        "Date": "1911-1-14",
        "Details": "Roald Amundsen's South Pole expedition makes landfall on the eastern edge of the Ross Ice Shelf."
    },
    {
        "Date": "1938-1-14",
        "Details": "Norway claims Queen Maud Land in Antarctica."
    },
    {
        "Date": "1943-1-14",
        "Details": "World War II: Japan begins Operation Ke, the successful operation to evacuate its forces from Guadalcanal during the Guadalcanal Campaign."
    },
    {
        "Date": "1943-1-14",
        "Details": "World War II: Franklin D. Roosevelt and Winston Churchill begin the Casablanca Conference to discuss strategy and study the next phase of the war."
    },
    {
        "Date": "1943-1-14",
        "Details": "World War II: Franklin D. Roosevelt becomes the first President of the United States to travel by airplane while in office when he travels from Miami to Morocco to meet with Winston Churchill."
    },
    {
        "Date": "1950-1-14",
        "Details": "The first prototype of the MiG-17 makes its maiden flight."
    },
    {
        "Date": "1952-1-14",
        "Details": "NBC's long-running morning news program Today debuts, with host Dave Garroway."
    },
    {
        "Date": "1953-1-14",
        "Details": "Josip Broz Tito is inaugurated as the first President of Yugoslavia."
    },
    {
        "Date": "1954-1-14",
        "Details": "The Hudson Motor Car Company merges with Nash-Kelvinator Corporation forming the American Motors Corporation."
    },
    {
        "Date": "1957-1-14",
        "Details": "Kripalu Maharaj was named fifth Jagadguru (world teacher) after giving seven days of speeches before 500 Hindu scholars."
    },
    {
        "Date": "1960-1-14",
        "Details": "The Reserve Bank of Australia, the country's central bank and banknote issuing authority, is established."
    },
    {
        "Date": "1967-1-14",
        "Details": "Counterculture of the 1960s: The Human Be-In takes place in San Francisco, California's Golden Gate Park, launching the Summer of Love."
    },
    {
        "Date": "1969-1-14",
        "Details": "An accidental explosion aboard the USS Enterprise near Hawaii kills 27 people."
    },
    {
        "Date": "1972-1-14",
        "Details": "Queen Margrethe II of Denmark ascends the throne, the first Queen of Denmark since 1412 and the first Danish monarch not named Frederick or Christian since 1513."
    },
    {
        "Date": "1973-1-14",
        "Details": "Elvis Presley's concert Aloha from Hawaii is broadcast live via satellite, and sets the record as the most watched broadcast by an individual entertainer in television history."
    },
    {
        "Date": "1993-1-14",
        "Details": "In Poland's worst peacetime maritime disaster, ferry MS Jan Heweliusz sinks off the coast of Rügen, drowning 55 passengers and crew; nine crew-members are saved."
    },
    {
        "Date": "2000-1-14",
        "Details": "A United Nations tribunal sentences five Bosnian Croats to up to 25 years in prison for the 1993 killing of more than 100 Bosnian Muslims."
    },
    {
        "Date": "2004-1-14",
        "Details": "The national flag of the Republic of Georgia, the so-called \"five cross flag\", is restored to official use after a hiatus of some 500 years."
    },
    {
        "Date": "2010-1-14",
        "Details": "Yemen declares an open war against the terrorist group al-Qaeda."
    },
    {
        "Date": "2011-1-14",
        "Details": "Former president of Tunisia, Zine El Abidine Ben Ali flees his country to Saudi Arabia after a series of street demonstrations against his regime and corrupt policies, asking for freedom, rights and democracy, considered as the anniversary of the Tunisian Revolution and the birth of the Arab Spring."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Otho seizes power in Rome, proclaiming himself Emperor of Rome, but rules for only three months before committing suicide."
    },
    {
        "Date": "1541-1-15",
        "Details": "King Francis I of France gives Jean-François Roberval a commission to settle the province of New France (Canada) and provide for the spread of the \"Holy Catholic faith\"."
    },
    {
        "Date": "1559-1-15",
        "Details": "Elizabeth I is crowned Queen of England in Westminster Abbey, London, England."
    },
    {
        "Date": "1582-1-15",
        "Details": "Truce of Yam-Zapolsky: Russia cedes Livonia to the Polish-Lithuanian Commonwealth."
    },
    {
        "Date": "1759-1-15",
        "Details": "The British Museum opens."
    },
    {
        "Date": "1777-1-15",
        "Details": "American Revolutionary War: New Connecticut (present-day Vermont) declares its independence."
    },
    {
        "Date": "1782-1-15",
        "Details": "Superintendent of Finance Robert Morris goes before the U.S. Congress to recommend establishment of a national mint and decimal coinage."
    },
    {
        "Date": "1815-1-15",
        "Details": "War of 1812: American frigate USS President, commanded by Commodore Stephen Decatur, is captured by a squadron of four British frigates."
    },
    {
        "Date": "1822-1-15",
        "Details": "Greek War of Independence: Demetrios Ypsilantis is elected president of the legislative assembly."
    },
    {
        "Date": "1844-1-15",
        "Details": "University of Notre Dame receives its charter from the state of Indiana."
    },
    {
        "Date": "1865-1-15",
        "Details": "American Civil War: Fort Fisher in North Carolina falls to the Union, thus cutting off the last major seaport of the Confederacy."
    },
    {
        "Date": "1870-1-15",
        "Details": "A political cartoon for the first time symbolizes the Democratic Party with a donkey (\"A Live Jackass Kicking a Dead Lion\" by Thomas Nast for Harper's Weekly)."
    },
    {
        "Date": "1876-1-15",
        "Details": "The first newspaper in Afrikaans, Die Afrikaanse Patriot, is published in Paarl."
    },
    {
        "Date": "1889-1-15",
        "Details": "The Coca-Cola Company, then known as the Pemberton Medicine Company, is incorporated in Atlanta."
    },
    {
        "Date": "1892-1-15",
        "Details": "James Naismith publishes the rules of basketball."
    },
    {
        "Date": "1908-1-15",
        "Details": "The Alpha Kappa Alpha sorority becomes the first Greek-letter organization founded and established by African American college women."
    },
    {
        "Date": "1910-1-15",
        "Details": "Construction ends on the Buffalo Bill Dam in Wyoming, United States, which was the highest dam in the world at the time, at 325 ft (99 m)."
    },
    {
        "Date": "1919-1-15",
        "Details": "Rosa Luxemburg and Karl Liebknecht, two of the most prominent socialists in Germany, are tortured and murdered by the Freikorps at the end of the Spartacist uprising."
    },
    {
        "Date": "1919-1-15",
        "Details": "Great Molasses Flood: A wave of molasses released from an exploding storage tank sweeps through Boston, Massachusetts, killing 21 and injuring 150."
    },
    {
        "Date": "1934-1-15",
        "Details": "The 8.0 Mw Nepal-Bihar earthquake strikes Nepal and Bihar with a maximum Mercalli intensity of XI (Extreme), killing an estimated 6,000-10,700 people."
    },
    {
        "Date": "1936-1-15",
        "Details": "The first building to be completely covered in glass, built for the Owens-Illinois Glass Company, is completed in Toledo, Ohio."
    },
    {
        "Date": "1937-1-15",
        "Details": "Spanish Civil War: Nationalists and Republican both withdraw after suffering heavy losses, ending the Second Battle of the Corunna Road."
    },
    {
        "Date": "1943-1-15",
        "Details": "World War II: The Soviet counter-offensive at Voronezh begins."
    },
    {
        "Date": "1943-1-15",
        "Details": "The Pentagon is dedicated in Arlington, Virginia."
    },
    {
        "Date": "1947-1-15",
        "Details": "The Black Dahlia murder: the dismembered corpse of Elizabeth Short was found in Los Angeles."
    },
    {
        "Date": "1949-1-15",
        "Details": "Chinese Civil War: The Communist forces take over Tianjin from the Nationalist Government."
    },
    {
        "Date": "1962-1-15",
        "Details": "The Derveni papyrus, Europe's oldest surviving manuscript dating to 340 BC, is found in northern Greece."
    },
    {
        "Date": "1962-1-15",
        "Details": "Netherlands New Guinea Conflict: Indonesian Navy fast patrol boat RI Macan Tutul commanded by Commodore Yos Sudarso sunk in Arafura Sea by the Dutch Navy."
    },
    {
        "Date": "1966-1-15",
        "Details": "The First Nigerian Republic, led by Abubakar Tafawa Balewa is overthrown in a military coup d'état."
    },
    {
        "Date": "1967-1-15",
        "Details": "The first Super Bowl is played in Los Angeles. The Green Bay Packers defeat the Kansas City Chiefs 35-10."
    },
    {
        "Date": "1969-1-15",
        "Details": "The Soviet Union launches Soyuz 5."
    },
    {
        "Date": "1970-1-15",
        "Details": "Nigerian Civil War: Biafran rebels surrender following an unsuccessful 32-month fight for independence from Nigeria."
    },
    {
        "Date": "1970-1-15",
        "Details": "Muammar Gaddafi is proclaimed premier of Libya."
    },
    {
        "Date": "1973-1-15",
        "Details": "Vietnam War: Citing progress in peace negotiations, President Richard Nixon announces the suspension of offensive action in North Vietnam."
    },
    {
        "Date": "1975-1-15",
        "Details": "The Alvor Agreement is signed, ending the Angolan War of Independence and giving Angola independence from Portugal."
    },
    {
        "Date": "1976-1-15",
        "Details": "Gerald Ford's would-be assassin, Sara Jane Moore, is sentenced to life in prison."
    },
    {
        "Date": "1981-1-15",
        "Details": "Pope John Paul II receives a delegation from Solidarity (Polish trade union) at the Vatican led by Lech Wałęsa."
    },
    {
        "Date": "1991-1-15",
        "Details": "The United Nations deadline for the withdrawal of Iraqi forces from occupied Kuwait expires, preparing the way for the start of Operation Desert Storm."
    },
    {
        "Date": "1991-1-15",
        "Details": "Elizabeth II, in her capacity as Queen of Australia, signs letters patent allowing Australia to become the first Commonwealth realm to institute its own Victoria Cross in its honours system."
    },
    {
        "Date": "2001-1-15",
        "Details": "Wikipedia, a free wiki content encyclopedia, goes online."
    },
    {
        "Date": "2005-1-15",
        "Details": "ESA's SMART-1 lunar orbiter discovers elements such as calcium, aluminum, silicon, iron, and other surface elements on the Moon."
    },
    {
        "Date": "2007-1-15",
        "Details": "Barzan Ibrahim al-Tikriti, former Iraqi intelligence chief and half-brother of Saddam Hussein, and Awad Hamed al-Bandar, former chief judge of the Revolutionary Court, are executed by hanging in Iraq."
    },
    {
        "Date": "2009-1-15",
        "Details": "Captain Sully (Chesley Sullenberger) emergency landed a US Airways Flight 1549 in the Hudson River saving all 155 passengers after the plane collided with birds few minutes after take-off."
    },
    {
        "Date": "2013-1-15",
        "Details": "A train carrying Egyptian Army recruits derails near Giza, Greater Cairo, killing 19 and injuring 120 others."
    },
    {
        "Date": "2016-1-15",
        "Details": "The Kenyan Army suffers it worst defeat ever in a battle with Al-Shabaab Islamic insurgents in El-Adde, Somalia. An estimated 150 soldiers die."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Gaius Julius Caesar Octavianus is granted the title Augustus by the Roman Senate, marking the beginning of the Roman Empire."
    },
    {
        "Date": "378-1-16",
        "Details": "General Siyaj K'ak' conquers Tikal, enlarging the domain of King Spearthrower Owl of Teotihuacán."
    },
    {
        "Date": "550-1-16",
        "Details": "Gothic War: The Ostrogoths, under King Totila, conquer Rome after a long siege, by bribing the Isaurian garrison."
    },
    {
        "Date": "929-1-16",
        "Details": "Emir Abd-ar-Rahman III established the Caliphate of Córdoba."
    },
    {
        "Date": "1120-1-16",
        "Details": "The Council of Nablus is held, establishing the earliest surviving written laws of the Crusader Kingdom of Jerusalem."
    },
    {
        "Date": "1362-1-16",
        "Details": "A storm tide in the North Sea ravages the East coast of England and destroys the German city of Rungholt on the island of Strand."
    },
    {
        "Date": "1412-1-16",
        "Details": "The Medici family is appointed official banker of the Papacy."
    },
    {
        "Date": "1492-1-16",
        "Details": "The first grammar of the Spanish language (Gramática de la lengua castellana) is presented to Queen Isabella I."
    },
    {
        "Date": "1547-1-16",
        "Details": "Ivan the Terrible becomes Czar of Russia."
    },
    {
        "Date": "1556-1-16",
        "Details": "Philip II becomes King of Spain."
    },
    {
        "Date": "1572-1-16",
        "Details": "Thomas Howard, 4th Duke of Norfolk is tried for treason for his part in the Ridolfi plot to restore Catholicism in England."
    },
    {
        "Date": "1605-1-16",
        "Details": "The first edition of El ingenioso hidalgo Don Quijote de la Mancha (Book One of Don Quixote) by Miguel de Cervantes is published in Madrid, Spain."
    },
    {
        "Date": "1707-1-16",
        "Details": "The Scottish Parliament ratifies the Act of Union, paving the way for the creation of Great Britain."
    },
    {
        "Date": "1780-1-16",
        "Details": "American Revolutionary War: Battle of Cape St. Vincent."
    },
    {
        "Date": "1786-1-16",
        "Details": "Virginia enacts the Statute for Religious Freedom authored by Thomas Jefferson."
    },
    {
        "Date": "1809-1-16",
        "Details": "Peninsular War: The British defeat the French at the Battle of La Coruña."
    },
    {
        "Date": "1847-1-16",
        "Details": "John C. Frémont is appointed Governor of the new California Territory."
    },
    {
        "Date": "1862-1-16",
        "Details": "Hartley Colliery disaster: Two hundred and four men and boys killed in a mining disaster, prompted a change in UK law which henceforth required all collieries to have at least two independent means of escape."
    },
    {
        "Date": "1878-1-16",
        "Details": "Russo-Turkish War (1877-78): Battle of Philippopolis: Captain Aleksandr Burago with a squadron of Russian Imperial army dragoons liberates Plovdiv from Ottoman rule."
    },
    {
        "Date": "1883-1-16",
        "Details": "The Pendleton Civil Service Reform Act, establishing the United States Civil Service, is passed."
    },
    {
        "Date": "1900-1-16",
        "Details": "The United States Senate accepts the Anglo-German treaty of 1899 in which the United Kingdom renounces its claims to the Samoan islands."
    },
    {
        "Date": "1909-1-16",
        "Details": "Ernest Shackleton's expedition finds the magnetic South Pole."
    },
    {
        "Date": "1919-1-16",
        "Details": "Temperance movement: The United States ratifies the Eighteenth Amendment to the United States Constitution, requiring Prohibition in the United States one year after ratification."
    },
    {
        "Date": "1920-1-16",
        "Details": "Zeta Phi Beta Sorority Incorporated was founded on the campus of Howard University."
    },
    {
        "Date": "1920-1-16",
        "Details": "The League of Nations holds its first council meeting in Paris, France."
    },
    {
        "Date": "1921-1-16",
        "Details": "The Marxist Left in Slovakia and the Transcarpathian Ukraine holds its founding congress in Ľubochňa."
    },
    {
        "Date": "1924-1-16",
        "Details": "Eleftherios Venizelos becomes Prime Minister of Greece for the fourth time."
    },
    {
        "Date": "1938-1-16",
        "Details": "Benny Goodman and his band performed in concert at Carnegie Hall in New York City"
    },
    {
        "Date": "1942-1-16",
        "Details": "Crash of TWA Flight 3, killing all 22 aboard, including film star Carole Lombard."
    },
    {
        "Date": "1945-1-16",
        "Details": "Adolf Hitler moves into his underground bunker, the so-called Führerbunker."
    },
    {
        "Date": "1964-1-16",
        "Details": "Hello, Dolly! opened on Broadway, beginning a run of 2,844 performances."
    },
    {
        "Date": "1969-1-16",
        "Details": "Czech student Jan Palach commits suicide by self-immolation in Prague, Czechoslovakia, in protest against the Soviets' crushing of the Prague Spring the year before."
    },
    {
        "Date": "1969-1-16",
        "Details": "Soviet spacecraft Soyuz 4 and Soyuz 5 perform the first-ever docking of manned spacecraft in orbit, the first-ever transfer of crew from one space vehicle to another, and the only time such a transfer was accomplished with a space walk."
    },
    {
        "Date": "1970-1-16",
        "Details": "Buckminster Fuller receives the Gold Medal award from the American Institute of Architects."
    },
    {
        "Date": "1979-1-16",
        "Details": "The last Iranian Shah flees Iran with his family for good and relocates to Egypt."
    },
    {
        "Date": "1991-1-16",
        "Details": "Coalition Forces go to war with Iraq, beginning the Gulf War."
    },
    {
        "Date": "1992-1-16",
        "Details": "El Salvador officials and rebel leaders sign the Chapultepec Peace Accords in Mexico City, Mexico ending the 12-year Salvadoran Civil War that claimed at least 75,000 lives."
    },
    {
        "Date": "2001-1-16",
        "Details": "Congolese President Laurent-Désiré Kabila is assassinated by one of his own bodyguards."
    },
    {
        "Date": "2001-1-16",
        "Details": "US President Bill Clinton awards former President Theodore Roosevelt a posthumous Medal of Honor for his service in the Spanish-American War."
    },
    {
        "Date": "2002-1-16",
        "Details": "The UN Security Council unanimously establishes an arms embargo and the freezing of assets of Osama bin Laden, al-Qaeda, and the remaining members of the Taliban."
    },
    {
        "Date": "2003-1-16",
        "Details": "The Space Shuttle Columbia takes off for mission STS-107 which would be its final one. Columbia disintegrated 16 days later on re-entry."
    },
    {
        "Date": "2006-1-16",
        "Details": "Ellen Johnson Sirleaf is sworn in as Liberia's new president. She becomes Africa's first female elected head of state."
    },
    {
        "Date": "2016-1-16",
        "Details": "33 out of 126 freed hostages are injured and 23 killed in terrorist attacks in Ouagadougou, Burkina Faso on a hotel and a nearby restaurant."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Octavian divorces his wife Scribonia and marries Livia Drusilla, ending the fragile peace between the Second Triumvirate and Sextus Pompey."
    },
    {
        "Date": "395-1-17",
        "Details": "Upon the death of Emperor Theodosius I, the Roman Empire is permanently divided into the Eastern Roman Empire under Arcadius, and the Western Roman Empire under Honorius."
    },
    {
        "Date": "1287-1-17",
        "Details": "King Alfonso III of Aragon invades Menorca."
    },
    {
        "Date": "1377-1-17",
        "Details": "Pope Gregory XI moves the Papacy back to Rome from Avignon."
    },
    {
        "Date": "1524-1-17",
        "Details": "Giovanni da Verrazzano sets sail westward from Madeira to find a sea route to the Pacific Ocean."
    },
    {
        "Date": "1562-1-17",
        "Details": "France recognizes the Huguenots by the Edict of Saint-Germain."
    },
    {
        "Date": "1595-1-17",
        "Details": "During the French Wars of Religion, Henry IV of France declares war on Spain."
    },
    {
        "Date": "1608-1-17",
        "Details": "Emperor Susenyos I of Ethiopia surprises an Oromo army at Ebenat; his army reportedly kills 12,000 Oromo at the cost of 400 of his men."
    },
    {
        "Date": "1648-1-17",
        "Details": "England's Long Parliament passes the \"Vote of No Addresses\", breaking off negotiations with King Charles I and thereby setting the scene for the second phase of the English Civil War."
    },
    {
        "Date": "1773-1-17",
        "Details": "Captain James Cook commands the first expedition to sail south of the Antarctic Circle."
    },
    {
        "Date": "1781-1-17",
        "Details": "American Revolutionary War: Battle of Cowpens: Continental troops under Brigadier General Daniel Morgan defeat British forces under Lieutenant Colonel Banastre Tarleton at the battle in South Carolina."
    },
    {
        "Date": "1799-1-17",
        "Details": "Maltese patriot Dun Mikiel Xerri, along with a number of other patriots, is executed."
    },
    {
        "Date": "1811-1-17",
        "Details": "Mexican War of Independence: In the Battle of Calderón Bridge, a heavily outnumbered Spanish force of 6,000 troops defeats nearly 100,000 Mexican revolutionaries."
    },
    {
        "Date": "1852-1-17",
        "Details": "The United Kingdom signs the Sand River Convention with the South African Republic."
    },
    {
        "Date": "1873-1-17",
        "Details": "A group of Modoc warriors defeats the United States Army in the First Battle of the Stronghold, part of the Modoc War."
    },
    {
        "Date": "1885-1-17",
        "Details": "A British force defeats a large Dervish army at the Battle of Abu Klea in the Sudan."
    },
    {
        "Date": "1893-1-17",
        "Details": "Lorrin A. Thurston, along with the Citizens' Committee of Public Safety, led the Overthrow of the Kingdom of Hawaii and the government of Queen Liliʻuokalani."
    },
    {
        "Date": "1899-1-17",
        "Details": "The United States takes possession of Wake Island in the Pacific Ocean."
    },
    {
        "Date": "1903-1-17",
        "Details": "El Yunque National Forest in Puerto Rico becomes part of the United States National Forest System as the Luquillo Forest Reserve."
    },
    {
        "Date": "1904-1-17",
        "Details": "Anton Chekhov's The Cherry Orchard receives its premiere performance at the Moscow Art Theatre."
    },
    {
        "Date": "1912-1-17",
        "Details": "Captain Robert Falcon Scott reaches the South Pole, one month after Roald Amundsen."
    },
    {
        "Date": "1915-1-17",
        "Details": "Russia defeats Ottoman Turkey in the Battle of Sarikamish during the Caucasus Campaign of World War I."
    },
    {
        "Date": "1917-1-17",
        "Details": "The United States pays Denmark $25 million for the Virgin Islands."
    },
    {
        "Date": "1918-1-17",
        "Details": "Finnish Civil War: The first serious battles take place between the Red Guards and the White Guard."
    },
    {
        "Date": "1929-1-17",
        "Details": "Popeye the Sailor Man, a cartoon character created by E. C. Segar, first appears in the Thimble Theatre comic strip."
    },
    {
        "Date": "1941-1-17",
        "Details": "Franco-Thai War: French forces inflict a decisive defeat over the Royal Thai Navy."
    },
    {
        "Date": "1943-1-17",
        "Details": "World War II: Greek submarine Papanikolis captures the 200-ton sailing vessel Agios Stefanos and mans her with part of her crew."
    },
    {
        "Date": "1944-1-17",
        "Details": "World War II: Allied forces launch the first of four assaults on Monte Cassino with the intention of breaking through the Winter Line and seizing Rome, an effort that would ultimately take four months and cost 105,000 Allied casualties."
    },
    {
        "Date": "1945-1-17",
        "Details": "World War II: The Vistula-Oder Offensive forces German troops out of Warsaw."
    },
    {
        "Date": "1945-1-17",
        "Details": "The SS-Totenkopfverbände begin the evacuation of the Auschwitz concentration camp as Soviet forces close in."
    },
    {
        "Date": "1945-1-17",
        "Details": "Swedish diplomat Raoul Wallenberg is taken into Soviet custody while in Hungary; he is never publicly seen again."
    },
    {
        "Date": "1946-1-17",
        "Details": "The UN Security Council holds its first session."
    },
    {
        "Date": "1948-1-17",
        "Details": "The Renville Agreement between the Netherlands and Indonesia is ratified."
    },
    {
        "Date": "1950-1-17",
        "Details": "The Great Brink's Robbery: Eleven thieves steal more than $2 million from an armored car company's offices in Boston."
    },
    {
        "Date": "1950-1-17",
        "Details": "United Nations Security Council Resolution 79 relating to arms control is adopted."
    },
    {
        "Date": "1961-1-17",
        "Details": "U.S. President Dwight D. Eisenhower delivers a televised farewell address to the nation three days before leaving office, in which he warns against the accumulation of power by the \"military-industrial complex\" as well as the dangers of massive spending, especially deficit spending."
    },
    {
        "Date": "1961-1-17",
        "Details": "Former Congolese Prime Minister Patrice Lumumba is murdered in circumstances suggesting the support and complicity of the governments of Belgium and the United States."
    },
    {
        "Date": "1966-1-17",
        "Details": "Palomares incident: A B-52 bomber collides with a KC-135 Stratotanker over Spain, killing seven airmen, and dropping three 70-kiloton nuclear bombs near the town of Palomares and another one into the sea."
    },
    {
        "Date": "1969-1-17",
        "Details": "Black Panther Party members Bunchy Carter and John Huggins are killed during a meeting in Campbell Hall on the campus of UCLA."
    },
    {
        "Date": "1977-1-17",
        "Details": "Capital punishment in the United States resumes after a ten-year hiatus, as convicted murderer Gary Gilmore is executed by firing squad in Utah."
    },
    {
        "Date": "1981-1-17",
        "Details": "President of the Philippines Ferdinand Marcos lifts martial law eight years and five months after declaring it."
    },
    {
        "Date": "1991-1-17",
        "Details": "Gulf War: Operation Desert Storm begins early in the morning. Iraq fires eight Scud missiles into Israel in an unsuccessful bid to provoke Israeli retaliation."
    },
    {
        "Date": "1992-1-17",
        "Details": "During a visit to South Korea, Japanese Prime Minister Kiichi Miyazawa apologizes for forcing Korean women into sexual slavery during World War II."
    },
    {
        "Date": "1994-1-17",
        "Details": "The 6.7 Mw Northridge earthquake shakes the Greater Los Angeles Area with a maximum Mercalli intensity of IX (Violent), leaving 57 people dead and more than 8,700 injured."
    },
    {
        "Date": "1995-1-17",
        "Details": "The 6.9 Mw Great Hanshin earthquake shakes the southern Hyōgo Prefecture with a maximum Shindo of VII, leaving 5,502-6,434 people dead, and 251,301-310,000 displaced."
    },
    {
        "Date": "1996-1-17",
        "Details": "The Czech Republic applies for membership of the European Union."
    },
    {
        "Date": "1997-1-17",
        "Details": "Cape Canaveral Air Force Station: A Delta II carrying a GPS2R satellite explodes 13 seconds after launch, dropping 250 tons of burning rocket remains around the launch pad."
    },
    {
        "Date": "1998-1-17",
        "Details": "Lewinsky scandal: Matt Drudge breaks the story of the Bill Clinton-Monica Lewinsky affair on his Drudge Report website."
    },
    {
        "Date": "2002-1-17",
        "Details": "Mount Nyiragongo erupts in the Democratic Republic of the Congo, displacing an estimated 400,000 people."
    },
    {
        "Date": "2007-1-17",
        "Details": "The Doomsday Clock is set to five minutes to midnight in response to North Korea's nuclear testing."
    },
    {
        "Date": "2010-1-17",
        "Details": "Rioting begins between Muslim and Christian groups in Jos, Nigeria, results in at least 200 deaths."
    }
],
[
    {
        "Date": "350-1-18",
        "Details": "General Magnentius deposes Roman Emperor Constans and proclaims himself Emperor."
    },
    {
        "Date": "474-1-18",
        "Details": "Seven-year-old Leo II succeeds his maternal grandfather Leo I as Byzantine emperor. He dies ten months later."
    },
    {
        "Date": "532-1-18",
        "Details": "Nika riots in Constantinople fail."
    },
    {
        "Date": "1126-1-18",
        "Details": "Emperor Huizong abdicates the Chinese throne in favour of his son Emperor Qinzong."
    },
    {
        "Date": "1486-1-18",
        "Details": "King Henry VII of England marries Elizabeth of York, daughter of Edward IV."
    },
    {
        "Date": "1535-1-18",
        "Details": "Spanish conquistador Francisco Pizarro founds Lima, the capital of Peru."
    },
    {
        "Date": "1562-1-18",
        "Details": "Pope Pius IV reopens the Council of Trent for its third and final session."
    },
    {
        "Date": "1591-1-18",
        "Details": "King Naresuan of Siam kills Crown Prince Mingyi Swa of Burma in single combat, for which this date is now observed as Royal Thai Armed Forces day."
    },
    {
        "Date": "1670-1-18",
        "Details": "Henry Morgan captures Panama."
    },
    {
        "Date": "1701-1-18",
        "Details": "Frederick I crowns himself King of Prussia in Königsberg."
    },
    {
        "Date": "1778-1-18",
        "Details": "James Cook is the first known European to discover the Hawaiian Islands, which he names the \"Sandwich Islands\"."
    },
    {
        "Date": "1788-1-18",
        "Details": "The first elements of the First Fleet carrying 736 convicts from Great Britain to Australia arrive at Botany Bay."
    },
    {
        "Date": "1866-1-18",
        "Details": "Wesley College, Melbourne, is established."
    },
    {
        "Date": "1871-1-18",
        "Details": "Wilhelm I of Germany is proclaimed Kaiser Wilhelm in the Hall of Mirrors of the Palace of Versailles (France) towards the end of the Franco-Prussian War. Wilhelm already had the title of German Emperor since the constitution of 1 January 1871, but he had hesitated to accept the title."
    },
    {
        "Date": "1884-1-18",
        "Details": "Dr. William Price attempts to cremate the body of his infant son, Jesus Christ Price, setting a legal precedent for cremation in the United Kingdom."
    },
    {
        "Date": "1886-1-18",
        "Details": "Modern hockey is born with the formation of The Hockey Association in England."
    },
    {
        "Date": "1896-1-18",
        "Details": "An X-ray generating machine is exhibited for the first time by H. L. Smith."
    },
    {
        "Date": "1911-1-18",
        "Details": "Eugene B. Ely lands on the deck of the USS Pennsylvania stationed in San Francisco Bay, the first time an aircraft landed on a ship."
    },
    {
        "Date": "1913-1-18",
        "Details": "First Balkan War: A Greek flotilla defeats the Ottoman Navy in the Naval Battle of Lemnos, securing the islands of the Northern Aegean Sea for Greece."
    },
    {
        "Date": "1915-1-18",
        "Details": "Japan issues the \"Twenty-One Demands\" to the Republic of China in a bid to increase its power in East Asia."
    },
    {
        "Date": "1919-1-18",
        "Details": "World War I: The Paris Peace Conference opens in Versailles, France."
    },
    {
        "Date": "1919-1-18",
        "Details": "Ignacy Jan Paderewski becomes Prime Minister of the newly independent Poland."
    },
    {
        "Date": "1941-1-18",
        "Details": "World War II: British troops launch a general counter-offensive against Italian East Africa."
    },
    {
        "Date": "1943-1-18",
        "Details": "Warsaw Ghetto Uprising: The first uprising of Jews in the Warsaw Ghetto."
    },
    {
        "Date": "1945-1-18",
        "Details": "World War II: Liberation of Kraków, Poland by the Red Army."
    },
    {
        "Date": "1958-1-18",
        "Details": "Willie O'Ree, the first African Canadian National Hockey League player, makes his NHL debut with the Boston Bruins."
    },
    {
        "Date": "1960-1-18",
        "Details": "Capital Airlines Flight 20 crashes into a farm in Charles City County, Virginia, killing all 50 aboard, the third fatal Capital Airlines crash in as many years."
    },
    {
        "Date": "1967-1-18",
        "Details": "Albert DeSalvo, the \"Boston Strangler\", is convicted of numerous crimes and is sentenced to life imprisonment."
    },
    {
        "Date": "1969-1-18",
        "Details": "United Airlines Flight 266 crashes into Santa Monica Bay killing all 32 passengers and six crew members."
    },
    {
        "Date": "1974-1-18",
        "Details": "A Disengagement of Forces agreement is signed between the Israeli and Egyptian governments, ending conflict on the Egyptian front of the Yom Kippur War."
    },
    {
        "Date": "1976-1-18",
        "Details": "Lebanese Christian militias kill at least 1,000 in Karantina, Beirut."
    },
    {
        "Date": "1977-1-18",
        "Details": "Scientists identify a previously unknown bacterium as the cause of the mysterious Legionnaires' disease."
    },
    {
        "Date": "1977-1-18",
        "Details": "Australia's worst rail disaster occurs at Granville, Sydney killing 83."
    },
    {
        "Date": "1977-1-18",
        "Details": "SFR Yugoslavia's Prime minister, Džemal Bijedić, his wife and six others are killed in a plane crash in Bosnia and Herzegovina."
    },
    {
        "Date": "1978-1-18",
        "Details": "The European Court of Human Rights finds the United Kingdom's government guilty of mistreating prisoners in Northern Ireland, but not guilty of torture."
    },
    {
        "Date": "1981-1-18",
        "Details": "Phil Smith and Phil Mayfield parachute off a Houston skyscraper, becoming the first two people to BASE jump from objects in all four categories: buildings, antennae, spans (bridges), and earth (cliffs)."
    },
    {
        "Date": "1983-1-18",
        "Details": "The International Olympic Committee restores Jim Thorpe's Olympic medals to his family."
    },
    {
        "Date": "1990-1-18",
        "Details": "Washington, D.C. Mayor Marion Barry is arrested for drug possession in an FBI sting."
    },
    {
        "Date": "1993-1-18",
        "Details": "Martin Luther King, Jr. Day is officially observed for the first time in all 50 states."
    },
    {
        "Date": "2002-1-18",
        "Details": "Sierra Leone Civil War is declared over."
    },
    {
        "Date": "2003-1-18",
        "Details": "A bushfire kills four people and destroys more than 500 homes in Canberra, Australia."
    },
    {
        "Date": "2005-1-18",
        "Details": "The Airbus A380, the world's largest commercial jet, is unveiled at a ceremony in Toulouse, France"
    },
    {
        "Date": "2007-1-18",
        "Details": "The strongest storm in the United Kingdom in 17 years kills 14 people and Germany sees the worst storm since 1999 with 13 deaths. Hurricane Kyrill causes at least 44 deaths across 20 countries in Western Europe."
    },
    {
        "Date": "2009-1-18",
        "Details": "Gaza War: Hamas announces they will accept Israel Defense Forces offer of a ceasefire, ending the assault."
    }
],
[
    {
        "Date": "379-1-19",
        "Details": "Emperor Gratian elevates Flavius Theodosius at Sirmium to Augustus, and gives him authority over all the eastern provinces of the Roman Empire."
    },
    {
        "Date": "639-1-19",
        "Details": "Clovis II, king of Neustria and Burgundy, is crowned."
    },
    {
        "Date": "649-1-19",
        "Details": "Conquest of Kucha: The forces of Kucha surrender after a forty-day siege led by Tang dynasty general Ashina She'er, establishing Tang control over the northern Tarim Basin in Xinjiang."
    },
    {
        "Date": "1419-1-19",
        "Details": "Hundred Years' War: Rouen surrenders to Henry V of England, completing his reconquest of Normandy."
    },
    {
        "Date": "1511-1-19",
        "Details": "Mirandola surrenders to the French."
    },
    {
        "Date": "1520-1-19",
        "Details": "Sten Sture the Younger, the Regent of Sweden, is mortally wounded at the Battle of Bogesund."
    },
    {
        "Date": "1607-1-19",
        "Details": "San Agustin Church in Manila is officially completed; it is the oldest church still standing in the Philippines."
    },
    {
        "Date": "1661-1-19",
        "Details": "Thomas Venner is hanged, drawn and quartered in London."
    },
    {
        "Date": "1764-1-19",
        "Details": "John Wilkes is expelled from the British House of Commons for seditious libel."
    },
    {
        "Date": "1788-1-19",
        "Details": "The second group of ships of the First Fleet arrive at Botany Bay."
    },
    {
        "Date": "1795-1-19",
        "Details": "The Batavian Republic is proclaimed in the Netherlands, bringing to an end the Republic of the Seven United Netherlands."
    },
    {
        "Date": "1806-1-19",
        "Details": "Britain occupies the Dutch Cape Colony after the Battle of Blaauwberg."
    },
    {
        "Date": "1812-1-19",
        "Details": "Peninsular War: After a ten-day siege, Arthur Wellesley, 1st Duke of Wellington, orders British soldiers of the Light and third divisions to storm Ciudad Rodrigo."
    },
    {
        "Date": "1817-1-19",
        "Details": "An army of 5,423 soldiers, led by General José de San Martín, crosses the Andes from Argentina to liberate Chile and then Peru."
    },
    {
        "Date": "1829-1-19",
        "Details": "Johann Wolfgang von Goethe's Faust: The First Part of the Tragedy receives its premiere performance."
    },
    {
        "Date": "1839-1-19",
        "Details": "The British East India Company captures Aden."
    },
    {
        "Date": "1853-1-19",
        "Details": "Giuseppe Verdi's opera Il trovatore receives its premiere performance in Rome."
    },
    {
        "Date": "1861-1-19",
        "Details": "American Civil War: Georgia joins South Carolina, Florida, Mississippi, and Alabama in declaring secession from the United States."
    },
    {
        "Date": "1862-1-19",
        "Details": "American Civil War: Battle of Mill Springs: The Confederacy suffers its first significant defeat in the conflict."
    },
    {
        "Date": "1871-1-19",
        "Details": "Franco-Prussian War: In the Siege of Paris, Prussia wins the Battle of St. Quentin. Meanwhile, the French attempt to break the siege in the Battle of Buzenval will end unsuccessfully the following day."
    },
    {
        "Date": "1883-1-19",
        "Details": "The first electric lighting system employing overhead wires, built by Thomas Edison, begins service at Roselle, New Jersey."
    },
    {
        "Date": "1899-1-19",
        "Details": "Anglo-Egyptian Sudan is formed."
    },
    {
        "Date": "1915-1-19",
        "Details": "Georges Claude patents the neon discharge tube for use in advertising."
    },
    {
        "Date": "1915-1-19",
        "Details": "World War I: German zeppelins bomb the towns of Great Yarmouth and King's Lynn in the United Kingdom killing at least 20 people, in the first major aerial bombardment of a civilian target."
    },
    {
        "Date": "1917-1-19",
        "Details": "Seventy-three people are killed and 400 injured in an explosion in a munitions plant in London."
    },
    {
        "Date": "1920-1-19",
        "Details": "The United States Senate votes against joining the League of Nations."
    },
    {
        "Date": "1937-1-19",
        "Details": "Howard Hughes sets a new air record by flying from Los Angeles to New York City in 7 hours, 28 minutes, 25 seconds."
    },
    {
        "Date": "1940-1-19",
        "Details": "You Nazty Spy!, the very first Hollywood film of any kind to satirize Adolf Hitler and the Nazis premieres, starring The Three Stooges, with Moe Howard as the character \"Moe Hailstone\" satirizing Hitler."
    },
    {
        "Date": "1941-1-19",
        "Details": "World War II: The Greek Triton (Y-5) sinks the Italian submarine Neghelli in Otranto."
    },
    {
        "Date": "1942-1-19",
        "Details": "World War II: The Japanese conquest of Burma begins."
    },
    {
        "Date": "1945-1-19",
        "Details": "World War II: Soviet forces liberate the Łódź Ghetto. Of more than 200,000 inhabitants in 1940, less than 900 had survived the Nazi occupation."
    },
    {
        "Date": "1946-1-19",
        "Details": "General Douglas MacArthur establishes the International Military Tribunal for the Far East in Tokyo to try Japanese war criminals."
    },
    {
        "Date": "1953-1-19",
        "Details": "Almost 72% of all television sets in the United States are tuned into I Love Lucy to watch Lucy give birth."
    },
    {
        "Date": "1960-1-19",
        "Details": "Japan and the United States sign the US-Japan Mutual Security Treaty"
    },
    {
        "Date": "1969-1-19",
        "Details": "Student Jan Palach dies after setting himself on fire three days earlier in Prague's Wenceslas Square to protest about the invasion of Czechoslovakia by the Soviet Union in 1968. His funeral turns into another major protest."
    },
    {
        "Date": "1974-1-19",
        "Details": "China gain control over all the Paracel Islands after a military engagement between the naval forces of the People's Republic of China and Republic of Vietnam (South Vietnam)"
    },
    {
        "Date": "1977-1-19",
        "Details": "President Gerald Ford pardons Iva Toguri D'Aquino (a.k.a. \"Tokyo Rose\")."
    },
    {
        "Date": "1978-1-19",
        "Details": "The last Volkswagen Beetle made in Germany leaves VW's plant in Emden. Beetle production in Latin America continues until 2003."
    },
    {
        "Date": "1981-1-19",
        "Details": "Iran hostage crisis: United States and Iranian officials sign an agreement to release 52 American hostages after 14 months of captivity."
    },
    {
        "Date": "1983-1-19",
        "Details": "Nazi war criminal Klaus Barbie is arrested in Bolivia."
    },
    {
        "Date": "1983-1-19",
        "Details": "The Apple Lisa, the first commercial personal computer from Apple Inc. to have a graphical user interface and a computer mouse, is announced."
    },
    {
        "Date": "1986-1-19",
        "Details": "The first IBM PC computer virus is released into the wild. A boot sector virus dubbed (c)Brain, it was created by the Farooq Alvi Brothers in Lahore, Pakistan, reportedly to deter unauthorized copying of the software they had written."
    },
    {
        "Date": "1991-1-19",
        "Details": "Gulf War: Iraq fires a second Scud missile into Israel, causing 15 injuries."
    },
    {
        "Date": "1993-1-19",
        "Details": "Czech Republic and Slovakia join the United Nations."
    },
    {
        "Date": "1995-1-19",
        "Details": "After being struck by lightning the crew of Bristow Flight 56C are forced to ditch. All 18 aboard are later rescued."
    },
    {
        "Date": "1996-1-19",
        "Details": "The barge North Cape oil spill occurs as an engine fire forces the tugboat Scandia ashore on Moonstone Beach in South Kingstown, Rhode Island."
    },
    {
        "Date": "1997-1-19",
        "Details": "Yasser Arafat returns to Hebron after more than 30 years and joins celebrations over the handover of the last Israeli-controlled West Bank city."
    },
    {
        "Date": "1999-1-19",
        "Details": "British Aerospace agrees to acquire the defence subsidiary of the General Electric Company plc, forming BAE Systems in November 1999."
    },
    {
        "Date": "2007-1-19",
        "Details": "Turkish-Armenian Journalist Hrant Dink is assassinated in front of his newspaper's Istanbul office by 17-year-old Turkish ultra-nationalist Ogün Samast."
    },
    {
        "Date": "2012-1-19",
        "Details": "The Hong Kong-based file-sharing website Megaupload is shut down by the FBI."
    },
    {
        "Date": "2014-1-19",
        "Details": "A bomb attack on an army convoy in the city of Bannu kills at least 26 soldiers and injures 38 others."
    }
],
[
    {
        "Date": "250-1-20",
        "Details": "Emperor Decius begins a widespread persecution of Christians in Rome. Pope Fabian is martyred."
    },
    {
        "Date": "649-1-20",
        "Details": "King Chindasuinth, at the urging of bishop Braulio of Zaragoza, crowns his son Recceswinth as co-ruler of the Visigothic Kingdom."
    },
    {
        "Date": "1265-1-20",
        "Details": "The first English parliament to include not only Lords but also representatives of the major towns holds its first meeting in the Palace of Westminster, now commonly known as the \"Houses of Parliament\"."
    },
    {
        "Date": "1320-1-20",
        "Details": "Duke Wladyslaw Lokietek becomes king of Poland."
    },
    {
        "Date": "1356-1-20",
        "Details": "Edward Balliol surrenders his claim to the Scottish throne to Edward III in exchange for an English pension."
    },
    {
        "Date": "1523-1-20",
        "Details": "Christian II is forced to abdicate as King of Denmark and Norway."
    },
    {
        "Date": "1567-1-20",
        "Details": "Battle of Rio de Janeiro: Portuguese forces under the command of Estácio de Sá definitively drive the French out of Rio de Janeiro."
    },
    {
        "Date": "1576-1-20",
        "Details": "The Mexican city of León is founded by order of the viceroy Don Martín Enríquez de Almanza."
    },
    {
        "Date": "1649-1-20",
        "Details": "Charles I of England goes on trial for treason and other \"high crimes\"."
    },
    {
        "Date": "1783-1-20",
        "Details": "The Kingdom of Great Britain signs a peace treaty with France and Spain, officially ending hostilities in the American Revolutionary War."
    },
    {
        "Date": "1785-1-20",
        "Details": "Invading Siamese forces attempt to exploit the political chaos in Vietnam, but are ambushed and annihilated at the Mekong river by the Tây Sơn in the Battle of Rạch Gầm-Xoài Mút."
    },
    {
        "Date": "1788-1-20",
        "Details": "The third and main part of First Fleet arrives at Botany Bay. Arthur Phillip decides that Botany Bay is unsuitable for the location of a penal colony, and decides to move to Port Jackson."
    },
    {
        "Date": "1839-1-20",
        "Details": "In the Battle of Yungay, Chile defeats an alliance between Peru and Bolivia."
    },
    {
        "Date": "1841-1-20",
        "Details": "Hong Kong Island is occupied by the British."
    },
    {
        "Date": "1877-1-20",
        "Details": "The last day of the Constantinople Conference results in agreement for political reforms in the Balkans."
    },
    {
        "Date": "1887-1-20",
        "Details": "The United States Senate allows the Navy to lease Pearl Harbor as a naval base."
    },
    {
        "Date": "1920-1-20",
        "Details": "The American Civil Liberties Union (ACLU) is founded."
    },
    {
        "Date": "1921-1-20",
        "Details": "The first Constitution of Turkey is adopted, making fundamental changes in the source and exercise of sovereignty by consecrating the principle of national sovereignty."
    },
    {
        "Date": "1929-1-20",
        "Details": "In Old Arizona, the first full-length talking motion picture filmed outdoors, is released."
    },
    {
        "Date": "1936-1-20",
        "Details": "Edward VIII becomes King of the United Kingdom."
    },
    {
        "Date": "1937-1-20",
        "Details": "Franklin Delano Roosevelt and John Nance Garner are sworn in for their second terms as U.S. President and U.S. Vice President, the first occasion a Presidential Inauguration to take place on January 20 following the ratification of the 20th Amendment"
    },
    {
        "Date": "1941-1-20",
        "Details": "A German officer is killed in Bucharest, Romania, sparking a rebellion and pogrom by the Iron Guard, killing 125 Jews and 30 soldiers."
    },
    {
        "Date": "1942-1-20",
        "Details": "World War II: At the Wannsee Conference held in the Berlin suburb of Wannsee, senior Nazi German officials discuss the implementation of the \"Final Solution to the Jewish question\"."
    },
    {
        "Date": "1945-1-20",
        "Details": "World War II: The provisional government of Béla Miklós in Hungary agrees to an armistice with the Allies."
    },
    {
        "Date": "1945-1-20",
        "Details": "World War II: Germany begins the evacuation of 1.8 million people from East Prussia, a task which will take nearly two months."
    },
    {
        "Date": "1948-1-20",
        "Details": "United Nations Security Council Resolution 39 relating to India and Pakistan is adopted."
    },
    {
        "Date": "1949-1-20",
        "Details": "Point Four Program a program for economic aid to poor countries announced by United States President Harry S. Truman in his inaugural address for a full term as President."
    },
    {
        "Date": "1953-1-20",
        "Details": "Dwight D. Eisenhower is inaugurated as the 34th President of the United States of America, becoming the first President to begin his presidency on January 20 following the ratification of the 20th Amendment."
    },
    {
        "Date": "1954-1-20",
        "Details": "In the United States, the National Negro Network is established with 40 charter member radio stations."
    },
    {
        "Date": "1972-1-20",
        "Details": "Pakistan launched its nuclear weapons program, a few weeks after its defeat in the Bangladesh Liberation War, as well as the Indo-Pakistani War of 1971."
    },
    {
        "Date": "1981-1-20",
        "Details": "Twenty minutes after Ronald Reagan was inaugurated, Iran releases 52 American hostages."
    },
    {
        "Date": "1986-1-20",
        "Details": "In the United States, Martin Luther King, Jr. Day is celebrated as a federal holiday for the first time."
    },
    {
        "Date": "1990-1-20",
        "Details": "The Red Army crackdown on civil protests in Baku, Azerbaijan during the dissolution of the Soviet Union."
    },
    {
        "Date": "1991-1-20",
        "Details": "Sudan's government imposes Islamic law nationwide, worsening the civil war between the country's Muslim north and Christian south."
    },
    {
        "Date": "1992-1-20",
        "Details": "Air Inter Flight 148, an Airbus A320-111, crashes into a mountain near Strasbourg, France killing 87 of the 96 people on board."
    },
    {
        "Date": "2001-1-20",
        "Details": "President of the Philippines Joseph Estrada is ousted in a nonviolent 4-day revolution, and is succeeded by Gloria Macapagal-Arroyo."
    },
    {
        "Date": "2007-1-20",
        "Details": "Four-man Team N2i, using only skis and kites, completes a 1,093-mile (1,759 km) trek to reach the Antarctic pole of inaccessibility for the first time since 1965 and for the first time ever without mechanical assistance."
    },
    {
        "Date": "2009-1-20",
        "Details": "A protest movement in Iceland culminates as the 2009 Icelandic financial crisis protests start."
    },
    {
        "Date": "2009-1-20",
        "Details": "Barack Obama is inaugurated as the 44th President of the United States of America, becoming the first African-American President of the United States."
    },
    {
        "Date": "2017-1-20",
        "Details": "Donald Trump is inaugurated as the 45th President of the United States of America."
    }
],
[
    {
        "Date": "763-1-21",
        "Details": "The Battle of Bakhamra between Alids and Abbasids near Kufa ends in a decisive Abbasid victory."
    },
    {
        "Date": "1525-1-21",
        "Details": "The Swiss Anabaptist Movement is founded when Conrad Grebel, Felix Manz, George Blaurock, and about a dozen others baptize each other in the home of Manz's mother in Zürich, breaking a thousand-year tradition of church-state union."
    },
    {
        "Date": "1535-1-21",
        "Details": "Following the Affair of the Placards, French Protestants are burned at the stake in front of the Cathedral of Notre Dame de Paris"
    },
    {
        "Date": "1720-1-21",
        "Details": "Sweden and Prussia sign the Treaty of Stockholm."
    },
    {
        "Date": "1749-1-21",
        "Details": "The Teatro Filarmonico in Verona is destroyed by fire. It is rebuilt in 1754."
    },
    {
        "Date": "1774-1-21",
        "Details": "Abdul Hamid I became Sultan of the Ottoman Empire and Caliph of Islam."
    },
    {
        "Date": "1789-1-21",
        "Details": "The first American novel, The Power of Sympathy or the Triumph of Nature Founded in Truth, is printed in Boston."
    },
    {
        "Date": "1793-1-21",
        "Details": "After being found guilty of treason by the French National Convention, Louis XVI of France is executed by guillotine."
    },
    {
        "Date": "1861-1-21",
        "Details": "American Civil War: Jefferson Davis resigns from the United States Senate."
    },
    {
        "Date": "1893-1-21",
        "Details": "The Tati Concessions Land, formerly part of Matabeleland, is formally annexed to the Bechuanaland Protectorate, now Botswana."
    },
    {
        "Date": "1908-1-21",
        "Details": "New York City passes the Sullivan Ordinance, making it illegal for women to smoke in public, only to have the measure vetoed by the mayor."
    },
    {
        "Date": "1911-1-21",
        "Details": "The first Monte Carlo Rally takes place."
    },
    {
        "Date": "1915-1-21",
        "Details": "Kiwanis International is founded in Detroit."
    },
    {
        "Date": "1919-1-21",
        "Details": "Meeting of the First Dáil Éireann in the Mansion House Dublin. Sinn Féin adopts Ireland's first constitution. The first engagement of the Irish War of Independence, the Soloheadbeg ambush, County Tipperary."
    },
    {
        "Date": "1925-1-21",
        "Details": "Albania declares itself a republic."
    },
    {
        "Date": "1931-1-21",
        "Details": "Sir Isaac Isaacs is sworn in as the first Australian-born Governor-General of Australia."
    },
    {
        "Date": "1941-1-21",
        "Details": "Sparked by the murder of a German officer in Bucharest, Romania, the day before, members of the Iron Guard engaged in a rebellion and pogrom killing 125 Jews."
    },
    {
        "Date": "1948-1-21",
        "Details": "The Flag of Quebec is adopted and flown for the first time over the National Assembly of Quebec. The day is marked annually as Québec Flag Day."
    },
    {
        "Date": "1950-1-21",
        "Details": "American lawyer and government official Alger Hiss is convicted of perjury."
    },
    {
        "Date": "1954-1-21",
        "Details": "The first nuclear-powered submarine, the USS Nautilus, is launched in Groton, Connecticut by Mamie Eisenhower, the First Lady of the United States."
    },
    {
        "Date": "1960-1-21",
        "Details": "Little Joe 1B, a Mercury spacecraft, lifts off from Wallops Island, Virginia with Miss Sam, a female rhesus monkey on board."
    },
    {
        "Date": "1960-1-21",
        "Details": "Avianca Flight 671 crashes and burns upon landing at Montego Bay, Jamaica killing 37. It is the worst air disaster in Jamaica's history and the first for Avianca."
    },
    {
        "Date": "1961-1-21",
        "Details": "Four hundred thirty-five workers are buried alive when a mine in Coalbrook, Free State, South Africa collapses."
    },
    {
        "Date": "1968-1-21",
        "Details": "Vietnam War: Battle of Khe Sanh: One of the most publicized and controversial battles of the war begins."
    },
    {
        "Date": "1968-1-21",
        "Details": "A B-52 bomber crashes near Thule Air Base, contaminating the area after its nuclear payload ruptures. One of the four bombs remains unaccounted for after the cleanup operation is complete."
    },
    {
        "Date": "1971-1-21",
        "Details": "The current Emley Moor transmitting station, the tallest free-standing structure in the United Kingdom, begins transmitting UHF broadcasts."
    },
    {
        "Date": "1976-1-21",
        "Details": "Commercial service of Concorde begins with the London-Bahrain and Paris-Rio routes."
    },
    {
        "Date": "1981-1-21",
        "Details": "Production of the iconic DeLorean DMC-12 sports car begins in Dunmurry, Northern Ireland, United Kingdom."
    },
    {
        "Date": "1997-1-21",
        "Details": "The U.S. House of Representatives votes 395-28 to reprimand Newt Gingrich for ethics violations, making him the first Speaker of the House to be so disciplined."
    },
    {
        "Date": "1999-1-21",
        "Details": "War on Drugs: In one of the largest drug busts in American history, the United States Coast Guard intercepts a ship with over 4,300 kilograms (9,500 lb) of cocaine on board."
    },
    {
        "Date": "2000-1-21",
        "Details": "Ecuador: After the Ecuadorian Congress is seized by indigenous organizations, Col. Lucio Gutiérrez, Carlos Solorzano and Antonio Vargas depose President Jamil Mahuad. Gutierrez is later replaced by Gen. Carlos Mendoza, who resigns and allows Vice-President Gustavo Noboa to succeed Mahuad."
    },
    {
        "Date": "2003-1-21",
        "Details": "A 7.6 magnitude earthquake strikes the Mexican state of Colima, killing 29 and leaving approximately 10,000 people homeless."
    },
    {
        "Date": "2004-1-21",
        "Details": "NASA's MER-A (the Mars Rover Spirit) ceases communication with mission control. The problem lies in the management of its flash memory and is fixed remotely from Earth on February 6."
    },
    {
        "Date": "2005-1-21",
        "Details": "In Belmopan, Belize, the unrest over the government's new taxes erupts into riots."
    },
    {
        "Date": "2017-1-21",
        "Details": "Over 400 cities across America and 160+ countries worldwide participate in a large-scale women's march, on Donald Trump's first full day as president of the United States."
    }
],
[
    {
        "Date": "613-1-22",
        "Details": "Eight-month-old Constantine is crowned as co-emperor (Caesar) by his father Heraclius at Constantinople."
    },
    {
        "Date": "871-1-22",
        "Details": "Battle of Basing: The West Saxons led by king Æthelred I are defeated by the Danelaw Vikings at Basing."
    },
    {
        "Date": "1506-1-22",
        "Details": "The first contingent of 150 Swiss Guards arrives at the Vatican."
    },
    {
        "Date": "1517-1-22",
        "Details": "The Ottoman Empire under Selim I defeats the Mamluk Sultanate and captures present-day Egypt at the Battle of Ridaniya."
    },
    {
        "Date": "1555-1-22",
        "Details": "The Ava Kingdom falls to the Taungoo Dynasty in what is now Burma."
    },
    {
        "Date": "1689-1-22",
        "Details": "The Convention Parliament convenes to determine whether James II and VII, the last Roman Catholic monarch of England, Ireland and Scotland, had vacated the thrones of England and Ireland when he fled to France in 1688."
    },
    {
        "Date": "1808-1-22",
        "Details": "The Portuguese royal family arrives in Brazil after fleeing the French army's invasion of Portugal two months earlier."
    },
    {
        "Date": "1824-1-22",
        "Details": "The Ashantis defeat British forces in the Gold Coast."
    },
    {
        "Date": "1849-1-22",
        "Details": "Second Anglo-Sikh War: The Siege of Multan ends after nine months when the last Sikh defenders of Multan, Punjab, surrender."
    },
    {
        "Date": "1863-1-22",
        "Details": "The January Uprising breaks out in Poland, Lithuania and Belarus. The aim of the national movement is to regain Polish-Lithuanian-Ruthenian Commonwealth from occupation by Russia."
    },
    {
        "Date": "1879-1-22",
        "Details": "The Battle of Isandlwana during the Anglo-Zulu War results in a British defeat."
    },
    {
        "Date": "1879-1-22",
        "Details": "The Battle of Rorke's Drift, also during the Anglo-Zulu War and just some 71km away from Isandlwana, results in a British victory."
    },
    {
        "Date": "1889-1-22",
        "Details": "Columbia Phonograph is formed in Washington, D.C."
    },
    {
        "Date": "1890-1-22",
        "Details": "The United Mine Workers of America is founded in Columbus, Ohio."
    },
    {
        "Date": "1901-1-22",
        "Details": "Edward VII is proclaimed King after the death of his mother, Queen Victoria."
    },
    {
        "Date": "1905-1-22",
        "Details": "Bloody Sunday in Saint Petersburg, beginning of the 1905 revolution."
    },
    {
        "Date": "1906-1-22",
        "Details": "SS Valencia runs aground on rocks on Vancouver Island, British Columbia, killing more than 130."
    },
    {
        "Date": "1915-1-22",
        "Details": "Over 600 people are killed in Guadalajara, Mexico, when a train plunges off the tracks into a deep canyon."
    },
    {
        "Date": "1917-1-22",
        "Details": "World War I: President Woodrow Wilson of the still-neutral United States calls for \"peace without victory\" in Europe."
    },
    {
        "Date": "1919-1-22",
        "Details": "Act Zluky is signed, unifying the Ukrainian People's Republic and the West Ukrainian National Republic."
    },
    {
        "Date": "1924-1-22",
        "Details": "Ramsay MacDonald becomes the first Labour Prime Minister of the United Kingdom."
    },
    {
        "Date": "1927-1-22",
        "Details": "Teddy Wakelam gives the first live radio commentary of a football match anywhere in the world, between Arsenal F.C. and Sheffield United at Highbury."
    },
    {
        "Date": "1941-1-22",
        "Details": "World War II: British and Commonwealth troops capture Tobruk from Italian forces during Operation Compass."
    },
    {
        "Date": "1944-1-22",
        "Details": "World War II: The Allies commence Operation Shingle, an assault on Anzio and Nettuno, Italy."
    },
    {
        "Date": "1946-1-22",
        "Details": "In Iran, Qazi Muhammad declares the independent people's Republic of Mahabad at Chahar Cheragh Square in the Kurdish city of Mahabad; he becomes the new president and Haji Baba Sheikh becomes the prime minister."
    },
    {
        "Date": "1946-1-22",
        "Details": "Creation of the Central Intelligence Group, forerunner of the Central Intelligence Agency."
    },
    {
        "Date": "1947-1-22",
        "Details": "KTLA, the first commercial television station west of the Mississippi River, begins operation in Hollywood."
    },
    {
        "Date": "1957-1-22",
        "Details": "Israel withdraws from the Sinai Peninsula."
    },
    {
        "Date": "1957-1-22",
        "Details": "The New York City \"Mad Bomber\", George P. Metesky, is arrested in Waterbury, Connecticut and charged with planting more than 30 bombs."
    },
    {
        "Date": "1963-1-22",
        "Details": "The Élysée Treaty of cooperation between France and Germany is signed by Charles de Gaulle and Konrad Adenauer."
    },
    {
        "Date": "1968-1-22",
        "Details": "Apollo 5 lifts off carrying the first Lunar module into space."
    },
    {
        "Date": "1968-1-22",
        "Details": "Operation Igloo White, a US electronic surveillance system to stop communist infiltration into South Vietnam begins installation."
    },
    {
        "Date": "1970-1-22",
        "Details": "The Boeing 747, the world's first \"jumbo jet\", enters commercial service for launch customer Pan American Airways with its maiden voyage from John F. Kennedy International Airport to London Heathrow Airport."
    },
    {
        "Date": "1971-1-22",
        "Details": "The Singapore Declaration, one of the two most important documents to the uncodified constitution of the Commonwealth of Nations, is issued."
    },
    {
        "Date": "1973-1-22",
        "Details": "The Supreme Court of the United States delivers its decisions in Roe v. Wade and Doe v. Bolton, legalizing elective abortion in all fifty states."
    },
    {
        "Date": "1973-1-22",
        "Details": "The crew of Apollo 17 addresses a joint session of Congress after the completion of the final Apollo moon landing mission."
    },
    {
        "Date": "1973-1-22",
        "Details": "A chartered Boeing 707 explodes in flames upon landing at Kano Airport, Nigeria, killing 176."
    },
    {
        "Date": "1984-1-22",
        "Details": "The Apple Macintosh, the first consumer computer to popularize the computer mouse and the graphical user interface, is introduced during a Super Bowl XVIII television commercial."
    },
    {
        "Date": "1987-1-22",
        "Details": "Philippine security forces open fire on a crowd of 10,000-15,000 demonstrators at Malacañang Palace, Manila, killing 13."
    },
    {
        "Date": "1992-1-22",
        "Details": "Rebel forces occupy Zaire's national radio station in Kinshasa and broadcast a demand for the government's resignation."
    },
    {
        "Date": "1992-1-22",
        "Details": "Space Shuttle program: Dr. Roberta Bondar becomes the first Canadian woman and the first neurologist in space."
    },
    {
        "Date": "1995-1-22",
        "Details": "Israeli-Palestinian conflict: Beit Lid massacre: In central Israel, near Netanya, two Gazans blow themselves up at a military transit point, killing 19 Israelis."
    },
    {
        "Date": "1999-1-22",
        "Details": "Australian missionary Graham Staines and his two sons are burned alive by radical Hindus while sleeping in their car in Eastern India."
    },
    {
        "Date": "2002-1-22",
        "Details": "Kmart becomes the largest retailer in United States history to file for Chapter 11 bankruptcy protection."
    },
    {
        "Date": "2006-1-22",
        "Details": "Evo Morales is inaugurated as President of Bolivia, becoming the country's first indigenous president."
    },
    {
        "Date": "2007-1-22",
        "Details": "At least 88 people are killed when two car bombs explode in the Bab Al-Sharqi market in central Baghdad, Iraq."
    },
    {
        "Date": "2015-1-22",
        "Details": "An explosion near a civilian trolley-bus in Donetsk kills at least thirteen people."
    }
],
[
    {
        "Date": "393-1-23",
        "Details": "Roman Emperor Theodosius I proclaims his eight-year-old son Honorius co-emperor."
    },
    {
        "Date": "971-1-23",
        "Details": "Using crossbows, Song dynasty troops soundly defeat a war elephant corps of the Southern Han at Shao."
    },
    {
        "Date": "1264-1-23",
        "Details": "In the conflict between King Henry III of England and his rebellious barons led by Simon de Montfort, King Louis IX of France issues the Mise of Amiens, a one-sided decision in favour of Henry that later leads to the Second Barons' War."
    },
    {
        "Date": "1368-1-23",
        "Details": "In a coronation ceremony, Zhu Yuanzhang ascends the throne of China as the Hongwu Emperor, initiating Ming dynasty rule over China that would last for three centuries."
    },
    {
        "Date": "1546-1-23",
        "Details": "Having published nothing for eleven years, François Rabelais publishes the Tiers Livre, his sequel to Gargantua and Pantagruel."
    },
    {
        "Date": "1556-1-23",
        "Details": "The deadliest earthquake in history, the Shaanxi earthquake, hits Shaanxi province, China. The death toll may have been as high as 830,000."
    },
    {
        "Date": "1570-1-23",
        "Details": "James Stewart, 1st Earl of Moray, regent for the infant King James VI of Scotland, is assassinated by firearm, the first recorded instance of such."
    },
    {
        "Date": "1571-1-23",
        "Details": "The Royal Exchange opens in London."
    },
    {
        "Date": "1579-1-23",
        "Details": "The Union of Utrecht forms a Protestant republic in the Netherlands."
    },
    {
        "Date": "1656-1-23",
        "Details": "Blaise Pascal publishes the first of his Lettres provinciales."
    },
    {
        "Date": "1719-1-23",
        "Details": "The Principality of Liechtenstein is created within the Holy Roman Empire."
    },
    {
        "Date": "1789-1-23",
        "Details": "Georgetown College, the first Catholic university in the United States, is founded in Georgetown, Maryland (now a part of Washington, D.C.)"
    },
    {
        "Date": "1793-1-23",
        "Details": "Second Partition of Poland."
    },
    {
        "Date": "1795-1-23",
        "Details": "After an extraordinary charge across the frozen Zuiderzee, the French cavalry captured 14 Dutch ships and 850 guns, in a rare occurrence of a battle between ships and cavalry"
    },
    {
        "Date": "1846-1-23",
        "Details": "Slavery in Tunisia is abolished."
    },
    {
        "Date": "1849-1-23",
        "Details": "Elizabeth Blackwell is awarded her M.D. by the Geneva Medical College of Geneva, New York, becoming the United States' first female doctor."
    },
    {
        "Date": "1870-1-23",
        "Details": "In Montana, U.S. cavalrymen kill 173 Native Americans, mostly women and children, in what becomes known as the Marias Massacre."
    },
    {
        "Date": "1879-1-23",
        "Details": "Anglo-Zulu War: the Battle of Rorke's Drift ends."
    },
    {
        "Date": "1899-1-23",
        "Details": "The Malolos Constitution is inaugurated, establishing the First Philippine Republic."
    },
    {
        "Date": "1899-1-23",
        "Details": "Emilio Aguinaldo is sworn in as President of the First Philippine Republic."
    },
    {
        "Date": "1900-1-23",
        "Details": "Second Boer War: The Battle of Spion Kop between the forces of the South African Republic and the Orange Free State and British forces ends in a British defeat."
    },
    {
        "Date": "1904-1-23",
        "Details": "Ålesund Fire: the Norwegian coastal town Ålesund is devastated by fire, leaving 10,000 people homeless and one person dead. Kaiser Wilhelm II funds the rebuilding of the town in Jugendstil style."
    },
    {
        "Date": "1909-1-23",
        "Details": "RMS Republic, a passenger ship of the White Star Line, becomes the first ship to use the CQD distress signal after colliding with another ship, the SS Florida, off the Massachusetts coastline, an event that kills six people. The Republic sinks the next day."
    },
    {
        "Date": "1912-1-23",
        "Details": "The International Opium Convention is signed at The Hague."
    },
    {
        "Date": "1920-1-23",
        "Details": "The Netherlands refuses to surrender the exiled Kaiser Wilhelm II of Germany to the Allies."
    },
    {
        "Date": "1937-1-23",
        "Details": "The trial of the anti-Soviet Trotskyist center sees seventeen mid-level Communists accused of sympathizing with Leon Trotsky and plotting to overthrow Joseph Stalin's regime."
    },
    {
        "Date": "1941-1-23",
        "Details": "Charles Lindbergh testifies before the U.S. Congress and recommends that the United States negotiate a neutrality pact with Adolf Hitler."
    },
    {
        "Date": "1942-1-23",
        "Details": "World War II: The Battle of Rabaul commences Japan's invasion of Australia's Territory of New Guinea."
    },
    {
        "Date": "1943-1-23",
        "Details": "World War II: Troops of Montgomery's Eighth Army capture Tripoli in Libya from the German-Italian Panzer Army."
    },
    {
        "Date": "1943-1-23",
        "Details": "World War II: Australian and American forces defeat Japanese army and navy units in the bitterly-fought Battle of Buna-Gona."
    },
    {
        "Date": "1945-1-23",
        "Details": "World War II: German admiral Karl Dönitz launches Operation Hannibal."
    },
    {
        "Date": "1950-1-23",
        "Details": "The Knesset resolves that Jerusalem is the capital of Israel."
    },
    {
        "Date": "1957-1-23",
        "Details": "American inventor Walter Frederick Morrison sells the rights to his flying disc to the Wham-O toy company, which later renames it the \"Frisbee\"."
    },
    {
        "Date": "1958-1-23",
        "Details": "After a general uprising and rioting in the streets, President Marcos Pérez Jiménez leaves Venezuela."
    },
    {
        "Date": "1960-1-23",
        "Details": "The bathyscaphe USS Trieste breaks a depth record by descending to 10,911 metres (35,797 ft) in the Pacific Ocean."
    },
    {
        "Date": "1961-1-23",
        "Details": "The Portuguese luxury cruise ship Santa Maria is hijacked by opponents of the Estado Novo regime with the intention of waging war until dictator António de Oliveira Salazar is overthrown."
    },
    {
        "Date": "1963-1-23",
        "Details": "The Guinea-Bissau War of Independence officially begins when PAIGC guerrilla fighters attack the Portuguese army stationed in Tite."
    },
    {
        "Date": "1964-1-23",
        "Details": "The 24th Amendment to the United States Constitution, prohibiting the use of poll taxes in national elections, is ratified."
    },
    {
        "Date": "1967-1-23",
        "Details": "Diplomatic relations between the Soviet Union and Ivory Coast are established."
    },
    {
        "Date": "1967-1-23",
        "Details": "Milton Keynes (England) is founded as a new town by Order in Council, with a planning brief to become a city of 250,000 people. Its initial designated area enclosed three existing towns and twenty one villages. The area to be developed was largely farmland, with evidence of continuous settlement dating back to the Bronze Age."
    },
    {
        "Date": "1973-1-23",
        "Details": "United States President Richard Nixon announces that a peace accord has been reached in Vietnam."
    },
    {
        "Date": "1986-1-23",
        "Details": "The Rock and Roll Hall of Fame inducts its first members: Little Richard, Chuck Berry, James Brown, Ray Charles, Sam Cooke, Fats Domino, The Everly Brothers, Buddy Holly, Jerry Lee Lewis and Elvis Presley."
    },
    {
        "Date": "1997-1-23",
        "Details": "Madeleine Albright becomes the first woman to serve as United States Secretary of State."
    },
    {
        "Date": "1998-1-23",
        "Details": "Netscape announced Mozilla, with the intention to release Communicator code as open source."
    },
    {
        "Date": "2001-1-23",
        "Details": "Five people attempt to set themselves on fire in Beijing's Tiananmen Square, an act that many people later claim is staged by the Communist Party of China to frame Falun Gong and thus escalate their persecution."
    },
    {
        "Date": "2002-1-23",
        "Details": "U.S. journalist Daniel Pearl is kidnapped in Karachi, Pakistan and subsequently murdered."
    },
    {
        "Date": "2003-1-23",
        "Details": "A very weak signal from Pioneer 10 is detected for the last time, but no usable data can be extracted."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Roman Emperor Caligula, known for his eccentricity and sadistic despotism, is assassinated by his disgruntled Praetorian Guards. The Guard then proclaims Caligula's uncle Claudius as Emperor"
    },
    {
        "Date": "1438-1-24",
        "Details": "The Council of Basel suspends Pope Eugene IV."
    },
    {
        "Date": "1458-1-24",
        "Details": "Matthias Corvinus becomes king of Hungary."
    },
    {
        "Date": "1624-1-24",
        "Details": "Afonso Mendes, appointed by Pope Gregory XV as Prelate of Ethiopia, arrives at Massawa from Goa."
    },
    {
        "Date": "1679-1-24",
        "Details": "King Charles II of England dissolves the Cavalier Parliament."
    },
    {
        "Date": "1739-1-24",
        "Details": "Peshva warrior Chimnaji Appa defeats Portuguese forces and captures Tarapur Fort, India."
    },
    {
        "Date": "1742-1-24",
        "Details": "Charles VII Albert becomes Holy Roman Emperor."
    },
    {
        "Date": "1758-1-24",
        "Details": "During the Seven Years' War the leading burghers of Königsberg submit to Elizabeth of Russia, thus forming Russian Prussia (until 1763)"
    },
    {
        "Date": "1817-1-24",
        "Details": "Crossing of the Andes: Many soldiers of Juan Gregorio de las Heras are captured during the Action of Picheuta."
    },
    {
        "Date": "1835-1-24",
        "Details": "Slaves in Salvador da Bahia, Brazil, stage a revolt, which is instrumental in ending slavery there 50 years later."
    },
    {
        "Date": "1848-1-24",
        "Details": "California Gold Rush: James W. Marshall finds gold at Sutter's Mill near Sacramento."
    },
    {
        "Date": "1857-1-24",
        "Details": "The University of Calcutta is formally founded as the first fully fledged university in South Asia."
    },
    {
        "Date": "1859-1-24",
        "Details": "The United Principalities of Moldavia and Wallachia (later named Romania) formed as a personal union under the rule of Domnitor Alexandru Ioan Cuza."
    },
    {
        "Date": "1862-1-24",
        "Details": "Bucharest is proclaimed the capital of Romania."
    },
    {
        "Date": "1900-1-24",
        "Details": "Second Boer War: Boers stop a British attempt to break the Siege of Ladysmith in the Battle of Spion Kop."
    },
    {
        "Date": "1908-1-24",
        "Details": "The first Boy Scout troop is organized in England by Robert Baden-Powell."
    },
    {
        "Date": "1915-1-24",
        "Details": "World War One: British Grand Fleet battle cruisers under Vice-Admiral Sir David Beatty engage Rear-Admiral Franz von Hipper's battle cruisers in the Battle of Dogger Bank."
    },
    {
        "Date": "1916-1-24",
        "Details": "In Brushaber v. Union Pacific Railroad Co., the Supreme Court of the United States declares the federal income tax constitutional."
    },
    {
        "Date": "1918-1-24",
        "Details": "The Gregorian calendar is introduced in Russia by decree of the Council of People's Commissars effective February 14(NS)"
    },
    {
        "Date": "1933-1-24",
        "Details": "The 20th Amendment to the United States Constitution is ratified, changing the beginning and end of terms for all elected federal offices."
    },
    {
        "Date": "1939-1-24",
        "Details": "The deadliest earthquake in Chilean history strikes Chillán, killing approximately 28,000 people."
    },
    {
        "Date": "1942-1-24",
        "Details": "World War II: The Allies bombard Bangkok, leading Thailand, then under Japanese control, to declare war against the United States and United Kingdom."
    },
    {
        "Date": "1943-1-24",
        "Details": "World War II: Franklin D. Roosevelt and Winston Churchill conclude a conference in Casablanca."
    },
    {
        "Date": "1946-1-24",
        "Details": "The United Nations General Assembly passes its first resolution to establish the United Nations Atomic Energy Commission."
    },
    {
        "Date": "1960-1-24",
        "Details": "Algerian War: Some units of European volunteers in Algiers stage an insurrection known as the \"barricades week\", during which they seize government buildings and clash with local police."
    },
    {
        "Date": "1961-1-24",
        "Details": "Goldsboro B-52 crash: A bomber carrying two H-bombs breaks up in mid-air over North Carolina. The uranium core of one weapon remains lost."
    },
    {
        "Date": "1968-1-24",
        "Details": "Vietnam War: The 1st Australian Task Force launches Operation Coburg against the North Vietnamese Army and Viet Cong during wider fighting around Long Bình and Biên Hòa"
    },
    {
        "Date": "1972-1-24",
        "Details": "Japanese Sgt. Shoichi Yokoi is found hiding in a Guam jungle, where he had been since the end of World War II."
    },
    {
        "Date": "1977-1-24",
        "Details": "Atocha massacre occurs in Madrid during the Spanish transition to democracy."
    },
    {
        "Date": "1978-1-24",
        "Details": "Soviet satellite Kosmos 954, with a nuclear reactor on board, burns up in Earth's atmosphere, scattering radioactive debris over Canada's Northwest Territories. Only 1% is recovered."
    },
    {
        "Date": "1984-1-24",
        "Details": "Apple Computer places the Macintosh personal computer on sale in the United States."
    },
    {
        "Date": "1990-1-24",
        "Details": "Japan launches Hiten, the country's first lunar probe, the first robotic lunar probe since the Soviet Union's Luna 24 in 1976, and the first lunar probe launched by a country other than Soviet Union or the United States."
    },
    {
        "Date": "2003-1-24",
        "Details": "The United States Department of Homeland Security officially begins operation."
    },
    {
        "Date": "2009-1-24",
        "Details": "Cyclone Klaus makes landfall near Bordeaux, France, causing 26 deaths as well as extensive disruptions to public transport and power supplies."
    },
    {
        "Date": "2011-1-24",
        "Details": "At least 35 die and 180 are injured in a bombing at Moscow's Domodedovo Airport."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "After a night of negotiation, Claudius is accepted as Roman Emperor by the Senate."
    },
    {
        "Date": "750-1-25",
        "Details": "In the Battle of the Zab, the Abbasid rebels defeat the Umayyad Caliphate, leading to overthrow of the dynasty."
    },
    {
        "Date": "1348-1-25",
        "Details": "A strong earthquake strikes the South Alpine region of Friuli in modern Italy, causing considerable damage to buildings as far away as Rome."
    },
    {
        "Date": "1494-1-25",
        "Details": "Alfonso II becomes King of Naples."
    },
    {
        "Date": "1515-1-25",
        "Details": "Coronation of Francis I of France."
    },
    {
        "Date": "1533-1-25",
        "Details": "Henry VIII of England secretly marries his second wife Anne Boleyn."
    },
    {
        "Date": "1554-1-25",
        "Details": "Founding of São Paulo city, Brazil."
    },
    {
        "Date": "1573-1-25",
        "Details": "Battle of Mikatagahara: In Japan, Takeda Shingen defeats Tokugawa Ieyasu."
    },
    {
        "Date": "1575-1-25",
        "Details": "Luanda, the capital of Angola, is founded by the Portuguese navigator Paulo Dias de Novais."
    },
    {
        "Date": "1704-1-25",
        "Details": "The Battle of Ayubale results in the destruction of most of the Spanish missions in Florida."
    },
    {
        "Date": "1755-1-25",
        "Details": "Moscow University is established on Tatiana Day."
    },
    {
        "Date": "1765-1-25",
        "Details": "Port Egmont, the first British settlement in the Falkland Islands at the southern tip of South America, is founded."
    },
    {
        "Date": "1787-1-25",
        "Details": "Shays's Rebellion: The rebellion's largest confrontation, outside the Springfield Armory, results in the killing of four rebels and the wounding of twenty."
    },
    {
        "Date": "1791-1-25",
        "Details": "The British Parliament passes the Constitutional Act of 1791 and splits the old Province of Quebec into Upper Canada and Lower Canada."
    },
    {
        "Date": "1792-1-25",
        "Details": "The London Corresponding Society is founded."
    },
    {
        "Date": "1858-1-25",
        "Details": "The Wedding March by Felix Mendelssohn is played at the marriage of Queen Victoria's daughter, Victoria, and Friedrich of Prussia, and becomes a popular wedding processional."
    },
    {
        "Date": "1879-1-25",
        "Details": "The Bulgarian National Bank is founded."
    },
    {
        "Date": "1881-1-25",
        "Details": "Thomas Edison and Alexander Graham Bell form the Oriental Telephone Company."
    },
    {
        "Date": "1890-1-25",
        "Details": "Nellie Bly completes her round-the-world journey in 72 days."
    },
    {
        "Date": "1909-1-25",
        "Details": "Richard Strauss's opera Elektra receives its debut performance at the Dresden State Opera."
    },
    {
        "Date": "1915-1-25",
        "Details": "Alexander Graham Bell inaugurates U.S. transcontinental telephone service, speaking from New York to Thomas Watson in San Francisco."
    },
    {
        "Date": "1918-1-25",
        "Details": "Ukraine declares independence from Bolshevik Russia."
    },
    {
        "Date": "1924-1-25",
        "Details": "The 1924 Winter Olympics opens in Chamonix, in the French Alps, inaugurating the Winter Olympic Games."
    },
    {
        "Date": "1932-1-25",
        "Details": "Second Sino-Japanese War: The Chinese National Revolutionary Army begins its defense of Harbin."
    },
    {
        "Date": "1937-1-25",
        "Details": "The Guiding Light debuts on NBC radio from Chicago. In 1952 it moves to CBS television, where it remains until September 18, 2009."
    },
    {
        "Date": "1941-1-25",
        "Details": "Pope Pius XII elevates the Apostolic Vicariate of the Hawaiian Islands to the dignity of a diocese. It becomes the Roman Catholic Diocese of Honolulu."
    },
    {
        "Date": "1942-1-25",
        "Details": "World War II: Thailand declares war on the United States and United Kingdom."
    },
    {
        "Date": "1944-1-25",
        "Details": "Florence Li Tim-Oi is ordained in China, becoming the first woman Anglican priest."
    },
    {
        "Date": "1945-1-25",
        "Details": "World War II: The Battle of the Bulge ends."
    },
    {
        "Date": "1946-1-25",
        "Details": "The United Mine Workers rejoins the American Federation of Labor."
    },
    {
        "Date": "1947-1-25",
        "Details": "Thomas Goldsmith Jr. files a patent for a \"Cathode Ray Tube Amusement Device\", the first ever electronic game."
    },
    {
        "Date": "1949-1-25",
        "Details": "The first Emmy Awards are presented; the venue is the Hollywood Athletic Club."
    },
    {
        "Date": "1955-1-25",
        "Details": "The Soviet Union ends the state of war with Germany."
    },
    {
        "Date": "1960-1-25",
        "Details": "The National Association of Broadcasters reacts to the \"payola\" scandal by threatening fines for any disc jockeys who accept money for playing particular records."
    },
    {
        "Date": "1961-1-25",
        "Details": "In Washington, D.C., President John F. Kennedy delivers the first live presidential television news conference."
    },
    {
        "Date": "1964-1-25",
        "Details": "Blue Ribbon Sports is founded by University of Oregon track and field athletes, which would later become Nike."
    },
    {
        "Date": "1969-1-25",
        "Details": "Brazilian Army captain Carlos Lamarca deserts in order to fight against the military dictatorship, taking with him ten machine guns and 63 rifles."
    },
    {
        "Date": "1971-1-25",
        "Details": "Charles Manson and three female \"Family\" members are found guilty of the 1969 Tate-LaBianca murders."
    },
    {
        "Date": "1971-1-25",
        "Details": "Idi Amin leads a coup deposing Milton Obote and becomes Uganda's president."
    },
    {
        "Date": "1979-1-25",
        "Details": "Pope John Paul II starts his first official papal visits outside Italy to The Bahamas, Dominican Republic and Mexico."
    },
    {
        "Date": "1980-1-25",
        "Details": "Mother Teresa is honored with India's highest civilian award, the Bharat Ratna"
    },
    {
        "Date": "1986-1-25",
        "Details": "The National Resistance Movement topples the government of Tito Okello in Uganda."
    },
    {
        "Date": "1993-1-25",
        "Details": "Five people are shot outside the CIA Headquarters in Langley, Virginia. Two are killed and three wounded."
    },
    {
        "Date": "1995-1-25",
        "Details": "The Norwegian rocket incident: Russia almost launches a nuclear attack after it mistakes Black Brant XII, a Norwegian research rocket, for a US Trident missile."
    },
    {
        "Date": "1996-1-25",
        "Details": "Billy Bailey becomes the last person to be hanged in the U.S.A."
    },
    {
        "Date": "1998-1-25",
        "Details": "During a historic visit to Cuba, Pope John Paul II demands political reforms and the release of political prisoners while condemning US attempts to isolate the country."
    },
    {
        "Date": "1998-1-25",
        "Details": "A suicide attack by the Liberation Tigers of Tamil Eelam on Sri Lanka's Temple of the Tooth kills eight and injures 25 others."
    },
    {
        "Date": "1999-1-25",
        "Details": "A 6.0 Richter scale earthquake hits western Colombia killing at least 1,000."
    },
    {
        "Date": "2003-1-25",
        "Details": "Invasion of Iraq: A group of people leave London, England, for Baghdad, Iraq, to serve as human shields, intending to prevent the U.S.-led coalition troops from bombing certain locations."
    },
    {
        "Date": "2005-1-25",
        "Details": "A stampede at the Mandhradevi temple in Maharashtra, India kills at least 258."
    },
    {
        "Date": "2006-1-25",
        "Details": "Mexican professional wrestler Juana Barraza is arrested in connection with the serial killing of at least ten elderly women."
    },
    {
        "Date": "2011-1-25",
        "Details": "The first wave of the Egyptian revolution begins throughout the country, marked by street demonstrations, rallies, acts of civil disobedience, riots, labour strikes, and violent clashes."
    },
    {
        "Date": "2013-1-25",
        "Details": "At least 50 people are killed and 120 people are injured in a prison riot in Barquisimeto, Venezuela."
    },
    {
        "Date": "2015-1-25",
        "Details": "A clash in Mamasapano, Maguindanao in the Philippines killing 44 members of Special Action Force (SAF), at least 18 from the Moro Islamic Liberation Front and five from the Bangsamoro Islamic Freedom Fighters."
    }
],
[
    {
        "Date": "1500-1-26",
        "Details": "Vicente Yáñez Pinzón becomes the first European to set foot on Brazil."
    },
    {
        "Date": "1531-1-26",
        "Details": "The Lisbon earthquake kills about thirty thousand people."
    },
    {
        "Date": "1564-1-26",
        "Details": "The Council of Trent establishes an official distinction between Roman Catholicism and Protestantism."
    },
    {
        "Date": "1564-1-26",
        "Details": "The Grand Duchy of Lithuania defeats the Tsardom of Russia in the Battle of Ula during the Livonian War."
    },
    {
        "Date": "1565-1-26",
        "Details": "Battle of Talikota, fought between the Vijayanagara Empire and the Deccan sultanates, leads to the subjugation, and eventual destruction of the last Hindu kingdom in India, and the consolidation of Islamic rule over much of the Indian subcontinent."
    },
    {
        "Date": "1699-1-26",
        "Details": "For the first time, the Ottoman Empire permanently cedes territory to the Christian powers."
    },
    {
        "Date": "1700-1-26",
        "Details": "The Cascadia earthquake takes place off the west coast of North America, as evidenced by Japanese records."
    },
    {
        "Date": "1736-1-26",
        "Details": "Stanislaus I of Poland abdicates his throne."
    },
    {
        "Date": "1788-1-26",
        "Details": "The British First Fleet, led by Arthur Phillip, sails into Port Jackson (Sydney Harbour) to establish Sydney, the first permanent European settlement on the continent. Commemorated as Australia Day."
    },
    {
        "Date": "1808-1-26",
        "Details": "The Rum Rebellion is the only successful (albeit short-lived) armed takeover of the government in Australia."
    },
    {
        "Date": "1837-1-26",
        "Details": "Michigan is admitted as the 26th U.S. state."
    },
    {
        "Date": "1838-1-26",
        "Details": "Tennessee enacts the first prohibition law in the United States"
    },
    {
        "Date": "1841-1-26",
        "Details": "James Bremer takes formal possession of Hong Kong Island at what is now Possession Point, establishing British Hong Kong."
    },
    {
        "Date": "1855-1-26",
        "Details": "Point No Point Treaty is signed in Washington Territory."
    },
    {
        "Date": "1856-1-26",
        "Details": "First Battle of Seattle. Marines from the USS Decatur drive off American Indian attackers after all day battle with settlers."
    },
    {
        "Date": "1861-1-26",
        "Details": "American Civil War: The state of Louisiana secedes from the Union."
    },
    {
        "Date": "1863-1-26",
        "Details": "American Civil War: General Ambrose Burnside is relieved of command of the Army of the Potomac after the disastrous Fredericksburg campaign. He is replaced by Joseph Hooker."
    },
    {
        "Date": "1863-1-26",
        "Details": "American Civil War: Governor of Massachusetts John Albion Andrew receives permission from the Secretary of War to raise a militia organization for men of African descent."
    },
    {
        "Date": "1870-1-26",
        "Details": "Reconstruction Era: Virginia rejoins the Union."
    },
    {
        "Date": "1885-1-26",
        "Details": "Troops loyal to The Mahdi conquer Khartoum, killing the Governor-General Charles George Gordon."
    },
    {
        "Date": "1905-1-26",
        "Details": "The world's largest diamond ever, the Cullinan weighing 3,106.75 carats (0.621350 kg), is found at the Premier Mine near Pretoria in South Africa."
    },
    {
        "Date": "1911-1-26",
        "Details": "Glenn H. Curtiss flies the first successful American seaplane."
    },
    {
        "Date": "1915-1-26",
        "Details": "The Rocky Mountain National Park is established by an act of the U.S. Congress."
    },
    {
        "Date": "1918-1-26",
        "Details": "Finnish Civil War: A group of Red Guards hangs a red lantern atop the tower of Helsinki Workers' Hall to symbolically mark the start of the war."
    },
    {
        "Date": "1920-1-26",
        "Details": "Former Ford Motor Company executive Henry Leland launches the Lincoln Motor Company which he later sold to his former employer."
    },
    {
        "Date": "1926-1-26",
        "Details": "The first demonstration of the television by John Logie Baird."
    },
    {
        "Date": "1930-1-26",
        "Details": "The Indian National Congress declares 26 January as Independence Day or as the day for Poorna Swaraj (\"Complete Independence\") which occurred 17 years later."
    },
    {
        "Date": "1934-1-26",
        "Details": "The Apollo Theater reopens in Harlem, New York City."
    },
    {
        "Date": "1934-1-26",
        "Details": "German-Polish Non-Aggression Pact is signed."
    },
    {
        "Date": "1939-1-26",
        "Details": "Spanish Civil War: Catalonia Offensive: Troops loyal to nationalist General Francisco Franco and aided by Italy take Barcelona."
    },
    {
        "Date": "1942-1-26",
        "Details": "World War II: The first United States forces arrive in Europe landing in Northern Ireland."
    },
    {
        "Date": "1945-1-26",
        "Details": "World War II: The Red Army begins encircling the German Fourth Army near Heiligenbeil in East Prussia, which will end in destruction of the 4th Army two months later."
    },
    {
        "Date": "1945-1-26",
        "Details": "World War II: Audie Murphy displays valor and bravery in action for which he will later be awarded the Medal of Honor."
    },
    {
        "Date": "1949-1-26",
        "Details": "The Hale telescope at Palomar Observatory sees first light under the direction of Edwin Hubble, becoming the largest aperture optical telescope (until BTA-6 is built in 1976)."
    },
    {
        "Date": "1950-1-26",
        "Details": "The Constitution of India comes into force, forming a republic. Rajendra Prasad is sworn in as its first President of India. Observed as Republic Day in India."
    },
    {
        "Date": "1952-1-26",
        "Details": "Black Saturday in Egypt: rioters burn Cairo's central business district, targeting British and upper-class Egyptian businesses."
    },
    {
        "Date": "1956-1-26",
        "Details": "Soviet Union cedes Porkkala back to Finland."
    },
    {
        "Date": "1961-1-26",
        "Details": "John F. Kennedy appoints Janet G. Travell to be the first woman Physician to the President."
    },
    {
        "Date": "1962-1-26",
        "Details": "Ranger 3 is launched to study the Moon. The space probe later misses the moon by 22,000 miles (35,400 km)."
    },
    {
        "Date": "1965-1-26",
        "Details": "Hindi becomes the official language of India."
    },
    {
        "Date": "1980-1-26",
        "Details": "Israel and Egypt establish diplomatic relations."
    },
    {
        "Date": "1986-1-26",
        "Details": "The Ugandan government of Tito Okello is overthrown by the National Resistance Army, led by Yoweri Museveni."
    },
    {
        "Date": "1991-1-26",
        "Details": "Mohamed Siad Barre is removed from power in Somalia, ending centralized government, and is succeeded by Ali Mahdi."
    },
    {
        "Date": "1992-1-26",
        "Details": "Boris Yeltsin announces that Russia will stop targeting United States cities with nuclear weapons."
    },
    {
        "Date": "1998-1-26",
        "Details": "Lewinsky scandal: On American television, U.S. President Bill Clinton denies having had \"sexual relations\" with former White House intern Monica Lewinsky."
    },
    {
        "Date": "2001-1-26",
        "Details": "The 7.7 Mw Gujarat earthquake shakes Western India with a maximum Mercalli intensity of X (Extreme), leaving 13,805-20,023 dead and about 166,800 injured."
    },
    {
        "Date": "2009-1-26",
        "Details": "Rioting breaks out in Antananarivo, Madagascar, sparking a political crisis that will result in the replacement of President Marc Ravalomanana with Andry Rajoelina."
    },
    {
        "Date": "2015-1-26",
        "Details": "An aircraft crashes at Los Llanos Air Base in Albacete, Spain, killing 11 people and injuring 21 others."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "Trajan succeeded his adoptive father Nerva as Roman emperor; under his rule the Roman Empire would reach its maximum extent."
    },
    {
        "Date": "945-1-27",
        "Details": "The co-emperors Stephen and Constantine are overthrown. Constantine VII becomes sole emperor of the Byzantine Empire."
    },
    {
        "Date": "1142-1-27",
        "Details": "Song dynasty General Yue Fei is executed."
    },
    {
        "Date": "1186-1-27",
        "Details": "Henry VI, the son and heir of the Holy Roman Emperor Frederick I, marries Constance of Sicily."
    },
    {
        "Date": "1302-1-27",
        "Details": "Dante Alighieri is exiled from Florence."
    },
    {
        "Date": "1343-1-27",
        "Details": "Pope Clement VI issues the papal bull Unigenitus to justify the power of the pope and the use of indulgences. Nearly 200 years later, Martin Luther would protest this."
    },
    {
        "Date": "1593-1-27",
        "Details": "The Vatican opens the seven-year trial of scholar Giordano Bruno."
    },
    {
        "Date": "1606-1-27",
        "Details": "Gunpowder Plot: The trial of Guy Fawkes and other conspirators begins, ending with their execution on January 31."
    },
    {
        "Date": "1695-1-27",
        "Details": "Mustafa II becomes the Ottoman sultan and Caliph of Islam in Istanbul on the death of Ahmed II. Mustafa rules until his abdication in 1703."
    },
    {
        "Date": "1776-1-27",
        "Details": "American Revolutionary War: Henry Knox's \"noble train of artillery\" arrives in Cambridge, Massachusetts."
    },
    {
        "Date": "1785-1-27",
        "Details": "The University of Georgia is founded, the first public university in the United States."
    },
    {
        "Date": "1825-1-27",
        "Details": "The U.S. Congress approves Indian Territory (in what is present-day Oklahoma), clearing the way for forced relocation of the Eastern Indians on the \"Trail of Tears\"."
    },
    {
        "Date": "1868-1-27",
        "Details": "Boshin War: The Battle of Toba-Fushimi between forces of the Tokugawa shogunate and pro-Imperial factions begins, which will end in defeat for the shogunate, and is a pivotal point in the Meiji Restoration."
    },
    {
        "Date": "1869-1-27",
        "Details": "Boshin War: Tokugawa rebels establish the Ezo Republic in Hokkaidō."
    },
    {
        "Date": "1880-1-27",
        "Details": "Thomas Edison receives the patent on the incandescent lamp."
    },
    {
        "Date": "1927-1-27",
        "Details": "Ibn Saud takes the title of King of Nejd."
    },
    {
        "Date": "1939-1-27",
        "Details": "First flight of the Lockheed P-38 Lightning."
    },
    {
        "Date": "1943-1-27",
        "Details": "World War II: The Eighth Air Force sorties ninety-one B-17s and B-24s to attack the U-boat construction yards at Wilhelmshaven, Germany. This was the first American bombing attack on Germany."
    },
    {
        "Date": "1944-1-27",
        "Details": "World War II: The 900-day Siege of Leningrad is lifted."
    },
    {
        "Date": "1945-1-27",
        "Details": "World War II: The Red Army liberates the remaining inmates of Auschwitz-Birkenau."
    },
    {
        "Date": "1951-1-27",
        "Details": "Nuclear testing at the Nevada Test Site begins with Operation Ranger."
    },
    {
        "Date": "1961-1-27",
        "Details": "The Soviet submarine S-80 sinks when its snorkel malfunctions, flooding the boat."
    },
    {
        "Date": "1967-1-27",
        "Details": "Astronauts Gus Grissom, Edward White and Roger Chaffee are killed in a fire during a test of their Apollo 1 spacecraft at the Kennedy Space Center, Florida."
    },
    {
        "Date": "1967-1-27",
        "Details": "United States, United Kingdom, and Soviet Union sign the Outer Space Treaty in Washington, D.C., banning deployment of nuclear weapons in space, and limiting use of the Moon and other celestial bodies to peaceful purposes."
    },
    {
        "Date": "1973-1-27",
        "Details": "The Paris Peace Accords officially end the Vietnam War. Colonel William Nolde is killed in action becoming the conflict's last recorded American combat casualty."
    },
    {
        "Date": "1980-1-27",
        "Details": "Through cooperation between the U.S. and Canadian governments, six American diplomats secretly escape hostilities in Iran in the culmination of the Canadian Caper."
    },
    {
        "Date": "1983-1-27",
        "Details": "The pilot shaft of the Seikan Tunnel, the world's longest sub-aqueous tunnel (53.85 km) between the Japanese islands of Honshū and Hokkaidō, breaks through."
    },
    {
        "Date": "1996-1-27",
        "Details": "In a military coup Colonel Ibrahim Baré Maïnassara deposes the first democratically elected president of Niger, Mahamane Ousmane."
    },
    {
        "Date": "1996-1-27",
        "Details": "Germany first observes International Holocaust Remembrance Day."
    },
    {
        "Date": "2002-1-27",
        "Details": "An explosion at a military storage facility in Lagos, Nigeria kills at least 1,100 people and displaces over 20,000 others."
    },
    {
        "Date": "2003-1-27",
        "Details": "The first selections for the National Recording Registry are announced by the Library of Congress."
    },
    {
        "Date": "2010-1-27",
        "Details": "The 2009 Honduran constitutional crisis ends when Porfirio Lobo Sosa becomes the new President of Honduras."
    },
    {
        "Date": "2011-1-27",
        "Details": "Arab Spring: The Yemeni Revolution begins as over 16,000 protestors demonstrate in Sana'a."
    },
    {
        "Date": "2013-1-27",
        "Details": "Two hundred forty-two people die in a nightclub fire in the Brazilian city of Santa Maria, Rio Grande do Sul."
    }
],
[
    {
        "Date": "661-1-28",
        "Details": "The Rashidun Caliphate is effectively ended with the assassination of Ali, the last caliph."
    },
    {
        "Date": "814-1-28",
        "Details": "Charlemagne dies of pleurisy in Aachen as the first Holy Roman Emperor. He is succeeded by his son Louis the Pious as king of the Frankish Empire."
    },
    {
        "Date": "946-1-28",
        "Details": "Caliph Al-Mustakfi is blinded and deposed by Emir Mu'izz al-Dawla, ruler of the Buyid Empire. He is succeeded by Al-Muti as caliph of the Abbasid Caliphate."
    },
    {
        "Date": "1069-1-28",
        "Details": "Robert de Comines, the Earl of Northumbria, is killed while attempting to subdue rebels in Durham, England. This leads to the Harrying of the North by William the Conqueror."
    },
    {
        "Date": "1077-1-28",
        "Details": "Walk to Canossa: The excommunication of Henry IV, Holy Roman Emperor is lifted."
    },
    {
        "Date": "1393-1-28",
        "Details": "King Charles VI of France is nearly killed when several dancers' costumes catch fire during a masquerade ball."
    },
    {
        "Date": "1521-1-28",
        "Details": "The Diet of Worms begins, lasting until May 25."
    },
    {
        "Date": "1547-1-28",
        "Details": "Henry VIII dies. His nine-year-old son, Edward VI, becomes king."
    },
    {
        "Date": "1573-1-28",
        "Details": "Articles of the Warsaw Confederation are signed, sanctioning freedom of religion in Poland."
    },
    {
        "Date": "1624-1-28",
        "Details": "Sir Thomas Warner founds the first British colony in the Caribbean, on the island of Saint Kitts."
    },
    {
        "Date": "1724-1-28",
        "Details": "The Russian Academy of Sciences is founded in St. Petersburg by Peter the Great, and implemented by Senate decree. It is called the St. Petersburg Academy of Sciences until 1917."
    },
    {
        "Date": "1754-1-28",
        "Details": "Sir Horace Walpole coins the word serendipity in a letter to a friend."
    },
    {
        "Date": "1813-1-28",
        "Details": "Jane Austen's Pride and Prejudice is first published in the United Kingdom."
    },
    {
        "Date": "1820-1-28",
        "Details": "A Russian expedition led by Fabian Gottlieb von Bellingshausen and Mikhail Petrovich Lazarev discovers the Antarctic continent, approaching the Antarctic coast."
    },
    {
        "Date": "1846-1-28",
        "Details": "The Battle of Aliwal, India, is won by British troops commanded by Sir Harry Smith."
    },
    {
        "Date": "1851-1-28",
        "Details": "Northwestern University becomes the first chartered university in Illinois."
    },
    {
        "Date": "1855-1-28",
        "Details": "A locomotive on the Panama Canal Railway runs from the Atlantic Ocean to the Pacific Ocean for the first time."
    },
    {
        "Date": "1871-1-28",
        "Details": "Franco-Prussian War: The Siege of Paris ends in French defeat and an armistice."
    },
    {
        "Date": "1878-1-28",
        "Details": "Yale Daily News becomes the first daily college newspaper in the United States."
    },
    {
        "Date": "1896-1-28",
        "Details": "Walter Arnold of East Peckham, Kent, becomes the first person to be convicted of speeding. He was fined one shilling, plus costs, for speeding at 8 mph (13 km/h), thereby exceeding the contemporary speed limit of 2 mph (3.2 km/h)."
    },
    {
        "Date": "1902-1-28",
        "Details": "The Carnegie Institution of Washington is founded in Washington, D.C. with a $10 million gift from Andrew Carnegie."
    },
    {
        "Date": "1908-1-28",
        "Details": "Members of the Portuguese Republican Party fail in their attempted coup d'état against the administrative dictatorship of Prime Minister João Franco."
    },
    {
        "Date": "1909-1-28",
        "Details": "United States troops leave Cuba with the exception of Guantanamo Bay Naval Base after being there since the Spanish-American War."
    },
    {
        "Date": "1915-1-28",
        "Details": "An act of the U.S. Congress creates the United States Coast Guard as a branch of the United States Armed Forces."
    },
    {
        "Date": "1918-1-28",
        "Details": "Finnish Civil War: The Red Guard rebels seize control of the capital, Helsinki; members of the Senate of Finland go underground."
    },
    {
        "Date": "1920-1-28",
        "Details": "Foundation of the Spanish Legion."
    },
    {
        "Date": "1922-1-28",
        "Details": "Knickerbocker Storm, Washington D.C.'s biggest snowfall, causes the city's greatest loss of life when the roof of the Knickerbocker Theatre collapses."
    },
    {
        "Date": "1932-1-28",
        "Details": "Japanese forces attack Shanghai."
    },
    {
        "Date": "1933-1-28",
        "Details": "The name Pakistan is coined by Choudhry Rahmat Ali Khan and is accepted by Indian Muslims who then thereby adopted it further for the Pakistan Movement seeking independence."
    },
    {
        "Date": "1935-1-28",
        "Details": "Iceland becomes the first Western country to legalize therapeutic abortion."
    },
    {
        "Date": "1938-1-28",
        "Details": "The World Land Speed Record on a public road is broken by Rudolf Caracciola in the Mercedes-Benz W195 at a speed of 432.7 kilometres per hour (268.9 mph)."
    },
    {
        "Date": "1941-1-28",
        "Details": "Franco-Thai War: Final air battle of the conflict. A Japanese-mediated armistice goes into effect later in the day."
    },
    {
        "Date": "1945-1-28",
        "Details": "World War II: Supplies begin to reach the Republic of China over the newly reopened Burma Road."
    },
    {
        "Date": "1956-1-28",
        "Details": "Elvis Presley makes his first American television appearance."
    },
    {
        "Date": "1958-1-28",
        "Details": "The Lego company patents the design of its Lego bricks, still compatible with bricks produced today."
    },
    {
        "Date": "1960-1-28",
        "Details": "The National Football League announced expansion teams for Dallas to start in the 1960 NFL season and Minneapolis-St. Paul for 1961 NFL season."
    },
    {
        "Date": "1964-1-28",
        "Details": "An unarmed United States Air Force T-39 Sabreliner on a training mission is shot down over Erfurt, East Germany, by a Soviet MiG-19."
    },
    {
        "Date": "1965-1-28",
        "Details": "The current design of the Flag of Canada is chosen by an act of Parliament."
    },
    {
        "Date": "1977-1-28",
        "Details": "The first day of the Great Lakes Blizzard of 1977 which dumps 10 feet (3.0 m) of snow in one day in Upstate New York, with Buffalo, Syracuse, Watertown, and surrounding areas are most affected."
    },
    {
        "Date": "1980-1-28",
        "Details": "USCGC Blackthorn collides with the tanker Capricorn while leaving Tampa, Florida and capsizes, killing 23 Coast Guard crewmembers."
    },
    {
        "Date": "1981-1-28",
        "Details": "Ronald Reagan lifts remaining domestic petroleum price and allocation controls in the United States helping to end the 1979 energy crisis and begin the 1980s oil glut."
    },
    {
        "Date": "1982-1-28",
        "Details": "US Army general James L. Dozier is rescued by Italian anti-terrorism forces from captivity by the Red Brigades."
    },
    {
        "Date": "1984-1-28",
        "Details": "Tropical Storm Domoina makes landfall in southern Mozambique, eventually causing 214 deaths and some of the most severe flooding so far recorded in the region."
    },
    {
        "Date": "1985-1-28",
        "Details": "Supergroup USA for Africa (United Support of Artists for Africa) records the hit single We Are the World, to help raise funds for Ethiopian famine relief."
    },
    {
        "Date": "1986-1-28",
        "Details": "Space Shuttle program: STS-51-L mission: Space Shuttle Challenger explodes after liftoff, killing all seven astronauts on board."
    },
    {
        "Date": "1988-1-28",
        "Details": "In R v Morgentaler the Supreme Court of Canada strikes down all anti-abortion laws."
    },
    {
        "Date": "2002-1-28",
        "Details": "TAME Flight 120, a Boeing 727-100 crashes in the Andes mountains in southern Colombia, killing 92."
    },
    {
        "Date": "2006-1-28",
        "Details": "The roof of one of the buildings at the Katowice International Fair in Poland, collapses due to the weight of snow, killing 65 and injuring more than 170 others."
    }
],
[
    {
        "Date": "661-1-29",
        "Details": "The Rashidun Caliphate ends with the death of Ali, and the Imamah of the Shia going to the second Imam, Hassan ibn Ali"
    },
    {
        "Date": "757-1-29",
        "Details": "An Lushan, leader of a revolt against the Tang dynasty and emperor of Yan, is murdered by his own son, An Qingxu."
    },
    {
        "Date": "904-1-29",
        "Details": "Sergius III comes out of retirement to take over the papacy from the deposed antipope Christopher."
    },
    {
        "Date": "1258-1-29",
        "Details": "First Mongol invasion of Đại Việt: Đại Việt defeats the Mongols at the battle of Đông Bộ Đầu, forcing the Mongols to withdraw from the country."
    },
    {
        "Date": "1790-1-29",
        "Details": "The first boat specializing as a lifeboat is tested on the River Tyne."
    },
    {
        "Date": "1814-1-29",
        "Details": "War of the Sixth Coalition: France defeats Russia and Prussia in the Battle of Brienne."
    },
    {
        "Date": "1819-1-29",
        "Details": "Stamford Raffles lands on the island of Singapore."
    },
    {
        "Date": "1834-1-29",
        "Details": "US President Andrew Jackson orders first use of federal soldiers to suppress a labor dispute."
    },
    {
        "Date": "1845-1-29",
        "Details": "\"The Raven\" is published in The Evening Mirror in New York, the first publication with the name of the author, Edgar Allan Poe"
    },
    {
        "Date": "1850-1-29",
        "Details": "Henry Clay introduces the Compromise of 1850 to the U.S. Congress."
    },
    {
        "Date": "1856-1-29",
        "Details": "Queen Victoria issues a Warrant under the Royal sign-manual that establishes the Victoria Cross to recognise acts of valour by British military personnel during the Crimean War."
    },
    {
        "Date": "1861-1-29",
        "Details": "Kansas is admitted as the 34th U.S. state."
    },
    {
        "Date": "1863-1-29",
        "Details": "The Bear River Massacre: A detachment of California Volunteers led by Colonel Patrick Edward Connor engage the Shoshone at Bear River, Washington Territory, killing hundreds of men women and children."
    },
    {
        "Date": "1886-1-29",
        "Details": "Karl Benz patents the first successful gasoline-driven automobile."
    },
    {
        "Date": "1891-1-29",
        "Details": "Liliuokalani is proclaimed the last monarch and only queen regnant of the Kingdom of Hawaii."
    },
    {
        "Date": "1900-1-29",
        "Details": "The American League is organized in Philadelphia with eight founding teams."
    },
    {
        "Date": "1907-1-29",
        "Details": "Charles Curtis of Kansas becomes the first Native American U.S. Senator."
    },
    {
        "Date": "1916-1-29",
        "Details": "World War I: Paris is first bombed by German zeppelins."
    },
    {
        "Date": "1918-1-29",
        "Details": "Ukrainian-Soviet War: The Bolshevik Red Army, on its way to besiege Kiev, is met by a small group of military students at the Battle of Kruty."
    },
    {
        "Date": "1918-1-29",
        "Details": "Ukrainian-Soviet War: An armed uprising organized by the Bolsheviks in anticipation of the encroaching Red Army begins at the Kiev Arsenal, which will be put down six days later."
    },
    {
        "Date": "1936-1-29",
        "Details": "The first inductees into the Baseball Hall of Fame are announced."
    },
    {
        "Date": "1941-1-29",
        "Details": "Alexandros Koryzis becomes Prime Minister of Greece upon the sudden death of his predecessor, dictator Ioannis Metaxas."
    },
    {
        "Date": "1943-1-29",
        "Details": "The first day of the Battle of Rennell Island, U.S. cruiser Chicago is torpedoed and heavily damaged by Japanese bombers."
    },
    {
        "Date": "1944-1-29",
        "Details": "World War II: Approximately 38 people are killed and about a dozen injured when the Polish village of Koniuchy (present-day Kaniūkai, Lithuania) is attacked by Soviet partisan units."
    },
    {
        "Date": "1963-1-29",
        "Details": "The first inductees into the Pro Football Hall of Fame are announced."
    },
    {
        "Date": "1967-1-29",
        "Details": "The \"ultimate high\" of the hippie era, the Mantra-Rock Dance, takes place in San Francisco and features Janis Joplin, Grateful Dead, and Allen Ginsberg."
    },
    {
        "Date": "1989-1-29",
        "Details": "Hungary establishes diplomatic relations with South Korea, making it the first Eastern Bloc nation to do so."
    },
    {
        "Date": "1991-1-29",
        "Details": "Gulf War: The Battle of Khafji, the first major ground engagement of the war, as well as its deadliest, begins."
    },
    {
        "Date": "1996-1-29",
        "Details": "President Jacques Chirac announces a \"definitive end\" to French nuclear weapons testing."
    },
    {
        "Date": "2001-1-29",
        "Details": "Thousands of student protesters in Indonesia storm parliament and demand that President Abdurrahman Wahid resign due to alleged involvement in corruption scandals."
    },
    {
        "Date": "2002-1-29",
        "Details": "In his State of the Union address, President George W. Bush describes \"regimes that sponsor terror\" as an Axis of evil, in which he includes Iraq, Iran and North Korea."
    },
    {
        "Date": "2005-1-29",
        "Details": "The first direct commercial flights from mainland China (from Guangzhou) to Taiwan since 1949 arrived in Taipei. Shortly afterwards, a China Airlines flight lands in Beijing."
    },
    {
        "Date": "2009-1-29",
        "Details": "The Supreme Constitutional Court of Egypt rules that people who do not adhere to one of the three government-recognised religions, while not allowed to list any belief outside of those three, are still eligible to receive government identity documents."
    },
    {
        "Date": "2009-1-29",
        "Details": "Governor of Illinois Rod Blagojevich is removed from office following his conviction of several corruption charges, including the alleged solicitation of personal benefit in exchange for an appointment to the United States Senate as a replacement for then-U.S. president-elect Barack Obama."
    },
    {
        "Date": "2013-1-29",
        "Details": "SCAT Airlines Flight 760 crashes near the Kazakh city of Almaty, killing 21 people."
    },
    {
        "Date": "2017-1-29",
        "Details": "Quebec City mosque shooting Alexandre Bissonnette opens fire at mosque in Sainte-Foy, Quebec, killing six and wounding 19 others in a spree shooting."
    }
],
[
    {
        "Date": "Invalid Date",
        "Details": "The Second Temple of Jerusalem finishes construction."
    },
    {
        "Date": "1018-1-30",
        "Details": "Poland and the Holy Roman Empire conclude the Peace of Bautzen."
    },
    {
        "Date": "1607-1-30",
        "Details": "An estimated 200 square miles (51,800 ha) along the coasts of the Bristol Channel and Severn Estuary in England are destroyed by massive flooding, resulting in an estimated 2,000 deaths."
    },
    {
        "Date": "1648-1-30",
        "Details": "Eighty Years' War: The Treaty of Münster and Osnabrück is signed, ending the conflict between the Netherlands and Spain."
    },
    {
        "Date": "1649-1-30",
        "Details": "King Charles I of England is beheaded."
    },
    {
        "Date": "1661-1-30",
        "Details": "Oliver Cromwell, Lord Protector of the Commonwealth of England, is ritually executed more than two years after his death, on the 12th anniversary of the execution of the monarch he himself deposed."
    },
    {
        "Date": "1703-1-30",
        "Details": "The Forty-seven Ronin, under the command of Ōishi Kuranosuke, avenge the death of their master."
    },
    {
        "Date": "1789-1-30",
        "Details": "Tây Sơn forces emerge victorious against Qing armies and liberate the capital Thăng Long."
    },
    {
        "Date": "1806-1-30",
        "Details": "The original Lower Trenton Bridge (also called the Trenton Makes the World Takes Bridge), which spans the Delaware River between Morrisville, Pennsylvania and Trenton, New Jersey, is opened."
    },
    {
        "Date": "1820-1-30",
        "Details": "Edward Bransfield sights the Trinity Peninsula and claims the discovery of Antarctica."
    },
    {
        "Date": "1826-1-30",
        "Details": "The Menai Suspension Bridge, considered the world's first modern suspension bridge, connecting the Isle of Anglesey to the north West coast of Wales, is opened."
    },
    {
        "Date": "1835-1-30",
        "Details": "In the first assassination attempt against a President of the United States, Richard Lawrence attempts to shoot president Andrew Jackson, but fails and is subdued by a crowd, including several congressmen as well as Jackson himself."
    },
    {
        "Date": "1847-1-30",
        "Details": "Yerba Buena, California is renamed San Francisco, California."
    },
    {
        "Date": "1858-1-30",
        "Details": "The first Hallé concert is given in Manchester, England, marking the official founding of The Hallé orchestra as a full-time, professional orchestra."
    },
    {
        "Date": "1862-1-30",
        "Details": "The first American ironclad warship, the USS Monitor is launched."
    },
    {
        "Date": "1889-1-30",
        "Details": "Archduke Crown Prince Rudolf of Austria, heir to the Austro-Hungarian crown, is found dead with his mistress Baroness Mary Vetsera in the Mayerling."
    },
    {
        "Date": "1902-1-30",
        "Details": "The first Anglo-Japanese Alliance is signed in London."
    },
    {
        "Date": "1908-1-30",
        "Details": "Indian pacifist and leader Mohandas Karamchand Gandhi is released from prison by Jan C. Smuts after being tried and sentenced to two months in jail earlier in the month."
    },
    {
        "Date": "1911-1-30",
        "Details": "The destroyer USS Terry makes the first airplane rescue at sea saving the life of Douglas McCurdy ten miles from Havana, Cuba."
    },
    {
        "Date": "1911-1-30",
        "Details": "The Canadian Naval Service becomes the Royal Canadian Navy."
    },
    {
        "Date": "1916-1-30",
        "Details": "The McMahon-Hussein Correspondence between Hussein bin Ali, Sharif of Mecca and the British official Henry McMahon concerning the Arab revolt against the Ottoman Empire ends."
    },
    {
        "Date": "1925-1-30",
        "Details": "The Government of Turkey expels Patriarch Constantine VI from Istanbul."
    },
    {
        "Date": "1930-1-30",
        "Details": "The Politburo of the Soviet Union orders the extermination of the Kulaks."
    },
    {
        "Date": "1933-1-30",
        "Details": "Adolf Hitler is sworn in as Chancellor of Germany."
    },
    {
        "Date": "1942-1-30",
        "Details": "World War II: Battle of Ambon. Japanese forces invade the island of Ambon in the Dutch East Indies. Some 300 captured Allied troops are massacred at Laha airfield. Three-fourths of remaining POWs did not survive at the end of the war, including 250 men who were shipped to Hainan Island in South China Sea and never returned."
    },
    {
        "Date": "1943-1-30",
        "Details": "World War II: Second day of the Battle of Rennell Island. The USS Chicago is sunk and a U.S. destroyer is heavily damaged by Japanese torpedoes."
    },
    {
        "Date": "1944-1-30",
        "Details": "World War II: The Battle of Cisterna, part of Operation Shingle, begins in central Italy."
    },
    {
        "Date": "1945-1-30",
        "Details": "World War II: The Wilhelm Gustloff, overfilled with German refugees, sinks in the Baltic Sea after being torpedoed by a Soviet submarine, killing approximately 9,500 people."
    },
    {
        "Date": "1945-1-30",
        "Details": "World War II: Raid at Cabanatuan: One hundred twenty-six American Rangers and Filipino resistance fighters liberate over 500 Allied prisoners from the Japanese-controlled Cabanatuan POW camp."
    },
    {
        "Date": "1948-1-30",
        "Details": "Mahatma Gandhi is assassinated by Nathuram Godse, a Hindu extremist."
    },
    {
        "Date": "1956-1-30",
        "Details": "African-American civil rights leader Martin Luther King, Jr.'s home is bombed in retaliation for the Montgomery Bus Boycott."
    },
    {
        "Date": "1959-1-30",
        "Details": "MS Hans Hedtoft, said to be the safest ship afloat and \"unsinkable\" like the RMS Titanic, strikes an iceberg on her maiden voyage and sinks, killing all 95 aboard."
    },
    {
        "Date": "1960-1-30",
        "Details": "The African National Party is founded in Chad, through the merger of traditionalist parties."
    },
    {
        "Date": "1964-1-30",
        "Details": "In a bloodless coup, General Nguyễn Khánh overthrows General Dương Văn Minh's military junta in South Vietnam."
    },
    {
        "Date": "1968-1-30",
        "Details": "Vietnam War: Tet Offensive launch by forces of the Viet Cong and North Vietnamese Army against South Vietnam, the United States, and their allies."
    },
    {
        "Date": "1969-1-30",
        "Details": "The Beatles' last public performance, on the roof of Apple Records in London. The impromptu concert is broken up by the police."
    },
    {
        "Date": "1972-1-30",
        "Details": "The Troubles: Bloody Sunday: British paratroopers open fire on anti-internment marchers in Derry, Northern Ireland, killing 13 people; another person later dies of injuries sustained."
    },
    {
        "Date": "1975-1-30",
        "Details": "The Monitor National Marine Sanctuary is established as the first United States National Marine Sanctuary."
    },
    {
        "Date": "1979-1-30",
        "Details": "A Varig Boeing 707-323C freighter, flown by the same commander as Flight 820, disappears over the Pacific Ocean 30 minutes after taking off from Tokyo."
    },
    {
        "Date": "1982-1-30",
        "Details": "Richard Skrenta writes the first PC virus code, which is 400 lines long and disguised as an Apple boot program called \"Elk Cloner\"."
    },
    {
        "Date": "1989-1-30",
        "Details": "Closure of the American embassy in Kabul, Democratic Republic of Afghanistan."
    },
    {
        "Date": "1995-1-30",
        "Details": "Workers from the National Institutes of Health announce the success of clinical trials testing the first preventive treatment for sickle-cell disease."
    },
    {
        "Date": "2000-1-30",
        "Details": "Off the coast of Ivory Coast, Kenya Airways Flight 431 crashes into the Atlantic Ocean, killing 169."
    },
    {
        "Date": "2003-1-30",
        "Details": "The Kingdom of Belgium officially recognizes same-sex marriages."
    },
    {
        "Date": "2013-1-30",
        "Details": "Naro-1 becomes the first carrier rocket launched by South Korea."
    }
],
[
    {
        "Date": "314-1-31",
        "Details": "Pope Sylvester I succeeds Pope Miltiades."
    },
    {
        "Date": "1504-1-31",
        "Details": "France cedes Naples to Aragon."
    },
    {
        "Date": "1578-1-31",
        "Details": "The Battle of Gembloux takes place."
    },
    {
        "Date": "1606-1-31",
        "Details": "Gunpowder Plot: Guy Fawkes is executed for plotting against Parliament and King James."
    },
    {
        "Date": "1747-1-31",
        "Details": "The first venereal diseases clinic opens at London Lock Hospital."
    },
    {
        "Date": "1801-1-31",
        "Details": "John Marshall is appointed the Chief Justice of the United States."
    },
    {
        "Date": "1814-1-31",
        "Details": "Gervasio Antonio de Posadas becomes Supreme Director of the United Provinces of the Río de la Plata (present-day Argentina)."
    },
    {
        "Date": "1846-1-31",
        "Details": "After the Milwaukee Bridge War, Juneautown and Kilbourntown unify as the City of Milwaukee."
    },
    {
        "Date": "1848-1-31",
        "Details": "John C. Frémont is court-martialed for mutiny and disobeying orders."
    },
    {
        "Date": "1849-1-31",
        "Details": "Corn Laws are abolished in the United Kingdom pursuant to legislation in 1846."
    },
    {
        "Date": "1862-1-31",
        "Details": "Alvan Graham Clark discovers the white dwarf star Sirius B, a companion of Sirius, through an 18.5-inch (47 cm) telescope now located at Northwestern University."
    },
    {
        "Date": "1865-1-31",
        "Details": "American Civil War: The United States Congress passes the Thirteenth Amendment to the United States Constitution, abolishing slavery and submits it to the states for ratification."
    },
    {
        "Date": "1865-1-31",
        "Details": "American Civil War: Confederate General Robert E. Lee becomes general-in-chief."
    },
    {
        "Date": "1891-1-31",
        "Details": "History of Portugal: The first attempt at a Portuguese republican revolution breaks out in the northern city of Porto."
    },
    {
        "Date": "1897-1-31",
        "Details": "Czechoslav Trade Union Association is founded in Prague."
    },
    {
        "Date": "1900-1-31",
        "Details": "Datu Muhammad Salleh is killed in Kampung Teboh, Tambunan, ending the Mat Salleh Rebellion."
    },
    {
        "Date": "1915-1-31",
        "Details": "World War I: Germany is the first to make large-scale use of poison gas in warfare in the Battle of Bolimów against Russia."
    },
    {
        "Date": "1917-1-31",
        "Details": "World War I: Germany announces that its U-boats will resume unrestricted submarine warfare after a two-year hiatus."
    },
    {
        "Date": "1918-1-31",
        "Details": "A series of accidental collisions on a misty Scottish night leads to the loss of two Royal Navy submarines with over a hundred lives, and damage to another five British warships."
    },
    {
        "Date": "1919-1-31",
        "Details": "The Battle of George Square takes place in Glasgow, Scotland."
    },
    {
        "Date": "1929-1-31",
        "Details": "The Soviet Union exiles Leon Trotsky."
    },
    {
        "Date": "1930-1-31",
        "Details": "3M begins marketing Scotch Tape."
    },
    {
        "Date": "1942-1-31",
        "Details": "World War II: Allied forces are defeated by the Japanese at the Battle of Malaya and retreat to Singapore."
    },
    {
        "Date": "1943-1-31",
        "Details": "World War II: German Field Marshal Friedrich Paulus surrenders to the Soviets at Stalingrad, followed 2 days later by the remainder of his Sixth Army, ending one of the war's fiercest battles."
    },
    {
        "Date": "1944-1-31",
        "Details": "World War II: American forces land on Kwajalein Atoll and other islands in the Japanese-held Marshall Islands."
    },
    {
        "Date": "1944-1-31",
        "Details": "World War II: During the Anzio campaign the 1st Ranger Battalion (Darby's Rangers) is destroyed behind enemy lines in a heavily outnumbered encounter at Battle of Cisterna, Italy."
    },
    {
        "Date": "1945-1-31",
        "Details": "US Army private Eddie Slovik is executed for desertion, the first such execution of an American soldier since the Civil War."
    },
    {
        "Date": "1945-1-31",
        "Details": "World War II: About 3,000 inmates from the Stutthof concentration camp are forcibly marched into the Baltic Sea at Palmnicken (now Yantarny, Russia) and executed."
    },
    {
        "Date": "1945-1-31",
        "Details": "World War II: The end of fighting in the Battle of Hill 170 during the Burma Campaign, in which the British 3 Commando Brigade repulsed a Japanese counterattack on their positions and precipitated a general retirement from the Arakan Peninsula."
    },
    {
        "Date": "1946-1-31",
        "Details": "Yugoslavia's new constitution, modeling that of the Soviet Union, establishes six constituent republics (Bosnia and Herzegovina, Croatia, Macedonia, Montenegro, Serbia and Slovenia)."
    },
    {
        "Date": "1946-1-31",
        "Details": "The Democratic Republic of Vietnam introduces the đồng to replace the French Indochinese piastre at par."
    },
    {
        "Date": "1949-1-31",
        "Details": "These Are My Children, the first television daytime soap opera is broadcast by the NBC station in Chicago."
    },
    {
        "Date": "1950-1-31",
        "Details": "United States President Harry S. Truman announces a program to develop the hydrogen bomb."
    },
    {
        "Date": "1953-1-31",
        "Details": "A North Sea flood causes over 1,800 deaths in the Netherlands and over 300 in the United Kingdom"
    },
    {
        "Date": "1957-1-31",
        "Details": "Eight people on the ground in Pacoima, California are killed following the mid-air collision between a Douglas DC-7 airliner and a Northrop F-89 Scorpion fighter jet."
    },
    {
        "Date": "1958-1-31",
        "Details": "The first successful American satellite detects the Van Allen radiation belt."
    },
    {
        "Date": "1961-1-31",
        "Details": "Project Mercury: Mercury-Redstone 2: Ham the Chimp travels into outer space."
    },
    {
        "Date": "1966-1-31",
        "Details": "The Soviet Union launches the unmanned Luna 9 spacecraft as part of the Luna program."
    },
    {
        "Date": "1968-1-31",
        "Details": "Vietnam War: Viet Cong guerrillas attack the United States embassy in Saigon, and other attacks, in the early morning hours, later grouped together as the Tet Offensive."
    },
    {
        "Date": "1968-1-31",
        "Details": "Nauru gains independence from Australia."
    },
    {
        "Date": "1971-1-31",
        "Details": "Apollo program: Apollo 14: Astronauts Alan Shepard, Stuart Roosa, and Edgar Mitchell, aboard a Saturn V, lift off for a mission to the Fra Mauro Highlands on the Moon."
    },
    {
        "Date": "1971-1-31",
        "Details": "The Winter Soldier Investigation, organized by the Vietnam Veterans Against the War to publicize war crimes and atrocities by Americans and allies in Vietnam, begins in Detroit."
    },
    {
        "Date": "1996-1-31",
        "Details": "An explosives-filled truck rams into the gates of the Central Bank of Sri Lanka in Colombo, killing at least 86 people and injuring 1,400."
    },
    {
        "Date": "2000-1-31",
        "Details": "Alaska Airlines Flight 261 crash: An MD-83, experiencing horizontal stabilizer problems, crashes in the Pacific Ocean off the coast of Point Mugu, California, killing all 88 aboard."
    },
    {
        "Date": "2001-1-31",
        "Details": "In the Netherlands, a Scottish court convicts Libyan Abdelbaset al-Megrahi and acquits another Libyan citizen for their part in the bombing of Pan Am Flight 103 over Lockerbie, Scotland in 1988."
    },
    {
        "Date": "2009-1-31",
        "Details": "In Kenya, at least 113 people are killed and over 200 injured following an oil spillage ignition in Molo, days after a massive fire at a Nakumatt supermarket in Nairobi killed at least 25 people."
    }
],