[
    {
        "Date": "153 BC-01-1",
        "Details": "Roman consuls begin their year in office."
    },
    {
        "Date": "45 BC-01-1",
        "Details": "The Julian calendar takes effect as the civil calendar of the Roman Empire, establishing January 1 as the new date of the new year."
    },
    {
        "Date": "42 BC-01-1",
        "Details": "The Roman Senate posthumously deifies Julius Caesar."
    },
    {
        "Date": "AD 69-01-1",
        "Details": "The Roman legions in Germania Superior refuse to swear loyalty to Galba. They rebel and proclaim Vitellius as emperor."
    },
    {
        "Date": "0193-01-1",
        "Details": "The Senate chooses Pertinax against his will to succeed Commodus as Roman emperor."
    },
    {
        "Date": "0404-01-1",
        "Details": "Telemachus, a Christian monk, is killed for attempting to stop a gladiators' fight in the public arena held in Rome."
    },
    {
        "Date": "0417-01-1",
        "Details": "Emperor Honorius forces Galla Placidia into marriage to Constantius, his famous general (magister militum)."
    },
    {
        "Date": "1001-01-1",
        "Details": "Grand Prince Stephen I of Hungary is named the first King of Hungary by Pope Sylvester II."
    },
    {
        "Date": "1068-01-1",
        "Details": "Romanos IV Diogenes marries Eudokia Makrembolitissa and is crowned Byzantine Emperor."
    },
    {
        "Date": "1259-01-1",
        "Details": "Michael VIII Palaiologos is proclaimed co-emperor of the Empire of Nicaea with his ward John IV Laskaris."
    },
    {
        "Date": "1438-01-1",
        "Details": "Albert II of Habsburg is crowned King of Hungary."
    },
    {
        "Date": "1502-01-1",
        "Details": "The present-day location of Rio de Janeiro, Brazil is first explored by the Portuguese."
    },
    {
        "Date": "1515-01-1",
        "Details": "King Francis I of France succeeds to the French throne."
    },
    {
        "Date": "1527-01-1",
        "Details": "Croatian nobles elect Ferdinand I of Austria as King of Croatia in the Parliament on Cetin."
    },
    {
        "Date": "1600-01-1",
        "Details": "Scotland begins its numbered year on January 1 instead of March 25."
    },
    {
        "Date": "1651-01-1",
        "Details": "Charles II is crowned King of Scotland."
    },
    {
        "Date": "1700-01-1",
        "Details": "Russia begins using the Anno Domini era instead of the Anno Mundi era of the Byzantine Empire."
    },
    {
        "Date": "1707-01-1",
        "Details": "John V is crowned King of Portugal."
    },
    {
        "Date": "1739-01-1",
        "Details": "Bouvet Island is discovered by French explorer Jean-Baptiste Charles Bouvet de Lozier."
    },
    {
        "Date": "1772-01-1",
        "Details": "The first traveler's cheques, which can be used in 90 European cities, go on sale in London, England."
    },
    {
        "Date": "1773-01-1",
        "Details": "The hymn that became known as \"Amazing Grace\", then titled \"1 Chronicles 17:16-17\" is first used to accompany a sermon led by John Newton in the town of Olney, Buckinghamshire, England."
    },
    {
        "Date": "1776-01-1",
        "Details": "American Revolutionary War: Norfolk, Virginia is burned by combined Royal Navy and Continental Army action."
    },
    {
        "Date": "1781-01-1",
        "Details": "American Revolutionary War: One thousand five hundred soldiers of the 6th Pennsylvania Regiment under General Anthony Wayne's command rebel against the Continental Army's winter camp in Morristown, New Jersey in the Pennsylvania Line Mutiny of 1781."
    },
    {
        "Date": "1788-01-1",
        "Details": "First edition of The Times of London, previously The Daily Universal Register, is published."
    },
    {
        "Date": "1801-01-1",
        "Details": "The legislative union of Kingdom of Great Britain and Kingdom of Ireland is completed to form the United Kingdom of Great Britain and Ireland."
    },
    {
        "Date": "1801-01-1",
        "Details": "Ceres, the largest and first known object in the Asteroid belt, is discovered by Giuseppe Piazzi."
    },
    {
        "Date": "1803-01-1",
        "Details": "Emperor Gia Long orders all bronze wares of the Tây Sơn dynasty to be collected and melted into nine cannons for the Royal Citadel in Huế, Vietnam."
    },
    {
        "Date": "1804-01-1",
        "Details": "French rule ends in Haiti. Haiti becomes the first black republic and second independent country in North America after the United States"
    },
    {
        "Date": "1806-01-1",
        "Details": "The French Republican Calendar is abolished."
    },
    {
        "Date": "1808-01-1",
        "Details": "The United States bans the importation of slaves."
    },
    {
        "Date": "1810-01-1",
        "Details": "Major-General Lachlan Macquarie officially becomes Governor of New South Wales"
    },
    {
        "Date": "1812-01-1",
        "Details": "The Bishop of Durham, Shute Barrington, orders troops from Durham Castle to break up a miners' strike in Chester-le-Street, Co. Durham"
    },
    {
        "Date": "1822-01-1",
        "Details": "The Greek Constitution of 1822 is adopted by the First National Assembly at Epidaurus."
    },
    {
        "Date": "1833-01-1",
        "Details": "The United Kingdom claims sovereignty over the Falkland Islands."
    },
    {
        "Date": "1847-01-1",
        "Details": "The world's first \"Mercy\" Hospital is founded in Pittsburgh by the Sisters of Mercy; the name will go on to grace over 30 major hospitals throughout the world."
    },
    {
        "Date": "1860-01-1",
        "Details": "First Polish stamp is issued."
    },
    {
        "Date": "1861-01-1",
        "Details": "Porfirio Díaz conquers Mexico City, Mexico."
    },
    {
        "Date": "1863-01-1",
        "Details": "American Civil War: The Emancipation Proclamation takes effect in Confederate territory."
    },
    {
        "Date": "1877-01-1",
        "Details": "Queen Victoria of the United Kingdom is proclaimed Empress of India."
    },
    {
        "Date": "1881-01-1",
        "Details": "Ferdinand de Lesseps begins French construction of the Panama Canal."
    },
    {
        "Date": "1885-01-1",
        "Details": "Twenty-five nations adopt Sandford Fleming's proposal for standard time (and also, time zones)"
    },
    {
        "Date": "1890-01-1",
        "Details": "Eritrea is consolidated into a colony by the Italian government."
    },
    {
        "Date": "1892-01-1",
        "Details": "Ellis Island opens to begin processing immigrants into the United States."
    },
    {
        "Date": "1898-01-1",
        "Details": "New York, New York annexes land from surrounding counties, creating the City of Greater New York. The four initial boroughs, Manhattan, Brooklyn, Queens, and The Bronx, are joined on January 25 by Staten Island to create the modern city of five boroughs."
    },
    {
        "Date": "1899-01-1",
        "Details": "Spanish rule ends in Cuba."
    },
    {
        "Date": "1901-01-1",
        "Details": "Nigeria becomes a British protectorate."
    },
    {
        "Date": "1901-01-1",
        "Details": "The British colonies of New South Wales, Queensland, Victoria, South Australia, Tasmania, and Western Australia federate as the Commonwealth of Australia; Edmund Barton is appointed the first Prime Minister."
    },
    {
        "Date": "1902-01-1",
        "Details": "The first American college football bowl game, the Rose Bowl between Michigan and Stanford, is held in Pasadena, California."
    },
    {
        "Date": "1908-01-1",
        "Details": "For the first time, a ball is dropped in New York City's Times Square to signify the start of the New Year at midnight."
    },
    {
        "Date": "1910-01-1",
        "Details": "Captain David Beatty is promoted to Rear admiral, and becomes the youngest admiral in the Royal Navy (except for Royal family members), since Horatio Nelson."
    },
    {
        "Date": "1912-01-1",
        "Details": "The Republic of China is established."
    },
    {
        "Date": "1914-01-1",
        "Details": "The SPT Airboat Line becomes the world's first scheduled airline to use a winged aircraft."
    },
    {
        "Date": "1920-01-1",
        "Details": "The Belorussian Communist Organisation is founded as a separate party."
    },
    {
        "Date": "1923-01-1",
        "Details": "Britain's Railways are grouped into the Big Four: LNER, GWR, SR, and LMS."
    },
    {
        "Date": "1927-01-1",
        "Details": "The Cristero War begins in Mexico."
    },
    {
        "Date": "1928-01-1",
        "Details": "Boris Bazhanov defects through Iran. He is the only assistant of Joseph Stalin's secretariat to have defected from the Eastern Bloc."
    },
    {
        "Date": "1929-01-1",
        "Details": "The former municipalities of Point Grey, British Columbia and South Vancouver, British Columbia are amalgamated into Vancouver."
    },
    {
        "Date": "1932-01-1",
        "Details": "The United States Post Office Department issues a set of 12 stamps commemorating the 200th anniversary of George Washington's birth."
    },
    {
        "Date": "1934-01-1",
        "Details": "Alcatraz Island becomes a United States federal prison."
    },
    {
        "Date": "1934-01-1",
        "Details": "Nazi Germany passes the \"Law for the Prevention of Genetically Diseased Offspring\"."
    },
    {
        "Date": "1937-01-1",
        "Details": "Safety glass in vehicle windscreens becomes mandatory in the United Kingdom."
    },
    {
        "Date": "1942-01-1",
        "Details": "The Declaration by United Nations is signed by twenty-six nations."
    },
    {
        "Date": "1945-01-1",
        "Details": "World War II: In retaliation for the Malmedy massacre, U.S. troops kill 60 German POWs at Chenogne."
    },
    {
        "Date": "1945-01-1",
        "Details": "World War II: The German Luftwaffe launches Operation Bodenplatte, a massive, but failed attempt to knock out Allied air power in northern Europe in a single blow."
    },
    {
        "Date": "1947-01-1",
        "Details": "The American and British occupation zones in Germany, after World War II, merge to form the Bizone, which later (with the French zone) became part of West Germany."
    },
    {
        "Date": "1947-01-1",
        "Details": "The Canadian Citizenship Act 1946 comes into effect, converting British subjects into Canadian citizens. Prime Minister William Lyon Mackenzie King becomes the first Canadian citizen."
    },
    {
        "Date": "1948-01-1",
        "Details": "The British railway network is nationalized to form British Railways."
    },
    {
        "Date": "1949-01-1",
        "Details": "United Nations cease-fire takes effect in Kashmir from one minute before midnight. War between India and Pakistan stops accordingly."
    },
    {
        "Date": "1950-01-1",
        "Details": "Standard practice uses this day as the origin of the age scale Before Present"
    },
    {
        "Date": "1956-01-1",
        "Details": "Sudan achieves independence from Egypt and the United Kingdom."
    },
    {
        "Date": "1957-01-1",
        "Details": "George Town, Penang becomes a city by a royal charter granted by Elizabeth II."
    },
    {
        "Date": "1958-01-1",
        "Details": "European Economic Community established on this day."
    },
    {
        "Date": "1959-01-1",
        "Details": "Fulgencio Batista, dictator of Cuba, is overthrown by Fidel Castro's forces during the Cuban Revolution."
    },
    {
        "Date": "1960-01-1",
        "Details": "Cameroon achieves independence from France and the United Kingdom."
    },
    {
        "Date": "1962-01-1",
        "Details": "Western Samoa achieves independence from New Zealand; its name is changed to the Independent State of Western Samoa."
    },
    {
        "Date": "1964-01-1",
        "Details": "The Federation of Rhodesia and Nyasaland is divided into the independent republics of Zambia and Malawi, and the British-controlled Rhodesia."
    },
    {
        "Date": "1965-01-1",
        "Details": "The People's Democratic Party of Afghanistan is founded in Kabul, Afghanistan."
    },
    {
        "Date": "1971-01-1",
        "Details": "Cigarette advertisements are banned on American television."
    },
    {
        "Date": "1973-01-1",
        "Details": "Denmark, the United Kingdom, and Ireland are admitted into the European Economic Community."
    },
    {
        "Date": "1978-01-1",
        "Details": "Air India Flight 855 Boeing 747 crashes into the sea, due to instrument failure and pilot disorientation, off the coast of Bombay, India, killing 213."
    },
    {
        "Date": "1979-01-1",
        "Details": "Formal diplomatic relations are established between China and the United States."
    },
    {
        "Date": "1981-01-1",
        "Details": "Greece is admitted into the European Community."
    },
    {
        "Date": "1982-01-1",
        "Details": "Peruvian Javier Pérez de Cuéllar becomes the first Latin American to hold the title of Secretary-General of the United Nations."
    },
    {
        "Date": "1983-01-1",
        "Details": "The ARPANET officially changes to using the Internet Protocol, creating the Internet."
    },
    {
        "Date": "1984-01-1",
        "Details": "The original American Telephone & Telegraph Company is divested of its 22 Bell System companies as a result of the settlement of the 1974 United States Department of Justice antitrust suit against AT&T."
    },
    {
        "Date": "1984-01-1",
        "Details": "Brunei becomes independent of the United Kingdom."
    },
    {
        "Date": "1985-01-1",
        "Details": "The first British mobile phone call is made by Michael Harrison to his father Sir Ernest Harrison, chairman of Vodafone."
    },
    {
        "Date": "1986-01-1",
        "Details": "Aruba becomes independent of Curaçao, though it remains in free association with the Netherlands."
    },
    {
        "Date": "1988-01-1",
        "Details": "The Evangelical Lutheran Church in America comes into existence, creating the largest Lutheran denomination in the United States."
    },
    {
        "Date": "1989-01-1",
        "Details": "The Montreal Protocol comes into force, stopping the use of chemicals contributing to ozone depletion."
    },
    {
        "Date": "1990-01-1",
        "Details": "David Dinkins is sworn in as New York City's first black mayor."
    },
    {
        "Date": "1993-01-1",
        "Details": "Dissolution of Czechoslovakia: Czechoslovakia is divided into the Czech Republic and Slovakia."
    },
    {
        "Date": "1994-01-1",
        "Details": "The Zapatista Army of National Liberation initiates twelve days of armed conflict in the Mexican state of Chiapas."
    },
    {
        "Date": "1994-01-1",
        "Details": "The North American Free Trade Agreement (NAFTA) comes into effect."
    },
    {
        "Date": "1995-01-1",
        "Details": "The World Trade Organization goes into effect."
    },
    {
        "Date": "1995-01-1",
        "Details": "The Draupner wave in the North Sea in Norway is detected, confirming the existence of freak waves."
    },
    {
        "Date": "1996-01-1",
        "Details": "Curaçao gains limited self-government, though it remains within free association with the Netherlands."
    },
    {
        "Date": "1998-01-1",
        "Details": "Russia begins to circulate new rubles to stem inflation and promote confidence."
    },
    {
        "Date": "1999-01-1",
        "Details": "Euro currency is introduced in 11 member nations of the European Union (with the exceptions of the United Kingdom, Denmark, Greece and Sweden; Greece later adopts the euro)."
    },
    {
        "Date": "2002-01-1",
        "Details": "Euro currency becomes legal tender in twelve of the European Union's member states."
    },
    {
        "Date": "2004-01-1",
        "Details": "In a vote of confidence, General Pervez Musharraf wins 658 out of 1,170 votes in the Electoral College of Pakistan, and according to Article 41(8) of the Constitution of Pakistan, is \"deemed to be elected\" to the office of President until October 2007."
    },
    {
        "Date": "2007-01-1",
        "Details": "Adam Air Flight 574 disappears over Sulawesi Strait, Indonesia with 102 people on board."
    },
    {
        "Date": "2009-01-1",
        "Details": "Sixty-six people die in a nightclub fire in Bangkok, Thailand."
    },
    {
        "Date": "2010-01-1",
        "Details": "A suicide car bomber detonates at a volleyball tournament in Lakki Marwat, Pakistan, killing 105 and injuring 100 more."
    },
    {
        "Date": "2011-01-1",
        "Details": "A bomb explodes as Coptic Christians in Alexandria, Egypt, leave a new year service, killing 23 people."
    },
    {
        "Date": "2013-01-1",
        "Details": "At least 60 people are killed and 200 injured in a stampede after celebrations at Félix Houphouët-Boigny Stadium in Abidjan, Ivory Coast."
    },
    {
        "Date": "2016-01-1",
        "Details": "The Address Downtown Dubai burns over midnight as the New Year is rung in. The blaze started on the night of New Year's Eve 2015, by currently unknown causes. There was one fatality."
    },
    {
        "Date": "2017-01-1",
        "Details": "An attack on a nightclub in Istanbul, Turkey, during New Year's celebrations, kills at least 39 people and injures more than 60 others."
    },
    {
        "Date": "2017-01-1",
        "Details": "Portuguese politician and diplomat António Guterres was officially elected Secretary-General of the United Nations."
    }
]